Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/appendix.po
Languages: fr, sl

source: Appendix
fr: Annexe
sl: Dodatek

source: Additional Resources
fr: Ressources Complémentaires
sl: Dodatni viri

source: Got questions? Need more information? Want to :ref:`contribute <contributing>`? There are a variety of other resources where you can find out more:
fr: Vous avez des questions ? Besoin d'informations complémentaires ? Vous voulez :ref:`contribuer <contributing>` ? Il existe une variété d'autres ressources où vous pouvez en savoir plus:
sl: Imate vprašanja? Potrebujete več podatkov? Ali bi radi :ref: prispevali <contributing>`? Obstaja mnogo virov, kjer lahko izveste več:

source: **Mixxx Website**: For general information and updates, as well as the latest news on Mixxx, go to: `<https://mixxx.org>`_
fr: **Site web de Mixxx** : Pour des informations générales et des mises à jour, ainsi que les dernières informations sur Mixxx, consultez : `<https://mixxx.org>`_
sl: **Mixxx spletna stran**: Za splošne informacije in nadgradnje, kot tudi zadnje novice o Mixxx, pojdite na: `<https://mixxx.org>`_

source: **Mixxx Wiki**: For up-to-date information about supported DJ hardware, documentation on making controller mappings, and other tips and tricks, go to: `<https://mixxx.org/wiki/>`_
fr: **Mixxx Wiki** : pour des informations à jour sur le matériel DJ pris en charge, la documentation sur la création de mappages de contrôleurs et d'autres conseils et astuces, rendez-vous sur : `<https://mixxx.org/wiki/>`_
sl: **Mixxx Wiki**: Za ažurne informacije o podprti strojni opremi, dokumentaciji o izdelavi mapiranj za kontrolerje ter drugih trikih, pojdite na: `<https://mixxx.org/wiki/>`_

source: **Mixxx Community Forums**: To search for answers, post your question or answer other DJ's questions, go to: `<https://mixxx.org/forums>`_
fr: **Les forums communautaires Mixxx** : Pour trouver des réponses, poser votre question ou répondre aux questions d'autres DJ, rendez-vous sur : `<https://mixxx.org/forums>`_
sl: **Mixxx forumi skupnosti**: Za iskanje odgovorov, posredovanje vprašanja ali odgovorov na vprašanja drugih didžejev, se pdoajte na: `<https://mixxx.org/forums>`_

source: **Mixxx Zulip Chat**: Hang out with Mixxx developers and users on our `Zulip chat <https://mixxx.zulipchat.com/>`_. Stand-alone `apps for Zulip <https://zulipchat.com/apps/>`_ can be configured to use the server ``mixxx.zulipchat.com``.
fr: **Mixxx Zulip Chat** : Passer du temps avec les développeurs et les utilisateurs de Mixxx sur notre `Zulip chat <https://mixxx.zulipchat.com/>`_. Les `applications autonomes pour Zulip <https://zulipchat.com/apps/>`_ peuvent être configurées pour utiliser le serveur ``mixxx.zulipchat.com``.
sl: **Mixxx Zulip klepet**: Podružite se z drugimi razvijalci in uporabniki Mixxx na v `Zulip klepetalnici <https://mixxx.zulipchat.com/>`_. Samostojne aplikacije za Zulip <https://zulipchat.com/apps/>`_ je mogoče nastaviti za rabo s strežnikom ``mixxx.zulipchat.com``.

source: **Mixxx Source Code**: To download the source code for Mixxx, go to: `<https://github.com/mixxxdj/mixxx>`_
fr: **Code source de Mixxx** : Pour télécharger le code source de Mixxx, visiter : `<https://github.com/mixxxdj/mixxx>`_
sl: **Mixxx izvorna koda**: Za prenos izvorne kode za Mixxx pojdite na: `<https://github.com/mixxxdj/mixxx>`_

source: **Mixxx Bug Tracker**: To report a bug or request a feature, go to: `<https://bugs.launchpad.net/mixxx>`_
fr: **Mixxx Bug Tracker** : Pour rapporter un bug ou demander une fonctionnalité, consulter : `<https://bugs.launchpad.net/mixxx>`_
sl: **Mixxx sledilnik hroščem**: Za prijavo hrošča ali predlog funkcije obiščite: `<https://bugs.launchpad.net/mixxx>`_

source: **Mixxx Translations**: To translate Mixxx and promote your mother tongue, go to: `<https://www.transifex.com/mixxx-dj-software/public/>`_. Please read the `Translation FAQ <https://mixxx.org/wiki/doku.php/internationalization>`_ first.
fr: **Traductions Mixxx**: Pour traduire Mixxx et promouvoir votre langue maternelle, rendez-vous sur: `<https://www.transifex.com/mixxx-dj-software/public/>`_. Veuillez d'abord lire `Translation FAQ <https://mixxx.org/wiki/doku.php/internationalization>`_.
sl: **Mixxx prevodi**: Za prevajanje Mixxxa in promocijo maternega jezika obiščite: `<https://www.transifex.com/mixxx-dj-software/public/>`_. Pogosta vprašanja glede prevajanja najdete na : <https://mixxx.org/wiki/doku.php/internationalization>`.

source: **Social Media**: Follow us on `Twitter <https://twitter.com/mixxxdj>`_, and `Facebook <https://www.facebook.com/pages/Mixxx-DJ-Software/21723485212>`_.
fr: **Réseaux sociaux**: Suivez-nous sur `Twitter <https://twitter.com/mixxxdj>`_, et `Facebook <https://www.facebook.com/pages/Mixxx-DJ-Software/21723485212>`_.
sl: **Družbena omrežja**: Sledite nam na `Twitterju <https://twitter.com/mixxxdj>`_, in `Facebooku <https://www.facebook.com/pages/Mixxx-DJ-Software/21723485212>`_.

source: Keyboard mapping table
fr: Tableau des raccourcis clavier
sl: Tabela z razporedom tipk

source: Shortcuts let you work more efficiently. This table lists the default keyboard shortcuts for accessing Mixxx with an English keyboard layout. Depending on your language settings the defaults may be different.
fr: Les raccourcis vous permettent de travailler plus efficacement. Ce tableau liste les raccourcis par défaut pour accéder aux fonctions de Mixxx pour une disposition anglaise (QWERTY). En fonction de vos paramètres locaux, les réglages par défaut peuvent différer.
sl: Bližnjice omogočajo bolj učinkovito delo. Ta tabela prikazuje privzete bližnjice na tipkovnici z angleškim razporedom tipk. Glede na vaše jezikovne nastavitve se lahko te privzete kombinacije razlikujejo.

source: Function
fr: Fonction
sl: Funkcija

source: Deck 1
fr: Platine 1
sl: Predvajalnik 1

source: Deck 2
fr: Platine 2
sl: Predvajalnik 2

source: Master
fr: Principal
sl: Glavni master

source: **Mixer**
fr: **Table de mixage**
sl: **Mikser**

source: Crossfade Left
fr: Curseur de mixage gauche
sl: Preliv levo

source: Crossfade Right
fr: Fondu enchaîné droit
sl: Preliv desno

source: Small Crossfade Left
fr: Petit fondu enchaîné gauche
sl: Kratek preliv levo

source: Shift + G
fr: Majuscule + G

source: Small Crossfade Right
fr: Petit fondu enchaîné droit
sl: Kratek preliv desno

source: Shift + H
fr: Majuscule + H

source: Activate/Disable Effects Unit
fr: Activer/désactiver l'unité d'effets
sl: Vključi/izključi efekt enoto

source: Headphone Cue (Pre-fader listen)
fr: Repère au Casque (écoute avant-curseur)
sl: Predposlušanje s slušalkami (PFL)

source: Bass Kill
fr: Supprimer les basses
sl: Izniči bas

source: **Playback**
fr: **Lecture**
sl: **Predvajanje**

source: Load selected track to deck
fr: Charger la piste sélectionnée sur la platine
sl: Naloži izbrano skladbo v predvajalnik

source: Shift + left
fr: Majuscule + gauche
sl: Shift + levo

source: Shift + right
fr: Majuscule + droite
sl: Shift + desno

source: Unload track from deck
fr: Décharger la piste sélectionnée de la platine
sl: Odstrani skladbo iz predvajalnika

source: Alt + Shift + left
fr: Alt + Majuscule + gauche
sl: Alt + Shift + levo

source: Alt + Shift + right
fr: Alt + Majuscule + droite
sl: Alt + Shift + desno

source: Playback
fr: Lecture
sl: Predvajanje

source: Seek Backwards
fr: Recherche vers l'arrière
sl: Vrti nazaj

source: Reverse Playback
fr: Inversion du sens de lecture
sl: Vzvratno predvajanje

source: Shift + A
fr: Majuscule + A

source: Shift + J
fr: Majuscule + J

source: Seek Forwards
fr: Recherche vers l'avant
sl: Vrti naprej

source: Tempo Adjust Down
fr: Ajustement tempo - Réduction
sl: Zmanjšaj tempo

source: Tempo Adjust Up
fr: Ajustement tempo - Augmentation
sl: Povečaj tempo

source: Small Tempo Adjust Down
fr: Ajustement tempo - Réduction faible
sl: Malo zmanjšaj tempo

source: Shift + F1
fr: Majuscule + F1

source: Shift + F5
fr: Majuscule + F5

source: Small Tempo Adjust Up
fr: Ajustement tempo - Augmentation faible
sl: Malo povečaj tempo

source: Shift + F2
fr: Majuscule + F2

source: Shift + F6
fr: Majuscule + F6

source: Temporary Tempo Adjust Down
fr: Ajustement temporaire du tempo - Réduction
sl: Začasno zmanjšaj tempo

source: Temporary Tempo Adjust Up
fr: Ajustement temporaire du tempo - Augmentation
sl: Začasno povečaj tempo

source: Small Temporary Tempo Adjust Down
fr: Ajustement temporaire du tempo - Réduction faible
sl: Začasno malo povečaj tempo

source: Shift + F3
fr: Majuscule + F3

source: Shift + F7
fr: Majuscule + F7

source: Small Temporary Tempo Adjust Up
fr: Ajustement temporaire du tempo - Augmentation faible
sl: Začasno malo zmanjšaj tempo

source: Shift + F4
fr: Majuscule + F4

source: Shift + F8
fr: Majuscule + F8

source: Tempo (BPM) Sync
fr: Synchronisation tempo (BPM)
sl: Tempo (BPM) sinhronizacija

source: BPM Tap Tempo Adjust
fr: Ajustement tempo par de battement BPM
sl: Prilagajanje BPM tempa s tapkanjem

source: Shift + !
fr: Majuscule + !

source: Shift + ^
fr: Majuscule + ^

source: **Cue and Loop**
fr: **Repère et Boucle**
sl: **Iztočnice in zanke**

source: Set Cuepoint
fr: Placer un point de repère
sl: Postavi cue iztočnico

source: Shift + D
fr: Majuscule + D

source: Shift + L
fr: Majuscule + L

source: Cue
fr: Repère
sl: Cue iztočnica

source: Cue Go-to-and-stop
fr: Va-et-arrête au Repère
sl: Skoči na Cue iztočnico in ustavi

source: Shift + F
fr: Majuscule + F

source: Shift + :
fr: Majuscule + :

source: Activate 4 Beat Loop
fr: Activer boucle de 4 temps
sl: Aktiviraj zanko s 4 dobami

source: Halve Beat Loop Size
fr: Boucle de battement réduite de moitié
sl: Razpolovi velikost ritmične zanke

source: Double Beat Loop Size
fr: Boucle de battement doublée
sl: Podvoji velikost ritmične zanke

source: Set Loop In Point
fr: Placer un point d'entrée de boucle
sl: Postavi vhodno točko zanke

source: Set Loop Out Point (Activates Loop)
fr: Placer un point de sortie de boucle (Activer la boucle)
sl: Postavi izhodno točko zanke (vključi zanko)

source: Toggle Loop On/Off
fr: Activer/Désactiver la boucle
sl: Preklop vključena/izključena zanka

source: Set Hot cue 1
fr: Placer le repère rapide 1
sl: Postavi hotcue iztočnico 1

source: Set Hot cue 2
fr: Placer le repère rapide 2
sl: Postavi hotcue iztočnico 2

source: Set Hot cue 3
fr: Placer le repère rapide 3
sl: Postavi hotcue iztočnico 3

source: Set Hot cue 4
fr: Placer le repère rapide 4
sl: Postavi hotcue iztočnico 4

source: Clear Hot cue 1
fr: Effacer le repère rapide 1
sl: Počisti hotcue iztočnico 1

source: Shift + Z
fr: Majuscule + Z

source: Shift + M
fr: Majuscule + M

source: Clear Hot cue 2
fr: Effacer le repère rapide 2
sl: Počisti hotcue iztočnico 2

source: Shift + X
fr: Majuscule + X

source: Shift + <
fr: Majuscule + <

source: Clear Hot cue 3
fr: Effacer le repère rapide 3
sl: Počisti hotcue iztočnico 3

source: Shift + C
fr: Majuscule + C

source: Shift + >
fr: Majuscule + >

source: Clear Hot cue 4
fr: Effacer le repère rapide 4
sl: Počisti hotcue iztočnico 4

source: Shift + V
fr: Majuscule + V

source: Shift + ?
fr: Majuscule + ?

source: Microphone Talkover
fr: Microphone par dessus la musique
sl: Preglasitev z mikrofonom

source: Shuffle Auto DJ playlist
fr: Mélanger la liste de lecture Auto DJ
sl: Premešaj Auto DJ seznam predvajanja

source: Shift + F9
fr: Majuscule + F9

source: Skip next track in Auto DJ
fr: Sauter la piste suivante dans Auto DJ
sl: Preskoči naslednjo skladbo v Auto DJ sezamu

source: Shift + F10
fr: Majuscule + F10

source: Fade to next track in Auto DJ
fr: Atténuer pour la piste suivante dans Auto DJ
sl: Prelji v naslednjo skladbo iz Auto Dj seznama

source: Shift + F11
fr: Majuscule + F11

source: Toggle Auto DJ on/Off
fr: Activer/Désactiver Auto DJ
sl: Vključi/izključi Auto DJ

source: Shift + F12
fr: Majuscule + F12

source: **Preview Deck**
fr: **Platine d'aperçu**
sl: **Predvajalnik za predogled**

source: Load Selected Track And Play
fr: Charger la piste sélectionnée et la jouer
sl: Naloži izbrano skladbo in predvajaj

source: Alt + Return
fr: Alt + Retour arrière

source: Start/Stop
fr: Démarrer/Arrêter

source: Return
fr: Retour arrière
sl: Vrni se

source: Alt + Left
fr: Alt + Gauche
sl: Alt + levo

source: Alt + Right
fr: Alt + Droite
sl: Alt + desno

source: **Vinyl Control**
fr: **Contrôle Vinyle**
sl: **Gramofonsko upravljanje**

source: Passthrough
fr: Contrôle intermédiaire
sl: Prehod

source: Vinylcontrol Mode
fr: Mode Vinylcontrol
sl: Način gramofonskega upravljanja

source: Ctrl + Shift + Y
fr: Ctrl + Majuscule + Y

source: Ctrl + Shift + U
fr: Ctrl + Majuscule + U

source: Vinylcontrol Cueing
fr: Pré-écoute Vinylcontrol
sl: Predposlušanje za gramofonsko upravljanje

source: Single Deck Toggle / Swap Decks
fr: Basculer platine simple / Inverser platines
sl: Preklapljanje / zamenjava predvajalnika pri enem predvajalniku

source: **Search bar**
fr: **Barre de recherche**
sl: **Iskalnik***

source: Clear input
fr: Effacer la saisie
sl: Počisti vhod

source: Ctrl + Back
fr: Ctrl + Retour arrière

source: Exit search and leave focus
fr: Quitter la recherche et le focus
sl: Izhod iz iskanja in opusti fokus

source: ESC
fr: Echap

source: **Library**
fr: **Bibliothèque**
sl: **Zbirka**

source: Select all files in current list
fr: Sélectionner tous les fichiers de la liste actuelle
sl: Izberi vse datoteke v trenutnem seznamu

source: Select group of files in current list
fr: Sélectionner un groupe de fichiers dans la liste actuelle
sl: Izberi skupino datotek iz trenutnega seznama

source: Click first item, hold Shift key, click last item
fr: Cliquer le premier élément, maintenir la touche Shift, cliquer le dernier élément
sl: Kliknite na prvi element, držite tipko Shift in nato kliknite na zadnji element.

source: Mixxx allows you to customize the keyboard shortcuts. For more information, and to download a keyboard mapping image, go to :ref:`control-keyboard`.
fr: Mixxx vous permet de personnaliser les raccourcis clavier. Pour plus d'informations, et pour télécharger un mapping de clavier, allez à :ref:`control-keyboard`.
sl: Mixxx omogoča prilagajanje bližnjic tipkovnice. Za več inforrmacij in prenos razporeditev tipk, pojdite na :ref:`control-keyboard`.

source: Application shortcuts
fr: Raccourcis de l'application
sl: Bližnjice za aplikacije

source: Use these shortcuts to access features available in the menu on top of the application window.
fr: Utilisez ces raccourcis pour accéder aux fonctionnalités disponibles dans le menu en haut de la fenêtre de l'application.
sl: Uporabite te bližnjice za dopstop do funkciji, ki so na voljo v meniju na vrhu okna aplikacije.

source: Key
fr: Tonalité
sl: Tonaliteta

source: **File menu**
fr: **Menu Fichier**
sl: **Datoteka menu**

source: Load Track to Deck 1
fr: Charger la piste sur la platine 1
sl: Naloži skladbo v predvajalnik 1

source: Load Track to Deck 2
fr: Charger la piste sur la platine 2
sl: Naloži skladbo v predvajalnik 2

source: Ctrl + Shift + O
fr: Ctrl + Majuscule + O

source: **Library menu**
fr: **Menu Bibliothèque**
sl: **Zbirka meni **

source: Add new Playlist
fr: Ajouter une nouvelle liste de lecture
sl: Dodaj nov seznam predvajanja

source: Add new Crate
fr: Ajouter nouveau bac
sl: Dodaj nov zaboj

source: Ctrl + Shift + N
fr: Ctrl + Majuscule + N

source: **View menu**
fr: **Menu Affichage**
sl: **Pogled menu**

source: Show Skin Settings Menu
fr: Afficher le menu de réglage du thème
sl: Prikaži nastavitve za preobleko

source: Show Microphone Section
fr: Afficher la section microphone
sl: Prikaži mikrofonski razdelek

source: Show Vinyl Control Section
fr: Montrer la section de contrôle des vinyles
sl: Prikaži razdelek za gramofonsko upravljanje

source: Show Preview Deck
fr: Montrer la platine de pré-écoute
sl: Prikaži predvajalnik za predogled

source: Show Cover Art
fr: Afficher la pochette d'album
sl: Prikaži naslovnico

source: Maximize Library
fr: Maximiser la bibliothèque
sl: Povečaj zbirko

source: Space
fr: Espace

source: Full Screen (Windows & Linux)
fr: Plein écran (Windows & Linux)
sl: Cel zaslon (Windows & Linux)

source: Full Screen (macOS)
fr: Plein écran (macOS)
sl: Cel zaslon (MacOS)

source: **Options menu**
fr: **Menu options**
sl: **Možnosti menu**

source: Enable Vinyl Control 1
fr: Activer le contrôle vinyle 1
sl: Vkjuči gramofonsko upravljanje 1

source: Enable Vinyl Control 2
fr: Activer le contrôle vinyle 2
sl: Vkjuči gramofonsko upravljanje 2

source: Enable Vinyl Control 3
fr: Activer le contrôle vinyle 3
sl: Vkjučii gramofonsko upravljanje 3

source: Enable Vinyl Control 4
fr: Activer le contrôle vinyle 4
sl: Vkjučii gramofonsko upravljanje 4

source: Enable Live Broadcasting
fr: Activer la diffusion en direct
sl: Vključi prenos v živo

source: Record Mix
fr: Enregistrer le mix
sl: Posnemi miks

source: Enable Keyboard Shortcuts
fr: Activer les raccourcis clavier
sl: Omogoči bližnjice na tipkovnici

source: Open Preferences (Windows & Linux)
fr: Ouvrir les préférences (Windows & Linux)

source: Open Preferences (macOS)
fr: Ouvrir les préférences (MacOS)
sl: Odpri nastavitve (MacOS)

source: Exit Mixxx
fr: Quitter Mixxx.
sl: Zapri Mixxx

source: **Developer menu**
fr: **Menu Développeur**
sl: **Razvijalec menu**

source: Reload skin
fr: Recharger le thème
sl: Ponovno naloži preobleko

source: Ctrl + Shift + R
fr: Ctrl + Majuscule + R

source: Developer Tools
fr: Outils de développement
sl: Razvojna orodja

source: Ctrl + Shift + T
fr: Ctrl + Majuscule + T

source: Stats: Base Bucket
fr: Statistiques : paquet de base
sl: Stat.: Osnovno vedro

source: Ctrl + Shift + B
fr: Ctrl + Majuscule + B

source: Stats: Experiment Bucket
fr: Statistiques : paquet expérimental
sl: Stat.: Eksperimentalno vedro

source: Ctrl + Shift + E
fr: Ctrl + Majuscule + E

source: Debugger Enabled
fr: Débogueur activé
sl: Vklopi razhroščevalnik

source: Ctrl + Shift + D
fr: Ctrl + Majuscule + D

source: The :kbd:`Ctrl` key on Windows & Linux is equivalent to the :kbd:`Command` key on macOS. The :kbd:`Alt` key on Windows & Linux is equivalent to the :kbd:`Option` key on macOS. Application shortcuts are not customizable.
fr: La touche :kbd:`CTRL` sous Windows & Linux est équivalente à la touche :kbd:`COMMAND` sous MacOS. La touche :kbd:`ALT` sous Windows & Linux est équivalente à la touche :kbd:`OPTION` sous MacOS. Les raccourcis de l'application ne sont pas paramétrables.
sl: Tipka :kbd:`Ctrl` v Windowsih & Linuxu je enaka tipki :kbd:`Command` na Mac OS X. Ttipka :kbd:`Alt` v Windowsih & Linuxu je enaka tipki :kbd:`Option` na Mac OS X. Bližnjic za aplikacije ni mogoče prilagajati.

source: The Developer menu is available if Mixxx is started using the :ref:`appendix-command-line-options`.
fr: Le menu développeur est disponible si Mixxx est démarré à l’aide de la touche :ref:`appendix-command-line-options`.
sl: Menu Razvijalec je na voljo, kadar je Mixxx zagnan z :ref:`appendix-command-line-options`.

source: Command line options
fr: Options de ligne de commande
sl: Opcije ukazne vrstice

source: Mixxx is designed to be as user-friendly as possible. As such, its command line options are only useful for development or debugging, as they make these tasks easier. Command line options are case-sensitive.
fr: Mixxx est conçu pour être aussi convivial que possible. En tant que telles, ses options de ligne de commande ne sont utiles que pour le développement ou le débogage, car elles facilitent ces tâches. Les options de ligne de commande sont sensibles à la casse.
sl: Mixxx je načrtovan kot čim bolj uporabniško prijazen program. Zato so opcije ukazne vrstice omejene na razvoj in razhroščevanje, kjer olajšajo delo. Opcije ukazne vrstice so občutljive na velikost črk.

source: Load the specified music file(s) at start-up. Each file you specify will be loaded into the next virtual deck. For a list of supported file types, go to :ref:`configuration-import`
fr: Charger le ou les fichiers de musique spécifiés au démarrage. Chaque fichier que vous spécifiez sera chargé sur la prochain platine virtuel. Pour une liste des types de fichiers pris en charge, accédez à :ref:`configuration-import`
sl: Ob zagonu naloži vnaprej določene glasbene datoteke (datoteko). Vsaka skladba bo naložena v naslednji virtualni predvajalnik. Za seznam podprtih datotek pojdite na :ref:`configuration-import`

source: Top-level directory where Mixxx should look for its resource files such as MIDI mappings, overriding the default installation location.
fr: Répertoire de niveau supérieur dans lequel Mixxx doit rechercher ses fichiers de ressources, tels que les mappages MIDI, en remplaçant l'emplacement d'installation par défaut.
sl: Vrhnji direktorij v katerem Mixxx išče resurse, kot so MIDI mapiranja. S tem se povozi sicer privzeta lokacija namestitve.

source: Top-level directory where Mixxx should look for sound source plugins in addition to default locations.
fr: Répertoire de niveau supérieur dans lequel Mixxx doit rechercher des greffons de source sonore en plus de l'emplacement par défaut.
sl: Vrhnji direktorij v kateremu naj Mixxx, poleg privzetih lokaciji, išče zvočne vstavke.

source: Top-level directory where Mixxx should look for user settings files such as the library database and preferences configuration file.
fr: Répertoire de niveau supérieur dans lequel Mixxx doit rechercher des fichiers de paramètres utilisateur tels que la base de données de la bibliothèque et le fichier de configuration des préférences.
sl: Vrhnji direktorij v katerem Mixxx išče uporabniške nastavitve, kot denimo podatkovno bazo zbirke ali konfiguracijsko datoteko z nastavitvami.

source: Causes Mixxx to display/log all controller data it sends and receives, and script functions it loads.
fr: Force Mixxx à afficher/journaliser toutes les données de contrôleur qu'il envoi et reçoit, et les fonctions de script qu’il charge.
sl: Povzroči, da Mixxx prikaže/ beleži vse podatke kontrolerja, ki jih prejme in vse funkcije skript, ki jih naloži.

source: Enables developer-mode. Includes extra log info, stats on performance, a Developer tools menu, extra developer skins, and provides useful information for skin writers in widget tooltips and logs .
fr: Active le mode développeur. Inclut des informations de journal supplémentaires, des statistiques de performances, un menu Outils de développement, des thèmes de développeur supplémentaires et fournit des informations utiles aux créateurs de thèmes dans les info-bulles et les journaux de widgets.
sl: Vklopi razvojni modus. Vsebuje dodatne beležke, statistiko o zmogljivosti, menu za razvojna orodja, posebne razvojne preobleke, ponuja pa tudi uporabne informacije za pisce preoblek v obliki namigov in beležk.

source: Disables risky things at start up. This should help troubleshoot crashes at startup or if Mixxx won't boot.
fr: Désactive les objets risqués au démarrage. Cela devrait aider à résoudre les problèmes de plantage au démarrage ou si Mixxx ne démarre pas.
sl: Onemogoči tvegane reči ob zagonu. To naj bi pomagalo pri odpravljanju sesuvanj ob zagonu ali v primeru, da se Mixxx ne želi zagnati.

source: Automatically loads empty waveforms
fr: Charge automatiquement des formes d'onde vides
sl: Samodejno naloži prazne valovne oblike

source: Disables spinning vinyl widgets
fr: Désactive le widget vinyle en rotation
sl: Onemogoči vrtenje virtualnega gramofona

source: Disables synchronization polling
fr: Désactive la scrutation de synchronisation
sl: OOnemogoči vrednotenje sinhronizacije

source: Doesn't open controllers by default
fr: N'ouvre pas les contrôleurs par défaut
sl: Ne odpre kontrolerjev, kot privzeto

source: Use a custom locale for loading translations (e.g ``fr``)
fr: Utiliser des paramètres régionaux personnalisés pour charger les traductions (par exemple, 'fr')
sl: Uporabi lastne krajevne nastavitve za nalaganje prevodov (npr. 'fr')

source: Starts Mixxx in full-screen mode
fr: Démarre Mixxx en mode plein écran
sl: Zaženi Mixxx preko celega zaslona
