Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/appendix.po
Languages: fr, sl

source: Sets the verbosity of command line logging
fr: Définit le niveau de détail de la journalisation en ligne de commande
sl: Določi količino izpisa za beležko v ukazni vrstici

source: ``critical`` - Critical/Fatal only
fr: ``critical`` - Critique/Fatal uniquement
sl: ``critical`` - zgolj kritične/fatalne

source: ``warning`` - Above + Warnings
fr: ``warning`` - Ci-dessus + avertissements
sl: ``warning`` - gornje + opozorila

source: ``info`` - Above + Informational messages
fr: ``info`` - Ci-dessus + Messages d'information
sl: ``info`` - gornje + informativna sporočila

source: ``debug`` - Above + Debug/Developer messages
fr: ``debug`` - Ci-dessus + Messages de débogage/développeur
sl: ``debug`` - Above + razvojna/razhroščevalna sporočila

source: ``trace`` - Above + Profiling messages
fr: ``trace`` - Ci-dessus + Messages de profilage
sl: ``trace`` - Above + profilirna sporočila

source: Sets the logging level at which the log buffer is flushed to ``mixxx.log``. LEVEL is one of the values defined at ``--logLevel`` above.
fr: Définit le niveau de journalisation auquel le tampon de journal est vidé à ``mixxx.log``. LEVEL est l'une des valeurs définies à ``--logLevel`` ci-dessus.
sl: Določi nivo beleženja na katerem bo medpomnilnik dnevnika prenešen v mixxx.log. LEVEL je ena od vrednosti definirana v --logLevel zgoraj.

source: Breaks (SIGINT) Mixxx, if a DEBUG_ASSERT evaluates to false. Under a debugger you can continue afterwards. This will also avoid to switch the MIXXX_DEBUG_ASSERTIONS_FATAL flag which leads to a time consuming full rebuild. Now the MIXXX_DEBUG_ASSERTIONS_FATAL is only respected if ``--debugAssertBreak`` is not passed.
fr: Interrompt (SIGINT) Mixxx, si un DEBUG_ASSERT est évalué à faux. Sous un débogueur, vous pouvez continuer ensuite. Cela évitera également de commuter l'indicateur MIXXX_DEBUG_ASSERTIONS_FATAL, ce qui entraîne une reconstruction complète qui prend du temps. Maintenant, MIXXX_DEBUG_ASSERTIONS_FATAL n'est respecté que si ``--debugAssertBreak`` n'est pas passé.
sl: Prekine (SIGINT) Mixxx, če ima DEBUG_ASSERT vrednost napačno. V razhroščevalniku je potem mogoče nadaljevati. To prepreči preklop zastavice MIXXX_DEBUG_ASSERTIONS_FATAL, ki zahteva izgradnjo na novo. Sedaj se MIXXX_DEBUG_ASSERTIONS_FATAL postavi le, če ``--debugAssertBreak`` ni bil dosežen.

source: Display this help message and exit
fr: Afficher ce message d'aide et quitter
sl: Prikaži to sporočilo o pomoči in izstopi

source: Developer tools
fr: Outils de développement
sl: Razvojna orodja

source: To start Mixxx in Developer mode from a custom resource directory with :term:`MIDI` and :term:`HID` logging enabled, type the following line into the terminal and hit return: ::
fr: Pour démarrer Mixxx en mode développeur à partir d'un répertoire de ressources personnalisé avec :term:`MIDI` et :term:`HID` activé, taper la ligne suivante dans le terminal et cliquer sur Entrée: ::
sl: Za zagon programa Mixxx z razvojnem modusu iz do9ločenega direktorija z viri z vklopljenimi beleženjem :term:`MIDI` in :term:`HID` , vtipkajte naslednjo vrstico v terminal: ::

source: Experiment modes for rapid development and testing
fr: Modes d’expérimentation pour développement et tests rapides
sl: Ekspermientalni način za hitro razvijanje in testiranje

source: Adds a static Experiment class with a tri-state mode flag that indicates whether the experiment mode is OFF, BASE, or EXPERIMENT.
fr: Ajoute une classe d'expérimentation statique avec un indicateur de mode à trois états indiquant si le mode de test est défini sur OFF, BASE ou EXPERIMENT.
sl: Doda statični razred Experiment z zastavico s tremi stanji, ki prikazuje ali je eksperimentalni način izklopljen, osnoven ali eksperimentalen - OFF, BASE, ali EXPERIMENT.

source: Adds :menuselection:`Developer --> Stats:Experiment Bucket` and :menuselection:`Developer --> Stats:Base Bucket`. Each one toggles between OFF and BASE/EXPERIMENT so you can choose exactly what time spans you would like to collect in your base and experiment buckets.
fr: Ajoute :menuselection:`Developer-->Stats:Experiment Bucket` et :menuselection:`Developer-->Stats:Base Bucket`. Chacun d'entre eux bascule entre OFF et BASE/EXPERIMENT afin que vous puissiez choisir exactement la durée que vous souhaitez collecter dans votre base et les bennes d'expérimentation.
sl: Doda :menuselection:`Razvijalec-->Stat.: Eksperimentalno vedro` in :menuselection:`Developer-->Stat.: Osnovno vedro`. S temi preklapljamo med stanji OFF in BASE/EXPERIMENT, tako da lahko točno določite, katere časovne razpone bi radi zbirali v osnovnih in eksperimentalnih vedrih.

source: Updates StatsManager to segment collected stats into a base and experiment bucket. This allows you to quickly measure the difference a code change has on relevant counters / timers within the same execution of Mixxx.
fr: Met à jour StatsManager pour segmenter les statistiques collectées dans une benne de base et de test. Cela vous permet de mesurer rapidement la différence d'un changement de code sur les compteurs / timers pertinents au sein de la même exécution de Mixxx.
sl: Posodobi Statsmanager na statistiko zbrano v segmentu v osnovno in eksperimentalno vedro. Tako lahko hitro izmerite razliko, ki jo ima sprememba kode na ustrezne števce / merilnike časa v istem zagonu programa Mixxx.

source: This is useful for quickly enabling and disabling a code change without a re-compile/re-run cycle to get an anecdotal sense of how it "feels" as well as a quantified sense of how it differs in terms of stats Mixxx collects.
fr: Ceci est utile pour activer et désactiver rapidement un changement de code sans cycle de recompilation/ré-exécution pour obtenir une impression de "ressenti" ainsi qu'une impression quantifié en termes de statistiques collectées par Mixxx.
sl: To je uporabno za hitro vključevanje ali izključevanje sprememb v kodi, brez potrebe po ponovnem prevajanju ali zagonu in daje anekdotičen občutek "občutenja" in kvantificiran občutek razlik v obliki statistik, ki jih Mixxx zbira.

source: All stats collected via the usual Counter/Timer/ScopedTimer/etc. tools are segmented into a BASE STATS and EXPERIMENT STATS section printed to the log on exit.
fr: Toutes les statistiques collectées via les outils habituels compteurs/minuteries/ScopedTimer/etc sont segmentés dans une section BASE STATS et EXPERIMENT STATS imprimée dans le journal à l'arrêt.
sl: Vse statistike, ki so zbrane preko običajnih Coutner/Timer/ScopedTimer/itd. orodji so segmentirana v sekciji BASE STATS in EXPERIMENT STATS in zapisna v beležko ob izhodu.

source: Version History
fr: Historique de version
sl: Zgodovina različice

source: Graphical interface scales for high resolution screens
fr: Échelles d'interface graphique pour écrans haute résolution
sl: Grafični vmesnik sprilagodi velikost za visokoločljivostne zaslone

source: Overhauled Deere and LateNight skins
fr: Thèmes Deere et LateNight révisées
sl: Prenovljene Deere in LateNight preobleke

source: New Tango skin
fr: Nouveau thème Tango
sl: Nova Tanko preobleka

source: Resizable waveforms
fr: Formes d'onde redimensionnables
sl: Valovne oblike s spremenljivo velikostjo

source: Effects are synchronized to the tempo
fr: Les effets sont synchronisés sur le tempo
sl: Učinki so sinhronizirani s tempom

source: Effects are processed post-fader and post-crossfader and can be previewed in headphones
fr: Les effets sont traités post-curseur et post-curseur de mixage et peuvent être prévisualisés dans un casque
sl: Učinki do procesirani po drsniku in po navzkrižnem drsniku in jih je mogoče predposlušati v slušalkah

source: One metaknob per effect with customizable parameter control for intuitive use of effect chains
fr: Un super potentiomètre par effet avec contrôle des paramètres personnalisable pour une utilisation intuitive des chaînes d'effets
sl: En meta-regulator po učinku s prilagodljivim nadzorom parametra za intuitivno rabo verig učinkov

source: Nine new effects: Autopan, Biquad Equalizer, Biquad Full Kill Equalizer, Loudness Contour, Metronome, Parametric Equalizer, Phaser, Stereo Balance, Tremolo
fr: Neuf nouveaux effets: Autopan, Biquad Equalizer, Biquad Full Kill Equalizer, Loudness Contour, Metronome, Parametric Equalizer, Phaser, Stereo Balance, Tremolo
sl: Devet novih učinkov: Samodejna panorama, Biquad izravnalnik, Biquad Full Kill izravnalnik, Oblikovalec glasnosti, metronom, parametrični izravnalnik, fazer, stereo ravnovesje, tremolo

source: Loaded effects and their parameters are saved and restored when Mixxx restarts
fr: Les effets chargés et leurs paramètres sont enregistrés et restaurés au redémarrage de Mixxx
sl: Naloženi učinki in njihovi parametri so shranjeni in ponovno naloženi ob zagonu Mixxxa

source: More transparent sounding equalizers (Biquad Equalizer and Biquad Full Kill Equalizer)
fr: Égaliseurs à sonorité plus transparente (égaliseur Biquad et égaliseur Biquad Full Kill)
sl: Bolj jasno zveneči izravnalniki (Biquad in Biquad Full Kill)

source: Improved scratching sounds with jog wheels, vinyl control, and dragging waveforms with the mouse
fr: Amélioration des sons de scratch avec les roues codeuses, le contrôle vinyle et le déplacement des formes d'onde avec la souris
sl: Izboljšano drgnjenje zvoka z jog vrtiljaki, gramofonskim upravljanjem in vlecenjem valovne oblike z miško

source: Simplified looping and beatjump controls
fr: Contrôles simplifiés de boucle et de saut de battement
sl: Poenostavljen nadzor nad zankami in ritmičnimi skoki

source: Configurable rows of 8 samplers with up to 8 rows available for a total of 64 samplers
fr: Rangées configurables de 8 échantillonneurs avec jusqu'à 8 rangées disponibles pour un total de 64 échantillonneurs
sl: Nastavljive vrste 8 vzorčevalnikov z do 8 vrst za do največ 64 vzorčevalnikov

source: Files loaded to samplers are reloaded when Mixxx restarts
fr: Les fichiers chargés dans les échantillonneurs sont rechargés au redémarrage de Mixxx
sl: Datoteke, ki so bile naložene v vzorčevalnikih, se ponovno naložijo ob zagonu Mixxxa

source: Improved volume normalization algorithm (EBU-R 128)
fr: Amélioration de l'algorithme de normalisation du volume (EBU-R 128)
sl: Izboljšan algoritem za normalizacijo glasnosti (EBU-R 128)

source: Filter library table by crates
fr: Table de bibliothèque de filtres par bacs
sl: Filtriranje tabel knjižnic po zabojih

source: Sort musical keys in library table by circle of fifths
fr: Trie les clés musicales dans la table de la bibliothèque par cercle de quintes
sl: Sortiranje glasbene tonalitete v tabeli knjižnice po kvintnem krogu

source: Write metadata tags back to audio files
fr: Réécrire les balises de métadonnées dans les fichiers audio
sl: Zapiši mataoznake nazaj v zvočno datoteko

source: New JavaScript library for controller mapping
fr: Nouvelle bibliothèque JavaScript pour le mappage des contrôleurs
sl: Nova JavaScript knjižnica za mapiranje kontrolerjev

source: Configure multiple Internet broadcasting stations and use multiple stations at the same time
fr: Configurer plusieurs stations de diffusion Internet et utiliser plusieurs stations en même temps
sl: Nastavite več spletnih radijskih postaj in uporabite več postaj naenkrat

source: Broadcast and record microphones with direct monitoring and latency compensation
fr: Microphones de diffusion et d'enregistrement avec surveillance directe et compensation de latence
sl: Spletno oddajanje in snemanje mikrofonov z neposrednim monitoringom in kompenzacijo latence

source: Broadcast and record from an external mixer
fr: Diffuser et enregistrer à partir d'une table de mixage externe
sl: Spletno oddjanje in snemanje iz zunanje mešalke

source: Booth output with independent gain knob for using sound cards with 6 output channels without an external mixer
fr: Sortie cabine avec potentiomètre de gain indépendant pour utiliser des cartes son avec 6 canaux de sortie sans table de mixage externe
sl: Ojačajte izhod s samostojnimi regulatorji za rabo z zvočnimi karticami s šestimi izhodnimi kanali brez zunanje mešalke

source: Prevent screensaver from starting while Mixxx is running
fr: Empêcher l'économiseur d'écran de démarrer pendant l'exécution de Mixxx
sl: Preprečite ohranjevalniku zaslona, da bi se zagnal, medtem ko je Mixxx aktiven

source: CUP (Cue And Play) cue button mode
fr: CUP (Cue And Play) mode bouton de repère
sl: CUP (Cue And Play) način delovanja gumba

source: Time remaining and time elapsed now take into account the tempo fader
fr: Le temps restant et le temps écoulé prennent désormais en compte le curseur de tempo
sl: Preostali čas in izmerjeni čas sedaj upoštevata preliv tempa

source: Clicking cover art now shows it full size in a separate window
fr: En cliquant sur la pochette d'album, vous l'affichez en taille réelle dans une fenêtre séparée
sl: S klikom na naslovnico se ta v polni velikosti prikaže v ločenem oknu

source: For a full list of new features and bugfixes, go to: `https://launchpad.net/mixxx/2.1 <https://launchpad.net/mixxx/+milestone/2.1.0>`_.
fr: Pour une liste complète des nouvelles fonctionnalités et corrections de bogues, accédez à: `https://launchpad.net/mixxx/2.1 <https://launchpad.net/mixxx/+milestone/2.1.0>`_.
sl: Ves seznam novosti in popravkov je na voljo na: `https://launchpad.net/mixxx/2.1 <https://launchpad.net/mixxx/+milestone/2.1.0>`_.

source: 4 Decks with Master Sync
fr: 4 platines avec synchronisation principale
sl: 4 predvajalniki z master sinhronizacijo

source: New Effects Framework with 4 Effect Units and 5 Built-in Effects: * Flanger, Bit Crusher, Reverb, Echo, Filter * More to come!
fr: Nouveau framework d'effets avec 4 effets de modules et 5 effets natifs: * Flanger, Bit Crusher, Reverbération, Echo, Filtrage * Et d'autres à venir !
sl: Novo ogrodje za delo z efekti s 4 efekt-enotami in 5 vgrajenimi efekti: * flanger, lomilec bitov, odjek, odmev, filter * Prihaja jih še več!

source: Configurable, Resizeable User Interface with 3 Brand New Skins
fr: Interface utilisateur configurable et redimensionnable avec 3 nouveaux types de thèmes
sl: Prilagodljiv in nastavljiv uporabniški vmesnik s 3 povsem novimi preoblekami.

source: Cover Art Display
fr: Affichage de pochette d'album
sl: Prikaz naslovnic

source: Music Key Detection and Shifting
fr: Détection et changement de tonalité musicale
sl: Prepoznavanje tonalitete in transponiranje

source: Vinyl Audio Pass-Through
fr: contrôle intermédiaire de vinyle audio
sl: Prehod zvoka gramofona

source: 4 Microphone inputs and 4 Auxiliary inputs
fr: 4 entrées micro et 4 entrées auxiliaires
sl: 4 vhodi za mikrofon in 4 pomožni aux vhodi

source: MIDI Mapping GUI and Improved Learning Wizard
fr: Interface graphique de mappage MIDI et assistant d'apprentissage amélioré
sl: GUI za MIDI mapiranje in izboljšani čarovnik za učenje

source: MusicBrainz metadata fetching
fr: Récupération des métadonnées MusicBrainz
sl: Raba MusicBrainz metapodatkov

source: RGB Musical Waveforms
fr: Formes d'onde musicales RVB
sl: RGB glasbene valovne oblike

source: Hundreds of Bug Fixes and Improvements
fr: Des centaines de corrections de bugs et améliorations
sl: Na stotine popravkov in izboljšav

source: New Pitch-Independent Algorithm for Better-Sounding Key-lock
fr: Nouvel algorithme indépendant de la hauteur tonnale pour un meilleur verrouillage du clavier
sl: Boljši algoritem, neodvisen od višine, za bolje zveneče zaklepanje tonalitete

source: For a full list of new features and bugfixes, go to: `https://launchpad.net/mixxx/2.0 <https://launchpad.net/mixxx/+milestone/2.0.0>`_.
fr: Pour une liste complète des nouvelles fonctionnalités et corrections de bogues, accédez à: `https://launchpad.net/mixxx/2.0 <https://launchpad.net/mixxx/+milestone/2.0.0>`_.
sl: Ves seznam novosti in popravkov je na voljo na: `https://launchpad.net/mixxx/2.0 <https://launchpad.net/mixxx/+milestone/2.0.0>`_.

source: For an overview of previous versions, `take a look <https://launchpad.net/mixxx/+series>`_ at the timeline.
fr: Pour un aperçu des versions précédentes, `jeter un coups d’œil <https://launchpad.net/mixxx/+series>`_ à la chronologie.
sl: Za ogled prejšnjih različic, poglejte na časovnico: <https://launchpad.net/mixxx/+series>`

source: **Microphone**
sl: **Mikrofon**

source: Focus
sl: Fokus

source: Option
sl: Opcija

source: Description
sl: Opis

source: --logLevel LEVEL
sl: --logLevel NIVO

source: --logFlushLevel LEVEL
sl: --logFlushLevel NIVO
