Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/controlling_mixxx.po
Languages: fr, it, sl

source: Controlling Mixxx
fr: Contrôler Mixxx
it: Controllare Mixxx
sl: Upravljanje programa Mixxx

source: Mixxx can be controlled with a keyboard, a mouse, :term:`MIDI`/:term:`HID` controllers, time-code records/CDs, or a combination of these. The choice usually depends on your budget or style of DJing.
fr: Mixxx peut être contrôlé au clavier, à la souris, avec un contrôleur :term:`MIDI`/:term:`HID`, des disques/CD timecodés, ou une combinaison de ces méthodes. Le choix dépend souvent de votre budget et du style de mixage.
it: Mixxx può essere controllato con una tastiera, un mouse, controller :term:`MIDI`/:term:`HID`, dischi/CD time-code o una combinazione di questi. La scelta dipende in genere dal tuo budget o dallo stile di DJing.
sl: Z Mixxx-om lahko upravljate s tipkovnico, miško, :term:`MIDI`/:term:`HID` krmilniki, zapise CD/-jev, časovne kode, ali kombinacijo teh. Izbira je ponavadi odvisna od vašega dohodka in tipa DJ-janja.

source: Using a Mouse and Touchpad
fr: Utiliser une souris ou un pavé tactile
it: Usare Mouse e Touchpad
sl: Uporaba miške in tipkovnice

source: Use your mouse to interact with the controls in the :ref:`Mixxx User Interface <interface-overview>` on your computer screen. You can perform actions by pointing and clicking with your mouse.
fr: Utiliser votre souris pour interagir avec les contrôles de :ref:`Interface Utilisateur de Mixxx <interface-overview>` sur l'écran de votre ordinateur. Vous pouvez réaliser des actions en pointant et cliquant avec votre souris.
it: Usa il tuo mouse per interagire con i controlli dell'interfaccia :ref:`Mixxx User Interface <interface-overview>` sullo schermo del computer. È possibile eseguire azioni puntando e facendo clic con il mouse.
sl: Uporabite miško za interakcijo s kontrolami v :ref:`Mixxx uporabniški vmesnik <interface-overview>` na vašem zaslonu. Akcije lahko izvajate s pomočjo kazalca in klikov.

source: **Single Left Click**: Performing a left mouse click on buttons triggers the default action for that control. Moreover if you click on a value in the track list of the Mixxx :ref:`library <library-interface>`, you can change the value. For example the year of a track.
fr: **Clic-gauche simple**: Réaliser un clic-gauche sur des boutons active l'action par défaut de ce contrôle. Si vous cliquez sur une valeur dans la :ref:`bibliothèque <library-interface>` de Mixxx, vous pouvez changer cette valeur. Par exemple, l'année d'une piste.
it: **Click singolo sinistro**: Facendo clic con il tasto sinistro del mouse sui pulsanti si attiva l'azione predefinita per quel controllo. Inoltre, se si fa clic su un valore nell'elenco dei brani del Mixxx :ref:`library <library-interface>`, è possibile modificare il valore. Ad esempio, l'anno di una traccia.
sl: **Single Left Click**: Z levim klikom miške na gumbe sprožite privzeto dejanje za ta nadzor. Če kliknete vrednost na seznamu skladb Mixxx: :ref:`library <library-interface>` , jo lahko spremenite. Na primer leto skladbe.

source: **Single Right Click**: On most buttons, performing a right click triggers a different action than a left click. You can return any knob or fader to its default value by right-clicking that control.
fr: **Clic-droit simple**: Sur la plupart des boutons, réaliser un clic-droit déclenche une action différente d'un clic-gauche. Vous pouvez ainsi réinitialiser n'importe quel bouton ou potentiomètre à sa valeur par défaut en effectuant un clic-droit.
it: **Un singolo clic con il tasto destro**: Sulla maggior parte dei pulsanti, l'esecuzione di un clic con il tasto destro attiva un'azione diversa da quella del clic con il tasto sinistro. È possibile riportare qualsiasi manopola o fader al suo valore predefinito facendo clic con il tasto destro del mouse su quel controllo.
sl: **En desni klik**: Na večini kontrol desni klik sproži drugačno akcijo, kot levi klik. Katerikoli regulator ali drsnik lahko z denism klikom povrnete na izhodiščno vrednost.

source: **Mouse Drag**: Click on a knob or fader, hold the left mouse button and move your cursor to change the value of the control. Use mouse drag to drop tracks from the file list to the decks, crates, playlists, etc.
fr: **Clic-déplacement de souris** Cliquer sur un bouton ou curseur, maintenir le bouton gauche de la souris enfoncé et déplacer le curseur pour changer la valeur du contrôle. Vous pouvez aussi glisser-déposer des pistes de l'explorateur vers les platines, bacs, listes de lectures, etc...
it: **Trascinamento del mouse**: Fare clic su una manopola o un fader, tenere premuto il pulsante sinistro del mouse e spostare il cursore per modificare il valore del controllo. Utilizzare il trascinamento del mouse per rilasciare le tracce dall'elenco dei file ai deck, alle casse, alle playlist, ecc.
sl: **Vlecenje z miško**: Kliknite na regulator ali drsnik, držite levo tipko miške in premaknite kazalec,d a bi spremenili vrednost kontrole. Vlecite z miško, da spustite skladbe iz seznama datotek v predvajalnike, zaboje, sezname predvajanje, itd.

source: **Mouse Wheel**: Just like Mouse Drag, you can change knob and fader values by placing the cursor over the control and moving the mouse wheel.
fr: **Molette de la souris** : comme le clic-déplacement, vous pouvez changer les valeurs des boutons et curseurs en plaçant le curseur de la souris au dessus du contrôle et en actionnant la molette.
it: **Rotella del mouse**: Come per il trascinamento del mouse, è possibile modificare i valori delle manopole e dei fader posizionando il cursore sul controllo e muovendo la rotella del mouse.
sl: **Miškino Kolesce**: Tako kot z vlecenjem, lahko vrednosti regulatorja ali drsnika spreminjate s pomočjo miškinega kolesca, kadar kurzor lebdi nad kontrolo.

source: If you hover with the mouse over a control (e.g. the crossfader) in the Mixxx user interface, the tooltip lists the left- and right-click action respectively.
fr: Si vous passez la souris sur un contrôle (par exemple le curseur de mixage) dans l'interface utilisateur de Mixxx, une info-bulle liste l'action respectivement du clic-gauche et du clic-droit.
it: Se si passa il mouse su un controllo (ad esempio il crossfader) nell'interfaccia utente di Mixxx, il suggerimento elenca l'azione da eseguire rispettivamente con il tasto sinistro e con il tasto destro del mouse.
sl: Če v uporabniškem vmesniku Mixxx miškin kazalec premaknete nad kontrolnik (npr. navzkrižno geslo), bo v opisu orodja navaden levi in desni klik.

source: On a Macbook or a computer with a touchpad that lacks mouse buttons, a two-finger click gesture is often treated as a right click.
fr: Sur un Macbook ou un ordinateur dont le pavé numérique ne possède pas de boutons, un clic-droit est souvent réalisé en tapant brièvement avec 2 doigts.
it: Su un Macbook o su un computer con touchpad privo di pulsanti del mouse, il gesto di fare clic con due dita viene spesso trattato come un clic destro.
sl: Na Macbooku ali računalniku s sledilno ploščico, ki nima tipk, se namesto desnega klika pogosto uporablja dvoprstna gestikulacija.

source: Using the Mouse drag/wheel on the waveforms you can adjust zoom and playback rate of the tracks. For more information, go to :ref:`interface-waveform`.
fr: Vous pouvez ajuster le zoom et la vitesse de lecture en utilisant le clic-déplacement ou la molette, sur les formes d'ondes. Plus d'informations sur :ref:`interface-waveform`.
it: Utilizzando il trascinamento/rotella del mouse sulle forme d'onda è possibile regolare lo zoom e la velocità di riproduzione delle tracce. Per ulteriori informazioni, consultare :ref:`interface-waveform`.
sl: Z velcenjem ali kolescem je mogoče spreminjati povečavo valovne oblike in hitrosti predvajanja skladb. Za več informaciji glej: :ref:`interface-waveform`.

source: Using a Keyboard
fr: Utiliser un clavier
it: Usare una Tastiera
sl: Uporaba tipkovnice

source: Mixxx Keyboard shortcuts (for en-us keyboard layout)
fr: Raccourcis claviers de Mixxx (pour des claviers QWERTY)
it: Scorciatoie da tastiera Mixxx (per il layout di tastiera en-us)
sl: Mixxx bližnjice na tipkovnici (za neangleške tipkovnice)

source: :download:`Download the image <../_static/Mixxx-220-Keyboard-Mapping.png>`
fr: :download:`Télécharger l'image <../_static/Mixxx-220-Keyboard-Mapping.png>`

source: Controlling Mixxx with a keyboard is handy. Unlike mouse control, the keyboard allows you to manage things simultaneously. For example, you can start playing a track on deck 1 whilst stopping deck 2 at the same time.
fr: Contrôler Mixxx au clavier est pratique. Contrairement à la souris, le clavier vous permet de gérer plusieurs choses simultanément. Par exemple, vous pouvez démarrer la lecture de la platine 1 en même temps que vous interrompez celle de la platine 2.
it: Controllare Mixxx con la tastiera è comodo. A differenza del controllo tramite mouse, la tastiera permette di gestire le cose contemporaneamente. Ad esempio, è possibile avviare la riproduzione di un brano sul deck 1 e contemporaneamente arrestare il deck 2.
sl: Upravljanje programa Mixxx s tipkovnico je priročno. Za razliko od miške, lahko preko tipkovnice nadzorujete zadeve vzporedno. Na primer: lahko zaženete predvajanje na predvajalniku 1 in hkrati zaustavite predvajalnik 2.

source: The default mapping for English keyboards is depicted in the figure above. It is divided into a left-hand side for deck 1 and right-hand side for deck 2. Please note that you can also access the functions through Mixxx's interface.
fr: Le mappage par défaut pour les claviers anglais est illustré dans la figure ci-dessus. Le clavier est scindé en 2, la partie gauche pour la platine 1 et la partie droite pour la platine 2. Notez que ces fonctions sont également accessibles via l'interface de Mixxx.
it: La mappatura predefinita per le tastiere inglesi è rappresentata nella figura precedente. È suddivisa in una parte sinistra per il deck 1 e una parte destra per il deck 2. Si noti che è possibile accedere alle funzioni anche attraverso l'interfaccia di Mixxx.
sl: Privzeti razpored za angleško tipkovnico je upodobljen na zgornji sliki. Razdeljen je v levi del za predvajalnik 1 in desni del za predvajalnik 2. Do vseh teh funkciji je mogoče dostopati tudi preko vmesnika Mixxx.

source: For some user groups, like those using :term:`controllers <controller>` or :term:`vinyl control`, it might be useful to enable/disable the keyboard mappings at runtime. You can do so by clicking :menuselection:`Options --> Enable Keyboard Shortcuts`.
fr: Pour certains groupes d'utilisateurs, comme ceux qui utilisent des :term:`controlleurs <controller>` ou :term:`contrôle vinyle`, il peut être utile d'activer/désactiver les mappages de clavier lors de l'exécution. Vous pouvez le faire en cliquant sur :menuselection:`Options -> Activer les Raccourcis Clavier`.
it: Per alcuni gruppi di utenti, come quelli che utilizzano :term:`controller <controller>` o :term:`vinyl control`, potrebbe essere utile abilitare/disabilitare le mappature da tastiera in fase di esecuzione. È possibile farlo facendo clic su :menuselection:`Options --> Enable Keyboard Shortcuts`.
sl: Za nekatere uporabniške skupine, na primer tiste, ki uporabljajo :term:`controllers <controller>` ali :term:`vinyl control`, bi bilo koristno omogočiti/onemogočiti preslikave tipkovnice med izvajanjem.

source: If you hover with the mouse over a control (e.g. the crossfader) in the Mixxx user interface, the tooltip lists the keyboard shortcuts of the control among a description of the control.
fr: Si vous déplacez la souris au dessus d'un contrôle (par exemple le curseur de mixage) dans l'interface de Mixxx, une info-bulle indique les raccourcis claviers en plus de la description du contrôle.
it: Se si passa il mouse su un controllo (es. il crossfader) nell'interfaccia utente di Mixxx, il suggerimento elenca le scorciatoie da tastiera del controllo e una descrizione del controllo stesso.
sl: Če s kazalcem miške lebdite nad kontrolo v uporabniškem vmesniku (npr. navzkrižnim drsnikom), se v namigu poleg opisa prikažejo tudi bližnjice za kontrolo.

source: For a list of default shortcuts, go to :ref:`appendix-keyboard`.
fr: Pour avoir la liste des raccourcis claviers par défaut, allez à :ref:`appendix-keyboard`.
it: Per un elenco di scorciatoie predefinite, consultare :ref:`appendix-keyboard`.
sl: Za seznam privzetih bližnjic glej :ref:`appendix-keyboard`.

source: Customizing the keyboard mapping
fr: Personnaliser le mappage du clavier
it: Personalizzare la mappatura della tastiera
sl: Prilagajanje razporeda tipk na tipkovnici

source: Mixxx allows you to customize the keyboard control. For more information, go to:
fr: Mixxx vous permet de personnaliser le contrôle au clavier. Pour plus d'informations, allez à :
it: Mixxx consente di personalizzare il controllo della tastiera. Per ulteriori informazioni, visitate il sito:
sl: Mixxx omogoča prilagajanje kontrole s tipkovnico. Za več informaciji glej:

source: Using MIDI/HID Controllers
fr: Utiliser des contrôleurs MIDI/HID
it: Usare Controller MIDI/HID
sl: Uporaba MIDI/HID kontrolerjev

source: Mixxx supports MIDI and HID :term:`controllers <controller>` which are external hardware devices used to control audio applications. Many DJs prefer the hands-on feel of a controller with Mixxx because it can feel similar to using a real mixer and turntables or :term:`CDJ`.
fr: Mixxx prend en charge les :term:`contrôleurs <controller>` MIDI et HID qui sont des dispositifs matériels externes utilisés pour contrôler les applications audio. De nombreux DJ préfèrent la sensation tactile d'un contrôleur avec Mixxx, car cela peut ressembler à l'utilisation d'une vraie table de mixage et de tourne-disque ou :term:`CDJ`.
it: Mixxx supporta i :term:`controller MIDI e HID <controller>`, dispositivi hardware esterni utilizzati per controllare le applicazioni audio. Molti DJ preferiscono l'esperienza diretta di un controller con Mixxx, perché può sembrare simile all'uso di un vero mixer e di giradischi o di un :term:`CDJ`.
sl: Mixxx podpira MIDI in HID :term:`controllers <controller>` ,ki sta zunanji strojni napravi, ki se uporabljata za nadzor zvočnih aplikacij.

source: Loading a controller preset
fr: Charger un préréglage de contrôleur
it: Caricare una preimpostazione controller
sl: Nalaganje predloge za kontroler

source: Mixxx Preferences - Loading a controller preset
fr: Préférences de Mixxx - Charger un préreglage de contrôleur
it: Preferenze Mixxx - Caricamento di un controller preset
sl: Mixxx nastavitve - nalaganje predloge za kontroler

source: Without loading the correct preset, your controller does not work with Mixxx.
fr: Si vous ne chargez pas le préréglage adéquat, votre contrôleur ne fonctionnera pas dans Mixxx.
it: Se non si carica il preset corretto, il vostro controller non funzionerà con Mixxx.
sl: Brez ustrezne in naložene predloge vaš kontroler ne bo pravilno deloval v programu Mixxx.

source: Connect your controller(s) to your computer
fr: Brancher votre (vos) contrôleur(s) à votre ordinateur
it: Collegate il vostro controller al vostro computer
sl: Povežite kontroler(je) z računalnikom

source: Start Mixxx
fr: Lancer Mixxx
it: Avviare Mixxx
sl: Zaženite Mixxx

source: Go to :menuselection:`Preferences --> Controllers`
fr: Allez à :menuselection:`Préférences --> Contrôleurs`
it: Andate in :menuselection:`Preferences --> Controllers`
sl: Pojdite na :menuselection:`Nastavitve --> Kontrolerji`

source: Select your device from the list of available devices on the left, and the right pane will change
fr: Choisir votre appareil dans la liste des appareils disponibles sur la gauche, et le panneau de droite se met à jour
it: Selezionate il vostro dispositivo dall'elenco dei dispositivi disponibili sulla sinistra ed il pannello di destra cambierà
sl: Izberite napravo iz seznama vseh naprav na levi strani in desni pano se bo spremenil.

source: Activate the :guilabel:`Enabled` checkbox
fr: Cocher la case :guilabel:`Activé`
it: Attivate il :guilabel:`Enabled` checkbox
sl: Potrdi polje :guilabel:`Omogočeno`

source: Select the mapping for your controller from the :guilabel:`Load Preset` drop-down menu
fr: Sélectionner la disposition de votre contrôleur dans le menu déroulant :guilabel:`Charger Préréglage`
it: Selezionate la mappatura per il vostro controller dal menu a tendina :guilabel:`Carica preset`.
sl: V spustnem meniju :guilabel:`Load Preset` izberite preslikavo za krmilnik.

source: Click :guilabel:`Apply` and Mixxx can now be controlled by your controller(s).
fr: Cliquer sur :guilabel:`Appliquer` et Mixxx peut désormais être contrôlé par votre (vos) contrôleur(s).
it: Fare clic su :guilabel: `Applica` e Mixxx può essere ora controllato dal/i controllore/i.
sl: Kliknite :guilabel:`Apply` in Mixxx lahko sedaj nadzirate preko vašega krmilnika(ov).

source: Repeat step 4-7 for any of the controllers you want to use
fr: Répéter les étapes 4 à 7 pour chaque contrôleur que vous voulez utiliser
it: Ripetere i punti 4-7 per tutti i controller che si desidera utilizzare.
sl: Ponovite korake od 4-7 za poljuben kontroler, ki ga želite uporabiti.

source: If you do not find a connected device in the list, make sure to install any necessary drivers for that device.
fr: Si vous ne trouvez pas un périphérique connecté dans la liste, assurez vous d'avoir installé tous les pilotes nécessaires pour ce périphérique.
it: Se nell'elenco non è presente un dispositivo collegato, assicurarsi di installare i driver necessari per tale dispositivo..
sl: Če ne najdete povezane naprave v seznamu, preverite da so nameščeni vsi potrebni gonilniki.

source: Supported controllers
fr: Contrôleurs pris en charge
it: Controller supportati
sl: Podprti kontrolerji

source: Mixxx can use any :term:`MIDI`/:term:`HID` controller that is recognized by your :term:`OS <operating system>` (some may require drivers), as long as there is a MIDI/HID mapping file to tell Mixxx how to understand it. Mixxx comes bundled with a number of mappings for various devices. There are two levels of controller mappings:
fr: Mixxx peut utiliser n'importe quel contrôleur :term:`MIDI`/:term:`HID` reconnu par votre :term:`système d’exploitation <operating system>` (certains pouvant nécessiter l'installation de pilotes), à condition qu'il existe un fichier de préréglage MIDI/HID permettant à Mixxx le reconnaître. Des fichiers de préréglages variés sont fournis avec Mixxx. Il existe 2 niveaux de préréglages de contrôleurs:
it: Mixxx può utilizzare qualsiasi controller :term:`MIDI`/:term:`HID` riconosciuto dal vostro :term:`OS <operating system>` (alcuni possono richiedere dei driver), a condizione che esista un file di mappatura MIDI/HID che indichi a Mixxx come gestirlo. Mixxx viene fornito con una serie di mappature per vari dispositivi. Esistono due livelli di mappatura dei controller:
sl: Mixxx lahko uporablja poljuben :term:`MIDI`/:term:`HID` kontroler , ki ga prepozna vaš :term:`OS <operating system>` (nekateri potrebujejo gonilnike), dokler zanj obstaja MIDI/HID mapirna datoteka, ki pove programu Mixxx, kako naj ga razume. Mixxx ima že v osnovi na voljo številna mapiranja za različne naprave. Obstajata dva nivoja mapiranj kontrolerjev:

source: **Mixxx Certified Mappings**: These mappings are verified by the Mixxx Development Team.
fr: **Mappages certifiés par Mixxx**: Ces préréglages sont vérifiés par l'équipe de développement de Mixxx.
it: **Mixxx Certified Mappings**: Queste mappature sono verificate dal team di sviluppo Mixxx.
sl: **Mixxx certificirano mapiranje**: Ta mapiranja so preverjena s strani Mixxx razvojne skupine.

source: **Community Supported Mappings**: These mappings are provided and have been verified as working by the Mixxx community, but the Mixxx Development Team is unable to verify their quality because we don't have the devices ourselves. They might have bugs or rough edges.
fr: **Mappages supportés par la communauté**: Ces préréglages sont fournis et ont été validés comme fonctionnels par la communauté Mixxx, mais l'équipe de développement de Mixxx ne peut pas vérifier leur qualité, car nous ne possédons pas ces périphériques. Ils peuvent donc avoir des bugs ou des petits problèmes.
it: **Mappature supportate dalla comunità**: Queste mappature sono state fornite e verificate come funzionanti dalla comunità Mixxx, ma il team di sviluppo Mixxx non è in grado di verificarne la qualità perché non possiede i dispositivi. Potrebbero presentare bug o parti grezze.
sl: **Mapiranja podprta s strani uporabnikov**: Ta mapiranja so bila narejena in preverjena s strani Mixxx skupnosti, vendar Mixxx razvojna skupina ne more preveriti kakovosti mapiranj, ker teh naprav ne premore. V njih se lahko pojavijo hrošči ali kakšna funkcija ne deluje optimalno.

source: If you run into issues with any of these mappings, please file a :term:`bug report` on our `Bug Tracker`_ or tell us about it on our mailing list, forums, or :term:`IRC` channel. Device support varies for each supported :term:`OS <operating system>`, so make sure to consult the documentation of the device.
fr: Si vous rencontrez un problème lors de l'utilisation de ces préréglages, nous vous remercions de remplir un :term:`rapport de bug` dans notre `Bug Tracker`_ ou de nous le signaler via la mailing list, les forums ou le canal :term:`IRC`. La prise en charge des périphériques varie en fonction de votre :term:`système d’exploitation <operating system>`, donc consultez la documentation du périphérique.
it: Se si riscontrano problemi con una qualsiasi di queste mappature, si prega di inoltrare un :term:`bug report` sul nostro `Bug Tracker`_ o di segnalarcelo sulla nostra mailing list, sui forum o sul canale :term:`IRC`. Il supporto dei dispositivi varia per ogni :term:`OS <operating system>` supportato, quindi assicurarsi di consultare la documentazione del dispositivo.
sl: Če se pojavijo težave pri delu s temi mapiranji, prosimo posredujte :term:`poročilo o hrošču` na naš `Bug Tracker`_ ali nam to sporočite preko naših forumov ali :term:`IRC` kanala. Podpora napravam se razlikuje med posameznimi term:`OS<operating system> `, tako da preverite dokumentacijo naprave glede podpore.

source: Additional mappings are available in the `Controller presets forum`_.
fr: Des préréglages supplémentaires sont disponibles dans le forum: `Controller presets forum`_.
it: Mappature aggiuntive sono disponibili nel `Controller presets forum`_.
sl: Dodatna mapiranja so na voljo v `Controller presets forumu`_.

source: Before purchasing a controller to use with Mixxx, consult our `Hardware Compatibility wiki page`_. It contains the most up-to-date information about which controllers work with Mixxx and the details of each.
fr: Avant d'acquérir un contrôleur pour Mixxx, consultez notre page `Hardware Compatibility wiki page`_. Elle contient les informations détaillées et à jour au sujet des contrôleurs fonctionnant avec Mixxx.
it: Prima di acquistare un controller da utilizzare con Mixxx, consultare la nostra pagina wiki `Compatibilità hardware`_. Contiene le informazioni più aggiornate su quali controller funzionano con Mixxx e sui dettagli di ciascuno.
sl: Pred nakupom kontrolerja, ki ga želite uporabljati s programom Mixxx, preverite našo wiki stran `Hardware Compatibility wiki page`_. Tam se nahajajo najbolj ažurni podatki o kontrolerjih, ki delujejo z Mixxx in podrobnosti o teh.

source: Installing a preset from the forum
fr: Installer un préréglage depuis le forum
it: Installare un preset dal forum
sl: Namestitev prednastavitve s foruma
