Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/controlling_mixxx.po
Languages: fr, it, sl

source: To use a controller mapping that did not come bundled with Mixxx, place the controller mapping in your User Presets folder. This is the folder called "controllers" inside your User Preferences folder. To open your User Presets folder, go to :menuselection:`Preferences --> Controllers` and click the :guilabel:`Open User Preset Folder` button. Alternatively, navigate to the folder in your :term:`OS <operating system>` file browser:
fr: Pour utiliser un mappage de contrôleur non fourni avec Mixxx, placer le mappage de contrôleur dans votre répertoire des préréglages de l'utilisateur, dans le répertoire appelé "controllers". Pour ouvrir votre répertoire des préréglages de l'utilisateur, aller dans :menuselection:`Préférences -> Contrôleurs` et cliquez sur le bouton :guilabel:`Ouvrir le répertoire des préréglages de l'utilisateur`. Sinon, accéder au dossier dans votre navigateur de fichiers du :term:`système d’exploitation <operating system>`:
it: Per utilizzare una mappatura del controller non fornita in dotazione con Mixxx, collocarla nella cartella User Presets. Si tratta della cartella denominata "controllers" all'interno della cartella Preferenze Utente. Per aprire la cartella User Presets, andare su :menuselection: `Preferenze --> Controller` e fare clic sul pulsante :guilabel: `Apri cartella User Preset`. In alternativa, navigare nella cartella nel browser di file :term:`OS <operating system>`:
sl: Če želite uporabiti preslikavo krmilnika, ki ni bila priložena z Mixxx, postavite preslikavo krmilnika v mapo Uporabniške prednastavitve. To je mapa, imenovana "krmilniki" v mapi Uporabniške nastavitve. Č želite odpreti mapo Uporabniške prednastavitve, pojdite na :menuselection:`PreferencesControllers` in kliknite gumb :guilabel:`Open User Preset Folder`. Lahko pa se pomaknete do mape :term:`<operating system>` v vašem datotečnem brskalniku.

source: Windows Vista and newer: :file:`C:\\Users\\<username>\\AppData\\Mixxx\\controllers`
fr: Windows Vista et plus récent: :file:`C:\\Users\\<username>\\AppData\\Mixxx\\controllers`
it: Windows Vista e successivi: :file:`C:\\Users\\<username>\\AppData\\Mixxx\\controllers`
sl: Windows Vista in novejši: :file:`C:\\Users\\<username>\\AppData\\Mixxx\\controllers`

source: On Windows, the :file:`AppData` folder is hidden, so if you have not already, you will need to set Windows Explorer to show hidden files and folders (how to do this varies with each version of Windows).
fr: Sous Windows, le répertoire :file:`AppData` est caché, donc si vous ne l'avez pas déjà fait, vous devrez configurer l'Explorateur Windows pour qu'il affiche les fichiers et dossiers cachés (la façon de procéder varie selon chaque version de Windows).
it: In Windows, la cartella :file:`AppData` è nascosta, quindi, se non l'avete già fatto, dovrete impostare Esplora risorse in modo che mostri i file e le cartelle nascoste (la procedura varia a seconda della versione di Windows).
sl: Na Windows, je mapa :file:`AppData` skrita, zato morate, če tega še niste storili, nastaviti Windows Explorer, da prikažete skrite datoteke in mape (Kako to storiti, se razlikuje glede na različico sistema Windows).

source: If the mapping was posted as a :file:`.zip` file, first extract the :file:`.zip` file by right clicking on it in your file browser and selecting the option for extracting an archive or compressed folder. Copy the :file:`.xml` file into your User Preset folder. If there is a :file:`.js` file, also copy that to your User Preset folder. Restart Mixxx and :ref:`load the preset <control-load-preset>`.
fr: Si le mappage a été publié en tant que fichier :file:`.zip`, commencer par extraire le fichier :file:`.zip` en cliquant dessus avec le bouton droit de la souris dans votre navigateur de fichiers et en sélectionnant l'option d'extraction d'une archive ou d'un dossier compressé. Copier le fichier :file:`.xml` dans votre répertoire des préréglages de l'utilisateur. S'il existe un fichier :file:`.js`, copiez-le également dans votre répertoire des préréglages de l'utilisateur. Redémarrer Mixxx et :ref:`charger le préréglage <control-load-preset>`.
it: Se la mappatura è stata pubblicata come file :file:`.zip`, estrarre prima il file :file:`.zip` facendo clic con il tasto destro del mouse nel browser dei file e selezionando l'opzione per estrarre un archivio o una cartella compressa. Copiare il file :file:`.xml` nella cartella User Preset. Se è presente un file :file:`.js`, copiare anche quello nella cartella User Preset. Riavviare Mixxx e :ref:`caricare la preimpostazione <control-load-preset>`.
sl: Če je bilo preslikavanje objavljeno kot mapa :file:`.zip` , najprej ekstrahirajte mapo :file:`.zip` z desnim klikom nanjo v brskalniku datotek in izbiro možnosti za ekstrahiranje arhiva ali stisnjene mape. Kopirajte mapo :file:`.xml` v mapo Uporabniške prednastavitve. Če tam obstaja datoteka :file:`.js`, jo tudi kopirajte v mapo Uporabniške prednastavitve. Znova zaženite Mixxx in :ref:`:ref:` naložite prednastavitev <control-load-preset>`.

source: Map your own your controller
fr: Créer un préréglage pour votre contrôleur
it: Mappare il proprio controller
sl: Mapirajte svoj kontroler

source: There is no mapping available for your controller or you want to change an existing mapping? You can map your controller by using the Controller Wizard or take full control with the MIDI Scripting support in Mixxx.
fr: Il n'existe pas de préréglage pour votre contrôleur ou vous souhaitez modifier un préréglage existant ? Vous pouvez créer votre propre préréglage en utilisant l'Assistant Contrôleur ou utiliser le scriptage MIDI de Mixxx.
it: Non è disponibile una mappatura per il vostro controller o volete modificare una mappatura esistente? Potete mappare il vostro controller utilizzando il Controller Wizard o decidere di averne il pieno controllo grazie al supporto del MIDI Scripting di Mixxx.
sl: Za vaš kontroler ni ustreznega mapiranja ali pa želite spremeniti obstoječe mapiranje kontrolerja? Za to lahko uporabite Čarovnik za učenje kontrolerja ali prevzamete popolno kontrolo s pomočjo MIDI skript, ki jih Mixxx podpira.

source: Go to :ref:`advanced-controller` for detailed information.
fr: Rendez vous à :ref:`advanced-controller` pour des informations détaillées.
it: Per informazioni dettagliate, consultare :ref:`advanced-controller`.
sl: Za podrobnosti glej :ref:`advanced-controller`.

source: Using Timecode Vinyl Records and CDs
fr: Utiliser des vinyles ou CDs timecodés
it: Usare Timecode Vinyl Record e CD
sl: Uporaba gramofonskih ali CD plošč s časovno kodo

source: :term:`Vinyl control` allows a user to manipulate the playback of a track in Mixxx using a turntable or :term:`CDJ` as an interface. In effect, it simulates the sound and feel of having your digital music collection on vinyl. Many DJs prefer the tactile feel of vinyl, and vinyl control allows that feel to be preserved while retaining the benefits of using digital audio.
fr: Le :term:`contrôle vinyle` permet à l'utilisateur de manipuler la lecture d'une piste dans Mixxx à l'aide d'une platine vinyle classique ou :term:`CDJ`. Ceci permet de restituer le son et la sensation d'avoir votre collection musicale sur vinyle. De nombreux DJs préfèrent la sensation physique du vinyle, et le contrôle vinyle permet de simuler cette sensation tout en conservant les avantages de l'utilisation de musique sous forme numérique.
it: :term:`Controllo vinile` consente all'utente di manipolare la riproduzione di un brano in Mixxx utilizzando come interfaccia un giradischi o un :term:`CDJ`. In effetti, simula il suono e la sensazione di avere la propria collezione di musica digitale su un vinile. Molti DJ preferiscono la sensazione tattile del vinile e il controllo del vinile permette di conservare questa sensazione, pur mantenendo i vantaggi dell'audio digitale.
sl: :term:`Gramofonsko upravljanje` omogoča manipuliranje predvajanja skladbe z uporabo gramofona ali :term:`CDJ`, ki služi kot vmesnik. To učinkuje, kot da bi bila vaša digitalna zbirka na gramofonskih ploščah. Mnogo didžejev ima raje otipljivost vinilnih plošč in gramofonsko upravljanje ta občutek ohranja, ob čemer omogoča vse prednosti digitalnega zvoka.

source: Go to :ref:`vinyl-control` for detailed information.
fr: Rendez vous à :ref:`vinyl-control` pour plus d'informations.
it: Vai a :ref:`vinyl-control` per informazioni dettagliate.
sl: Za podrobne informacije glej :ref:`vinyl-control`.
