Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/djing_with_mixxx.po
Languages: sl

source: DJing With Mixxx
sl: Didžejanje s programom Mixxx

source: Mixxx was designed to be easy to learn for both novice and experienced DJs.
sl: Mixxx je bil ustvarjen za enostavno učenje tako za novince, kot tudi izkušene didžeje.

source: This part of the manual provides you with directions for using Mixxx's features to create your own mixes.
sl: Ta del priročnika podaja smernice za uporabo funkcionalnosti programa Mixxx pri ustvarjanju lastnih miksov.

source: Setting Your Levels Properly (Gain Staging)
sl: Pravilno nastavljanje nivojev (določitev ojačitev)

source: Setting your levels properly, also known as gain staging, is essential for getting the best sound quality out of the equipment you are using. At every link in your signal chain, from Mixxx's channel gains to the power amplifier, the level should be well above the noise floor, but lower than the maximum level before the signal clips. The :term:`level meters <level meter>` should mostly be around the top of their green region. The level meter pictured to the left shows where Mixxx's level meters should average at the loudest parts of tracks. The average level should not be in the yellow region. Use the yellow region to leave headroom, or available level above the average before the signal clips. The loudest parts of the music (the transients) should briefly go into the yellow region.
sl: Pravilna nastavitev nivojev, ki je poznana tudi kot Gain Staging, je bistvena za zagotavljanje najboljše kakovosti zvoka opreme, ki jo uporabljate. V vsaki povezavi v vaši verigi signala, od Mixxx ojačitev kanala pa do ojačevalca, morajo biti nivoji krepko preko praga šuma, a še vedno pod maksimalnim nivojem, preko katerega začne signal prebijati. :term:`Merilci nivojev<level meter>` bi morali iti večinoma do vrhnjega dela zelenega področja. Merilec nivoja prikazan na levi strani prikazuje, kje bi morali biti merilci v povprečju ob na najbolj glasnih delih skladb. Povprečni nivo naj ne bi bil v rumenem delu. Rumeni del uporabite, da dopustite prostor na vrhu, ki omogoča da bolj glasni deli ne prebijajo. Najbolj glasni deli (vrhovi) naj za kratek čas uidejo v rumen del.

source: A waveform at a good level. Note that the example waveforms in this section were made by adjusting the visual gain of the waveform display in Mixxx to illustrate the concepts. Adjusting the visual gain of the waveform display does not change the level of the audio.
sl: Valovna oblika z dobrimi nivoji. Bodite pozorni na to, da so primeri valovnih oblik v tem razdelku bili ustvarjeni s prilagajanjem prikaza ojačitve v prikazovalniku valovne oblike, da bi bolje prikazali koncept dela. Prilagajnje prikaza ojačitve sicer ne vpliva na nivo signala zvoka.

source: **If a level meter is in its red region, the signal is clipping and the gain should be turned down.** Some equipment doesn't have a level meter and only has an LED that turns on when the signal clips. Clipping means that the peaks of the waveform are flattened because the equipment has reached the maximum level that it can amplify the signal to. This distorts sound in an unpleasant way and can damage equipment by driving it with more power than it is designed to handle. Increasing the gain past the point where clipping begins (further into the red on a meter) will distort the signal more. If you want to make the sound louder when every part of the signal chain is at its maximum without clipping, use more speakers or use speakers that are more sensitive and convert electrical energy into acoustic energy more efficiently.
sl: **Če je merilec signala v rdečem področju, signal prebija in je potrebno znižati ojačitev.** Nekatere naprave nimajo merilca nivojev, temveč le LED lućko, ki zasveti, ko signal prebija. Prebijanje pomeni, da se vrhovi valovne oblike stisnejo ali porežejo, ker je naprava dosegla največjo stopnjo ojačitve signala, ki jo zmore. To popači zvok na neprijeten način in lahko opremo poškoduje, saj jo poganjamo z več moči, kot jo lahko prenese. Jačanje signala preko točke, kjer se začne prebijanje (še bolj v rdečo), bo še bolj opačilo zvok. Če želite narediti zvok bolj glasen po tem, ko so vsi členi v verigi signala na maksimumu, uporabite več zvočnikov ali bolj občutljive zvočnike, ki bolj učinkovito pretvarjajo elektirčno energijo v akustično.

source: A clipping waveform
sl: Prebijanje valovne oblike

source: On the other hand, the signal should not be too low. This is because every audio device generates a little noise at a level referred to as its noise floor. Additionally, analog signals pick up noise as they travel along wires. The signal measured by the meter on the left is relatively close to the noise floor. When a device is turned up, the noise floor does not go up; only the signal does. However, every time the signal is amplified by the gain of another piece of equipment, both the noise and the signal from previous devices in the signal chain are amplified. For example, if your sound card is turned down and you turn the gain up on your mixer to compensate, the signal-to-noise ratio (SNR) of the sound card output will be low and the mixer's gain will amplify the signal and the noise from the sound card, plus the noise picked up along the wire. The end result will have more noise than if the output of the sound card was turned up before the signal reached the mixer and the mixer's gain did not have to be turned up.
sl: Po drugi strani signal ne sme biti prenizek. Razlog temu je dejstvo, da vsaka zvočna naprava ustvarja tudi nekaj šuma, ki mu pravimo prag šuma. Poleg tega analogni signali pobirajo šum, ko potujejo po žicah. Signal, ki ga je izmeril merilnik na levi, je precej blizu pragu šuma. Vendar - vsakič ko ojačimo signal iz predhodne naprave v verigi signala, se ojačita tako signal, kot tudi šum. Na primer, če je vaša zvočna karta utišana in ojačite signal na mešalni mizi, da bi ga dvignili, je razmerje med signalom in šumom zvočne (SNR) kartice majhno in bo miksre ojačal tako signal, kot tudi šum, vključno s šumom, ki ga povzroči žica. Končni rezultat bo imel več šuma, kot bi ga imel, če bi dvignili izhod zvočne kartice in signala ne bi bilo potrebno ojačiti na mešalni mizi.

source: A waveform that is too close to the noise floor
sl: Valovna oblika, ki je preblizu pragu šuma

source: To adjust the output volume of a sound system while maintaining a high signal-to-noise ratio, the gain should be adjusted as close to the speakers as possible. Refer to the :ref:`Gain Knob <interface-gain-knob>` section for details.
sl: Da bi ohranili veliko razmerje med signalom in šumom, hkrati pa dvignili glasnost, je potrebno prilagoditi glasnost kolikor je le mogoče blizu zvočnikom. Za podrobnosti glej razdelek <interface-gain-knob>:ref:`Gain Knob `.

source: Beatmatching and Mixing
sl: Izenačevanje ritma in miksanje

source: :term:`Beatmatching` is the process of adjusting the playback rate of a track so that it matches the tempo of another track. Beatmatching also involves adjusting the :term:`phase` of the beats in a track so that they are aligned with the beats in the other track. Matching the :term:`tempo` and aligning the beats are the two things a DJ must do to beatmatch.
sl: :term:`Izenačevanje ritma` je postopek prilagajanja hitrosti predvajanja skladbe, tako da ustreza tempu druge skladbe. Izenačevanje ritma vsebuje tudi prilagajanje :term:`faze` ritma v skladbi, tako da so te poravnane z dobami v drugi skladbi. Izenačevanje :term:`tempa` in poranava dob sta dve stvari, ki jih mora didžej opraviti, da bi izenačil ritem.

source: Mixxx can match the tempo and align the beats for you but this requires an accurately detected BPM value and a correct beat grid for both tracks. To enable this feature, tap the :guilabel:`SYNC` button. To beatmatch manually, the tempo of the two tracks must be synchronized by adjusting the playback rate sliders. You can adjust the phase of the beats by right-clicking and dragging on either waveform display to temporarily speed up or slow down one of the tracks until the beats are aligned. The temporary pitch bend buttons can also be used to momentarily adjust the playback rate, allowing you to “shuffle” the beats in a track forwards or backwards, so they can be aligned with another track. See the chapter :ref:`interface-rate`.
sl: Mixxx lahko izenači tempo in poravna ritem namesto vas, a za to potrebuje za obe skladbi natačno prepoznan BPM in pravilni ritmični mreži za. Ta funkcija se vključi z gumbom :guilabel:`SYNC`. Za ročno izenačevanje ritma je potrebno tempo obeh skladb sinhronizirati z uporabo drsnika hitrosti. Fazo ritma lahko prilaogdite tako da desno kliknete in vlečete po poljubnem prikazovalniku valovne oblike in tako začasno pospešite ali upočasnite eno od skladb, dokler obe nista poravnani. Za trenutno prilagajanje hitrosti so na voljo tudi gumbi za začasno pregibanje višine, ki omogočajo “prerazporejanje” dob naoprej ali nazaj, tako da jih izenačimo z drugo skladbo. Glej poglavje :ref:`interface-rate`.

source: Two tracks are beatmatched once their tempos are matched and their beats are aligned. A “perfect” beatmatch is nearly impossible - there will always be a tiny difference in the playback rates. A keen DJ will keep his or her ears open and listen for the beats drifting out of alignment. This has a distinct “double bass kick” sound which is often preceded by the kick weakening in intensity as the two kicks drift out of phase. When this happens, the beats can be realigned by simply tapping one of the temporary pitch bend buttons a few times in the appropriate direction.
sl: Dve skladbi sta ritmično izenačeni, kadar iamta enak tempo in so dobe poravnane. “Perfektno” izenačen ritem je skorajda nemogoče doseči, ker bodo vedno obstajale majhne razlike v hitrosti predvajanja. Vešč didžej bo imel našpičena ušesa in bo poslušal, kdaj se ritma začneta razhajati. V tem primeru se pojavi značilni zvok “dvojnega bas bobna”, pred katerim se pogosto pojavi manjašanje jakosti basa, ki je posledica faznega zamika. Ko se to zgodi, se lahko ritma poravnata z nekaj pritiski na gumb za pregibanje višine.

source: Master Sync
sl: Master sinhronizacije

source: :term:`Master Sync` is an intelligent assistant that allows you to leave the beatmatching to Mixxx so you can focus on track selection, effects manipulation, looping, 4 deck mixing, and other advanced DJing techniques.
sl: :term:`Master sinhronizacije` je inteligenten pomočnik, ki omogoča izenačevanje ritma, tako da se lahko fokusirate na izbor skladb, manipuliranje efektov, ustvarjanje zank, mikasnje s 4 predvajalniki in druge napredne Dj tehnike.

source: Master Sync will also notice if one of your tracks is double the BPM of another track and match them correctly. So if you want to mix a 140 BPM drum & bass track with a 70 bpm dubstep track, Master Sync will make sure they are lined up properly.
sl: Master sinhronizacije bo tudi opazil, če je BPM neke skladbe dvakratnik druge in jih pravilno izenačil. Če denimo miksaate 140 BPM drum&bass skladbo z 70 BPM dubstepom, bo Master sinhronizacije poskrbel, da bosta skladbi pravilno poravnani.

source: Usually, Master Sync will only make sure the rate sliders are set correctly. If you also want to make sure your beats are perfectly in sync, turn on the :guilabel:`QUANTIZE` button. When activated, Quantize will ensure that the beats are perfectly lined up as well.
sl: Ponavadi bo Master sinhronizacije poskrbel le za to, da bodo drsniki za hitrost pravilno nastavljeni. Če želite tudi, da sta ritma popolnoma sinhronizirana, vklopite gumb :guilabel:`KVANTIZACIJA` button.Ko je aktiviran, bo poskrbel, da so dobe tudi prefektno poravnani.

source: Harmonic Mixing
sl: Harmonično miksanje

source: Recording Your Mix
sl: Snemanje miksa

source: Mixxx library - Recordings view
sl: Mixxx zbirka - Ogled posnetkov

source: Mixxx can record your mix in various audio formats and quality settings. You can split your recordings, generate :term:`cue files <cue sheet>`, choose a custom recording directory and even set your own :term:`metadata`. By default, Mixxx saves your recordings as lossless :term:`wav` files to a :file:`Mixxx/Recordings` sub-folder in the Mixxx music directory. Before you start recording, we recommend that you adjust the settings in :menuselection:`Preferences --> Recording`.
sl: Mixxx lahko snema v različnih zvočnih formatih in z različno kakovostjo. Posnetke lahko razrežete, ustvarite :term:`cue datoteke<cue sheet>`, izberete poljuben direktorij za snemanje in celo določite svoje lastne :term:`metapodatke`. Mixxx privzeto snema brez izgube kakovosti v :term:`wav` datoteke v poddirektorij Mixxxovega glasbena direktorija na lokacijo :file:`Mixxx/Recordings` . Priporočamo, da pred snemanjem prilagodite nastavitve v :menuselection:`Nastavitve --> Snemanje`.

source: If you click on the *Recordings* icon in the sidebar of the Mixxx library, the track table to the right displays the content of your recordings directory. New recordings are automatically saved to this directory as well as CUE files if you choose to create them in the preferences.
sl: Če kliknete na ikono "Posnetki" na stranskem panoju v Mixxx zbirki, pano na desni prikaže vsebino našega direktorija s posnetki. Novi posnetki se bodo shranili v ta direktorij, kot tudi CUE datoteke, če jih potrdite v možnostih.

source: Recording your mixes and listening to them later to critique yourself is a great tool for improving your DJing skills. Sending your mixes to other DJs for feedback can also be helpful.
sl: Snemanje miksov za kasnejše kritično poslušanje je odlično orodje za izboljšanje lastnih didižejevskih tehnik. V pomoč je tudi, če svoje mikse pošljete drugim didžejem, da vam podajo mnenje.

source: Record your mix to disk
sl: Posnemite svoj miks na disk

source: Click on the *Recordings* icon in the sidebar to switch to the :guilabel:`Recordings` view
sl: Kliknite na ikono "Posnetki" v stranskem panoju, da bi preklopili v pogled :guilabel:`Posnetki`.

source: Click the :guilabel:`Start Recording` button or click :menuselection:`Options --> Record Mix` in the menu on top of the Mixxx application window.
sl: Kliknite na gumb :guilabel:`Začni snemati`ali kliknite na :menuselection:`Možnosti --> Snemaj miks` V meniju na vrhu okna programa Mixxx.

source: Perform your mix
sl: Izvedite svoj miks

source: Click the :guilabel:`Stop Recording` button to stop the recording when the mix has finished.
sl: Kliknite na gumb :guilabel:`Ustvai snemanje`, da zaustavite snemanje, ko je miksanje končano.

source: Using Auto DJ For Automatic Mixing
sl: Raba Auto Dj za samodejno miksanje

source: Mixxx library - Auto DJ view
sl: Mixxx zbirka - Samodejni DJ pogled

source: Auto DJ allows you to automatically load tracks from the Auto DJ playlist when the current track is nearly finished, and crossfade into it. See :ref:`library-auto-dj`.
sl: Samodejni DJ omogoča samodejno nalaganje skladb iz seznama predvajanja samodejnega didžeja, ko se trenutna skladba že skoraj konča in navzkrižni prehod na njo. Glej :ref:`library-auto-dj`.

source: Loading tracks into Auto DJ
sl: Nalaganje skladb v Auto DJ

source: To play tracks automatically, they must first be loaded into the Auto DJ playlist. The Auto DJ playlist is empty by default.
sl: Za samodejno predvajanje skladb, morajo biti te najprej naložene v Auto DH seznam predvajanja. Privzeto je ta seznam prazen.

source: Mixxx library - Adding a playlist to Auto DJ
sl: Mixxx zbirka - Dodajanje seznama predvajanja v Samodejni DJ

source: There are several ways to load tracks into the Auto DJ playlist:
sl: Obstaja več načinov za nalaganje skladb v Auto Dj seznam predvajanja.

source: Select single or multiple tracks from the library, a regular playlist or crate and drag them to the Auto DJ icon on the left.
sl: Izberite eno ali več skladb iz zbirke, seznama predvajanja ali zaboja in ga povlecite na ikono Samodejni DJ na levi strani.

source: Select a regular playlist or crate, right-click with the mouse and select :guilabel:`Add to Auto DJ` from the mouse menu. This adds all tracks to Auto DJ.
sl: Izberite običajen seznam predvajanja ali zaboj, desno kliknite nanji in iz miškinega menija izberite :guilabel:`Dodaj v Auto DJ`. To bo dodalo skladbo v Auto DJ zaporedje.

source: While in the Auto DJ view of the library, drag tracks from external file managers to the Auto DJ icon in the sidebar or to the Auto DJ track table on the right.
sl: Medtem, ko ste v Samodejni DJ prikazu zbirke, povlecite skladbe iz zunanjega upravljalnika datotek na ikono Samodejni DJ v stranskem panoju ali na Samodejni Dj seznam skladb na desni.

source: Playing tracks in Auto DJ
sl: Predvajanje skladb z Auto DJ

source: Now that you have loaded tracks into the Auto DJ playlist, you can activate Auto DJ as follows:
sl: Sedaj, ko ste naložili skladbe v Auto DJ seznam predvajanja, lahko aktivirate Auto DJ na tak način:

source: Click on the *Auto DJ* icon in the sidebar to switch to the :guilabel:`Auto DJ` view of the library.
sl: Kliknite na ikono 'Samodejni DJ ' v stranskem panoju, da preklopite na :guilabel:`Samodejni DJ` prikaz zbirke.

source: Click the :guilabel:`Enable Auto DJ` button.
sl: Kliknite na gumb :guilabel:`Vklopi Auto DJ`.

source: The first tracks from your list are loaded into the decks and the playback starts.
sl: Prva skladba iz vašega seznama se bo naložila v predvajalnik in predvajanje se bo začelo.

source: Mixxx will continue to automatically mix until the Auto DJ playlist is empty.
sl: Mixxx bo samodejno miksla skladbe, dokler AutoDJ seznam predvajanja ne bo prazen.

source: Click the :guilabel:`Disable Auto DJ` button to stop the automatic mixing
sl: Kliknite na gumb :guilabel:`Izklopi Auto DJ`, da zaustavite samodejno miksanje skladb
