Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/effects.po
Languages: fr, sl

source: Effects
fr: Effets
sl: Učinki

source: Mixxx has a powerful sound effects system. Understanding how it works can open you up to a wide variety of mixing techniques.
fr: Mixxx dispose d'un puissant système d'effets sonores. Comprendre comment il fonctionne peut vous ouvrir à une grande variété de techniques de mixage.
sl: Mixxx ima zmogljiv sistem zvočnih učinkov. Razumevanje, kako deluje, vam lahko odpre široko paleto tehnik mešanja.

source: Effect Units
fr: Unités d'effet
sl: Enote učinkov

source: Mixxx has 4 effect units. By default, only 2 of them are shown. The other 2 effect units can be shown by toggling the setting in the skin settings menu.
fr: Mixxx a 4 unités d'effet. Par défaut, seuls 2 d'entre elles sont affichées. Les 2 autres unités d'effets peuvent être affichées en basculant le paramètre dans le menu des paramètres du thème.
sl: Mixxx ima 4 enote učinka. Privzeto sta prikazani samo 2 od njih. Preostali dve enoti učinkov lahko prikažete tako da preklopite nastavitev v meniju nastavitev kože.

source: An effect unit
fr: Une unité d'effet
sl: Enota učinka

source: Each effect unit can load up to 3 effects in a chain. These effects are processed one after the other in series. You will hear different sounds depending on the order of effects within the chain. Each effect in the chain has its own button to toggle it on and off.
fr: Chaque unité d'effet peut charger jusqu'à 3 effets dans une chaîne. Ces effets sont traités les uns après les autres en série. Vous entendrez des sons différents selon l'ordre des effets dans la chaîne. Chaque effet de la chaîne possède son propre bouton pour l'activer et le désactiver.
sl: Vsaka enota učinkov lahko v verigo naloži do 3 učinke. Ti učinki se obdelujejo zaporedno. Slišali boste različne zvoke, odvisno od vrstnega reda učinkov v verigi. Vsak učinek v verigi ima svoj gumb za vklop in izklop.

source: Effect units can process sound from:
fr: Les unités d'effets peuvent traiter le son à partir de:
sl: Efektne enote lahko obdelujejo zvok iz:

source: decks
fr: platines
sl: predvajalnikov

source: microphones
sl: mikrofonov

source: auxiliary inputs
fr: entrées auxiliaires
sl: pomožnih vhodov

source: the master mix
fr: le mix principal
sl: glavnih mešanic

source: the :term:`PFL` (headphone) mix
fr: le mix :term:`PFL` (casque)
sl: :term:`PFL` (slušalke) mešanica

source: left/middle/right crossfader buses
fr: bus curseur de mixage gauche/milieu/droite
sl: levi/srednji/desni crossfader buses

source: The buttons to route effect units to decks, microphones, and auxiliary inputs are located in the deck, microphone, and auxiliary sections of the skin. The buttons for routing other inputs to effect units are in different locations depending on the skin.
fr: Les boutons permettant d'acheminer les unités d'effets vers les platines, les microphones et les entrées auxiliaires sont situés dans les sections platine, microphone et auxiliaires du thème. Les boutons de routage d'autres entrées vers les unités d'effet se trouvent à différents emplacements en fonction du thème.
sl: Gumbi za usmerjanje enote učinka v predvajalnike, mikrofone in pomožne vhode se nahajajo v predvajalniku, mikrofonu in pomožnih odsekih kože. Gumni za usmerjanje drugih vhodov v efektne enote so na različnih lokacijah, odvisno od kože.

source: If a channel is assigned to multiple effect units, those effect units are chained together. This allows you to chain more than 3 effects at a time.
fr: Si un canal est affecté à plusieurs unités d'effets, ces unités d'effets sont chaînées ensemble. Cela vous permet de chaîner plus de 3 effets à la fois.
sl: Če je kanal dodeljen več enotam učinkov, so te enote učinkov povezane v verigo. To vam omogoča, da naenkrat povežete več kot 3 učinke.

source: The mix knob adjusts the mix between the dry signal (input to the unit) and the wet signal (output of the last effect in the unit). It changes the level of all 3 effects in the unit together. Refer to the :ref:`effects-mix-mode` section below for details.
fr: Le potentiomètre de mixage ajuste le mixage entre le signal original (entrée de l'unité) et le signal traité (sortie du dernier effet de l'unité). Il change le niveau des 3 effets de l'unité ensemble. Reportez-vous à la section :ref:`effects-mix-mode` ci-dessous pour plus de détails.
sl: Mešalni gumb prilagodi mešanico med suhim signalom (vhod v enoto) in mokrim signalom (izhod zadnjega učinka v enoti). Skupaj spremeni raven vseh 3 učinkov v enoti. Za podrobnosti glejte :ref:`effects-mix-mode` v spodnjem razdelku.

source: Effects are processed after the deck faders and crossfader. This allows effects like Echo and Reverb to continue outputting sound after their input has been cut off by lowering the fader. Unlike other DJ software and hardware, effects can also be heard in headphones even though they are processed after the faders for the master output. Refer to the :ref:`effects-in-headphones` section below for details.
fr: Les effets sont traités après les curseurs de platine et le curseur de mixage. Cela permet à des effets comme Echo et Reverb de continuer à émettre du son après que leur entrée ait été coupée en baissant le curseur. Contrairement aux autres logiciels et matériels DJ, les effets peuvent également être entendus dans le casque même s'ils sont traités après les curseurs pour la sortie principale. Reportez-vous à la section :ref:`effects-in-headphones` ci-dessous pour plus de détails.
sl: Učinki se obdelajo po krovnih faderjih in crossfaderjih. To omogoča, da učinki, kot sta Echo im Reverb, še naprej oddajajo zvok, potem, ko je njihov vhod prekinjen s spuščanjem faderja. Za razliko od druge DJ-jeve programske in strojne opreme lahko učinke slišimo tudi v slušalkah, čeprav se obdelajo po faderjih za glavni izhod. Za podrobnosti glejte :ref:`effects-in-headphones` spodnji razdelek.

source: Note that equalizer and filter effects create a phase shift. If the mix knob is anywhere in the middle between dry and wet and any of these effects are enabled in the unit, there will be comb filtering which is probably not desired. For more background information, read `Equalizers and Phase Shift <http://ethanwiner.com/EQPhase.html>`_.
fr: Noter que les effets d'égaliseur et de filtre créent un décalage de phase. Si le potentiomètre de mixage est n'importe où au milieu entre original et traité et que l'un de ces effets est activé dans l'unité, il y aura un filtrage en peigne qui n'est probablement pas souhaité. Pour plus d'informations, liser `Equalizers and Phase Shift <http://ethanwiner.com/EQPhase.html>`_.
sl: Upoštevajte, da učinki izenačevalnika in filtra ustvarjajo fazni premik. Če je gumb za mešanje kjer koli na sredini med suhim in mokrim in je v noti omogočen kateri koli od teh učinkov, bo filtriranje glavnika verjetno zaželeno. Za več informacij v ozadju preberite `Equalizers and Phase Shift <http://ethanwiner.com/EQPhase.html>`_.

source: Effect Parameters & Metaknobs
fr: Paramètres d'effet et super potentiomètres
sl: Parametri učinka in metaknobi

source: Every effect within an :ref:`Effect Unit <effects-effect-unit>` has its own set of parameters. By default, these are hidden. Instead, there is a single knob called a "metaknob" for each effect which is linked to the different parameters. The metaknob allows you to easily control the effects in a unit without having to manipulate every parameter individually.
fr: Chaque effet dans une :ref:`unité d’effets <effects-effect-unit>` a son propre ensemble de paramètres. Par défaut, ceux-ci sont masqués. Au lieu de cela, il y a un seul bouton appelé "super potentiomètre" pour chaque effet qui est lié aux différents paramètres. Le super potentiomètres vous permet de contrôler facilement les effets dans une unité sans avoir à manipuler chaque paramètre individuellement.
sl: Vsak učinek znotraj an :ref:`Effect Unit <effects-effect-unit>` ima svoj nabor parametrov. Privzeto so te skrite. Namesto tega obstaja gumb, imenovan "metaknob" za učinek, ki je povezan z različnimi parametri. Metaknob vam omogoča enostavno upravljanje učinkov v enoti, ne da bi vam bilo treba posebej manipulirati z vsemi parametri.

source: If you want more detailed control of effects, press the expansion button on the effect unit to reveal the effect parameters:
fr: Si vous souhaitez un contrôle plus détaillé des effets, appuyer sur le bouton d'extension de l'unité d'effet pour afficher les paramètres d'effet:
sl: Če želite podrobnejši nadzor učinkov, pritisnite gumb za razširitev na enoti z učinki, da odkrijete parametre učinka:

source: An effect unit with parameters showing
fr: Une unité d'effet avec les paramètres affichés
sl: Enota učinka s prikazanimi parametri

source: You can customize how the metaknob is linked to the parameters by clicking the buttons below the parameter knobs. The button under the parameter name controls the metaknob link mode:
fr: Vous pouvez personnaliser la façon dont le super potentiomètre est lié aux paramètres en cliquant sur les boutons situés sous les boutons de paramètres. Le bouton sous le nom du paramètre contrôle le mode de liaison avec le super potentiomètre:
sl: Kako lahko gumb metaknob povežete s parametri, lahko prilagodite s klikom na gumbe pod gumbi parametrov. Gumb pod imenom parametra nadzoruje način povezave metaknob:

source: Inactive: parameter not linked
fr: Inactif: paramètre non lié
sl: Nekativno: parameter ni povezan

source: Active: parameter moves with metaknob
fr: Actif: le paramètre se déplace avec le super potentiomètre
sl: Aktivno: parameter se premika z metaknob

source: Left side active: parameter moves with left half of metaknob turn
fr: Côté gauche actif: le paramètre se déplace avec une moitié de rotation à gauche du super potentiomètre
sl: Leva stran aktivna: parameter se premakne z levo polovico do obrata metaknoba

source: Right side active: parameter moves with right half of metaknob turn
fr: Côté droit actif: le paramètre se déplace avec une moitié de rotation à droite du super potentiomètre
sl: Desna stran aktivna: parameter se premakne z desno polovico do obrata metaknoba

source: Left and right side active: parameter moves across range with half of metaknob turn and back with the other half
fr: Côté gauche et droit actif: le paramètre se déplace avec une moitié de rotation du super potentiomètre et reviens en arrière avec l'autre moitié de rotation
sl: Leva in desna stran aktivna: parameter se premika po dosegu s polovico obrata metaknoba in nazaj z drugo polovico

source: The button below the metaknob link button inverts the parameter's relationship to the metaknob.
fr: Le bouton sous le bouton de lien super potentiomètre inverse la relation du paramètre avec le super potentiomètre.
sl: Gumb pod gumbom za povezavo metaknoba spremeni razmerje parametra do metaknoba.

source: For information about specific effects and their parameters, hover your mouse over them to show the tooltip. If you do not see tooltips, check that you have them enabled for the skin in :menuselection:`Preferences --> Interface`.
fr: Pour plus d'informations sur des effets spécifiques et leurs paramètres, passer votre souris dessus pour afficher l'info-bulle. Si vous ne voyez pas d'infobulles, vérifiez que vous les avez activées pour le thème dans :menuselection:`Préférences --> Interface`.
sl: Če želite informacije o določenem učinku in njihovih parametrih, premaknite miškin kazalec nad njimi, da se prikaže namig. Če ne vidite nasvetov, preverite ali ste jih omogočili za kožo v :menuselection:`Preferences --> Interface`

source: Effects (except for Reverb) that have a length of time as a parameter are synchronized to the tempo of decks.
fr: Les effets (à l'exception de Reverb) dont la durée est paramétrée sont synchronisés avec le tempo des platines.
sl: Učinki (razen Reverb), ki imajo časovno obdobje, saj se parameter sinhronizira s tempom krovov.

source: Effect Unit Mix Modes
fr: Modes de mixage des unités d'effet
sl: Način mešanja efektne enote

source: The effect unit mix knob controls the level of all 3 effects in the unit together. It can be toggled between two different modes with the mix mode button adjacent to it.
fr: Le potentiomètre de mixage de l'unité d'effets contrôle ensemble le niveau des 3 effets de l'unité. Il peut être basculé entre deux modes différents avec le bouton de mode de mixage adjacent.
sl: Gumb za mešanje efektne enote skupaj nadzoruje raven vseh 3 učnikov v enoti. Preklapljate ga lahko med dvema različnima načinoma s tipko za način mešanja ob njem.

source: An effect unit in Dry/Wet mode
fr: Une unité d'effet en mode Original/Traité
sl: Efektna enota v načinu suho/mokro

source: In the default Dry/Wet mode, the mix knob crossfades between the dry signal (input to the first effect in the unit) and the wet signal (output of the last effect in the unit). When the knob is fully left, no sound will be heard from the effect unit. When the knob is fully right, only the output of the effect unit will be heard without any of the dry input signal.
fr: Dans le mode Original/Traité par défaut, le bouton de mixage effectue un fondu entre le signal original (entrée du premier effet de l'unité) et le signal traité (sortie du dernier effet de l'unité). Lorsque le bouton est complètement à gauche, aucun son n'est émis par l'unité d'effet. Lorsque le bouton est complètement à droite, seule la sortie de l'unité d'effet sera entendue sans aucun signal d'entrée original.
sl: V privzetem načinu Dry/Wet mešalni gumbi navzkrižno slabijo med suhimi signali (vhod v prvi učinek v enoti) in mokrim signalom (izhod zadnjega učinka v enoti). Ko je gumb popolnoma lev, iz enote za učinke ne bo slišati zvoka. Ko je gumb popolnoma desni, se sliši samo izhod iz enote z učinki, ne da bi prišlo do suhega vhodnega signala.

source: An effect unit in Dry+Wet mode
fr: Une unité d'effet en mode Original+Traité
sl: Enota za učinke v načinu Dry + Wet

source: In Dry+Wet mode, the dry signal is always at full volume. The mix knob controls how much of the wet signal is added to the dry signal. A useful example for Dry+Wet mode is loading a filter or equalizer effect before the Echo effect. With this setup, the filter or equalizer can remove bass frequencies from the echoed signal without removing them from the unechoed signal. If the effect unit is switched to Dry/Wet mode with the same effects in the same order, the bass frequencies will be taken out of the echoed signal, but they will also be removed from the unechoed signal.
fr: En mode Original+Traité, le signal original est toujours à plein volume. Le bouton de mixage contrôle la quantité de signal traité ajoutée au signal original. Un exemple utile pour le mode Original+Traité est le chargement d'un effet de filtre ou d'égalisation avant l'effet Echo. Avec cette configuration, le filtre ou l'égaliseur peut supprimer les basses fréquences du signal avec écho sans les supprimer du signal sans écho. Si l'unité d'effet est commutée en mode Original/Traité avec les mêmes effets dans le même ordre, les fréquences graves seront supprimées du signal avec écho, mais elles seront également supprimées du signal sans écho.
sl: V načinu Dry + Wet je suhi signal vedno poln. Mešalni gumb nadzoruje, koliko mokrega signala se doda suhemu signalu. Koristni primer za način suhega in mokrega signala je nalaganje učinka filtra ali izenačevalnika pred učinkom Echo. S to nastavitvijo lahko filter ali izenačevalnik odstrani nizke frekvence iz odmevnega signala, ne da bi jih odstranili iz neizzvočenega signala. Če enoto z učinki preklopite v način suhega / mokrega z enakimi učinki v istem vrstnem redu, bodo nizkofrekvenčne frekvence odstranjene iz odmevnega signala, vendar bodo odstranjene tudi iz neizbranega signala.

source: Effects In Headphones
fr: Effets dans le casque
sl: Učinki v slušalkah

source: To preview how a track will sound with effects before you mix in the track, simply assign the deck to an effect unit and enable the headphone button for the deck. Note that this will increase CPU compared to assigning an effect unit to a deck without the headphone button enabled. This is because effects are processed in parallel for the headphone output (prefader) and master output (postfader).
fr: Pour prévisualiser le rendu sonore d'une piste avec des effets avant de mixer dans la piste, affecter simplement la platine à une unité d'effets et activer le bouton casque de la platine. Noter que cela augmentera le CPU par rapport à l'affectation d'une unité d'effet à une platine sans que le bouton du casque soit activé. En effet, les effets sont traités en parallèle pour la sortie casque (prefader) et la sortie principale (postfader).
sl: Če si želite predogledati, kako se bo skladba slišala z učinki, preden mešate skladbo, preprosto dodelite ploščo enoti z učinki in omogočite gumb za slušalke na plošči. Upoštevajte, da bo to povečalo CPE v primerjavi z dodeljevanjem enote učinka v krov brez gumba za slušalke. To je zato, ker se učinki obdelujejo vzporedno za izhod za slušalke (prefader) in glavni izhod (postfader).

source: Effects can also be previewed in headphones on decks that are playing to the audience, but this requires a few more steps:
fr: Les effets peuvent également être prévisualisés dans le casque sur les platines qui sont en lecture pour le public, mais cela nécessite quelques étapes supplémentaires:
sl: Učinke si je mogoče predogledati tudi v slušalkah na ploščah, ki se predvajajo občinstvu, vendar je zato potrebno še nekaj korakov:

source: Disable the effect unit for the deck
fr: Désactiver l'unité d'effet de la platine
sl: Onemogočite enoto učinkov za krov

source: Enable the headphone button for the deck
fr: Activer le bouton casque de la platine
sl: Omogočite gumb za slušalke na krovu

source: Enable the headphone button for the effect unit
fr: Activer le bouton casque de l'unité d'effet
sl: Omogočite gumb za slušalke za enoto z učinki

source: Enable effects and adjust their metaknobs and parameters for how you want the effects to sound.
fr: Activer les effets et ajuster leurs super potentiomètre et paramètres selon la façon dont vous souhaitez que les effets sonnent.
sl: Omogočite učinke in prilagodite njihove gumbe in parametre glede na to, kako želite, da učinki zvenijo.

source: When you are ready to mix in the effect, turn the mix knob fully left (dry)
fr: Lorsque vous êtes prêt à mixer l'effet, tourner le potentiomètre de mixage complètement à gauche (original)
sl: Ko ste pripravljeni na mešanje učinka, vrtite gumb za mešanje do konca v levo (suho)

source: Enable the effect unit for the deck
fr: Activer l'unité d'effet de la platine
sl: Omogočite enoto efektov za krov

source: Turn the mix knob right so the effects are heard in the master output
fr: Tourner le potentiomètre de mixage vers la droite pour que les effets soient entendus sur la sortie principale
sl: Obrnite gumb za mešanje v desno, da se učinki slišijo v glavnem izhodu

source: Disable the headphone button for the effect unit so you do not forget to turn it off later
fr: Désactiver le bouton casque de l'unité d'effet pour ne pas oublier de l'éteindre plus tard
sl: Onemogočite gumb za slušalke za enoto z učinki, da ga pozneje ne pozabite izklopiti
