Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/getting_started.po
Languages: fr, sl

source: Getting Started
fr: Commencer
sl: Prvi koraki

source: Opening Mixxx
fr: Lancer Mixxx
sl: Zagon Mixxx

source: |logo| Once you've `installed Mixxx <https://mixxx.org/download/>`_, start by opening Mixxx and importing your music to the Mixxx library.
fr: |logo| Une fois que vous avez `installé Mixxx <https://mixxx.org/download/>`_, commencez par lancer Mixxx et importer votre musique dans la bibliothèque de Mixxx.
sl: |logo| Po `namestitvi programa Mixxx <https://mixxx.org/download/>`_, zaženite Mixxx in uvozite glasbo v Mixxx zbirko.

source: Double-click the Mixxx icon on the Desktop. Alternatively, browse your Windows start menu and click the Mixxx icon, or perform a search for :file:`Mixxx.exe`.
fr: Double-cliquer sur l'icône Mixxx sur votre bureau. Vous pouvez aussi naviguer dans le menu démarrer de Windows et cliquer sur l'icône Mixxx, ou faire une recherche du fichier :file:`Mixxx.exe`.
sl: Dvokliknite Mixxx ikono na namizju, poiščite Mixxx v Windows start menuju ali poiščite :file:`Mixxx.exe`.

source: Double-click the Mixxx icon in the :file:`Applications` folder. Alternatively, drag the Mixxx icon to the dock and double-click it there or search for :command:`mixxx` in Spotlight.
fr: Double-cliquer sur l'icône Mixxx dans le dossier :file:`Applications`. Sinon, faites glisser l'icône Mixxx dans le dock et double-cliquer dessus ou rechercher :command:`mixxx` dans Spotlight.
sl: Dvokliknite Mixxx ikono v imeniku :file:`Applications`. Drug način je, da potegnete Mixxx ikono v pristan oz. Dock in ga potem tam dvokliknete ali pa poiščete :command:`mixxx` v Spotlight.

source: Click the Mixxx icon in the applications menu or launcher of your desktop environment or perform a search for :file:`mixxx`. Alternatively type :command:`mixxx` into the terminal, then hit :kbd:`Return`. If your :term:`audio interface` is not accessible from Mixxx because it is used by other applications via PulseAudio, you may close and restart Mixxx using :command:`pasuspender mixxx`. See :ref:`appendix-command-line-options` for an overview of Mixxx's command line options.
fr: Cliquer sur l'icône Mixxx dans le menu des applications ou le lanceur de votre environnement de bureau ou effectuer une recherche sur :file:`mixxx`. Sinon, taper :command:`mixxx` dans le terminal, puis appuyer sur :kbd:`Entrée`. Si votre :term:`interface audio` n'est pas accessible depuis Mixxx car elle est utilisée par d'autres applications via PulseAudio, vous pouvez fermer et redémarrer Mixxx à l'aide de :command:`pasuspender mixxx`. Voir :ref:`appendix-command-line-options` pour un aperçu des options de ligne de commande de Mixxx.
sl: Kliknite ikono Mixxx na meniju s programi ali v zaganjalniku vašega namiznega okolja ali pa poiščite :file:`mixxx`. Lahko tudi v terminal vtipkate :command:`mixxx` in nato pritisnete tipko :kbd:`Return`. Če :term:`zvočni vmesnik` iz Mixxx ni dostopen, ker ga prek PulseAudio uporabljajo drugi programi, lahko Mixxx zaprete in znova zaženete z :command:`pasuspender mixxx`. Za pregled opcij ukazne vrstice za Mixxx glejte :ref:`appendix-command-line-options`.

source: Importing your audio files
fr: Importer vos fichiers audio
sl: Uvoz zvočnih datotek

source: Mixxx running on Windows 10 - Choose music library directory dialog
fr: Mixxx fonctionnant sous Windows 10 - Choix du répertoire de la bibliothèque
sl: Mixxx z Windows 10 – Pogovorno okno za izbor imenika glasbene zbirke

source: The first time you run Mixxx, you are asked to select a directory where your music is stored. By default, the dialog points to a location where music files are typically held, but you can select any location on your computer.
fr: La première fois que vous exécutez Mixxx, on vous demande de sélectionner un répertoire dans lequel votre musique est rangée. Par défaut, la boîte de dialogue pointe vers un emplacement dans lequel les fichiers musicaux sont typiquement rangés, mais vous pouvez choisir n'importe quel emplacement sur votre ordinateur.
sl: Ko je Mixxx prvič zagnan, vpraša za lokacijo direktorija, kjer je shranjena vaša glasba. V odnovi za dialog kaže na lokacijo, kjer so glasbene datoteke ponavadi shranjene, lahko pa izberete drugo lokacijo na vašem računalniku.

source: Click :guilabel:`Select Folder` and Mixxx will scan your music library. Depending on the size of your library this could take some time. All the supported music files Mixxx detects will be listed in the :ref:`library-tracks`.
fr: Cliquer sur :guilabel:`Sélectionner le dossier` et Mixxx va examiner votre bibliothèque musicale. Ceci peut prendre du temps en fonction de la taille de votre bibliothèque. Tous les fichiers musicaux pris en charge que Mixxx détecte seront listés dans :ref:`library-tracks`.
sl: Kliknite :guilabel:`Izberi mapo` in Mixxx bo preiskal vašo glasbeno zbirko. Glede na velikost vaše zbirke lahko to traja dlje časa. Vse podprte glasbene datoteke, ki jih Mixxx odkrije, bodo navedene v :ref:`library-tracks`.

source: If you want to refresh your library (for example because you added or moved files), you can do this with :menuselection:`Library --> Rescan Library` in the menu. If you want to rescan at every launch, select :menuselection:`Preferences --> Library --> Rescan on startup`.
fr: Si vous voulez rafraîchir votre bibliothèque (par exemple parce que vous avez ajouté ou déplacé des fichiers), vous pouvez le faire dans le menu :menuselection:`Bibliothèque --> Réanalyser la bibliothèque`. Si vous souhaitez réanalyser la bibliothèque à chaque démarrage, sélectionner :menuselection:`Préférences --> Bibliothèque --> Réanalyser la bibliothèque au démarrage`.
sl: Če želite vašo zbirko osvežiti (ker ste denimo dodali ali premaknili kakšne datoteke), lahko to storite z izbiro opcije :menuselection:`Zbirka --> Preglej zbirko` iz menija. Če želite zbirko osvežiti ob vsakem zagonu, izberite :menuselection:`Nastavitve --> Zbirka--> Preglej ob zagonu`.

source: On Windows 7 and 8 the import dialog points to your Windows “Music“ Library, a special-purpose virtual folder. You can **not** use these virtual folders. Select a regular folder instead, usually “My Music“, like pictured above.
fr: Sur Windows 7 et 8, la boîte de dialogue d'importation pointe vers votre bibliothèque Windows “Musique“, un dossier virtuel dédié. Vous **ne pouvez pas** utiliser ces dossiers virtuels. Utiliser plutôt un dossier classique, habituellement “Ma Musique“, comme vu ci-dessus.
sl: V Windows 7 in 8 dialog za uvoz kaže na Windowsovo glasbeno zbirko, ki je posebna virtualna mapa. Teh virtualnih imenikov **ne morete** uporabljati. Namesto tega uporabite navadno mapo, ponavadi je to “My Music“, kot je prikazano na zgornji sliki.

source: Analyze your library
fr: Analyser votre librairie
sl: Analiza zbirke

source: |ic_lib_prepare| Mixxx automatically analyzes tracks the first time you load them in a deck, nevertheless it is recommended that you analyze them before playing live to ensure the beatgrids are correct. Furthermore, track analysis takes considerable CPU power and might cause skips in the audio --- things you surely don't need while performing.
fr: |ic_lib_prepare| Mixxx analyse automatiquement les pistes la première fois que vous les chargées sur une platine, il est néanmoins recommandé de les analyser avant de les jouer en public pour s'assurer que les grilles rythmiques sont correctes. En outre, l'analyse des pistes consomme une puissance considérable du processeur et peut causer des sauts dans l'audio --- ce dont vous n'avez sûrement pas besoin lors d'une prestation.
sl: |ic_lib_prepare| Mixxx samodejno analizira skladbe, ko jih prvič naložite v predvajalnik. Ne glede na to je priporočljivo, da jih analizirate pred predvajanjem, tako da zagotovite, da je ritmična mreža pravilna. Analiza skladb vzame precej procesorske moči in lahko povzroči napake v predvajanju zvoka - kar gotovo ni nekaj, kar bi si želeli ob predvajanju.

source: Once you have :ref:`imported your music library<getting-started-import-audio-files>`, press :guilabel:`OK` on the Preferences window. Go to the Analyze view on the left side panel of the library. This allows you to run :term:`beatgrid`, :term:`key`, and :term:`ReplayGain` detection on tracks in advance. While analyzing, the progress in percentage and total queue length are shown.
fr: Une fois que vous avez :ref:`importé votre bibliothèque musicale<getting-started-import-audio-files>`, presser :guilabel:`OK` dans la fenêtre Préférences. Accéder à la vue Analyser sur le panneau latéral gauche de la bibliothèque. Cela vous permet d'exécuter à l'avance :term:`grille rythmique`, :term:`tonalité` et :term:`ReplayGain` sur les pistes. Pendant l'analyse, la progression en pourcentage et la longueur totale de la file d'attente sont affichées.
sl: Po :ref:`uvozu vaše glasbene zbirke<getting-started-import-audio-files>` pritisnite :guilabel:`V redu` v oknu Nastavitve. Pojdite na pogled Analiziraj na levem panoju zbirke. Ta vam omogoča vnaprejšnji zagon prepoznavanja :term:`ritmične mreže`, :term:`tonalitete`, in :term:`ReplayGain normalizacije` skladb. Med analizo se prikazuje napredek v odstotkih in celotna dolžina skladb v vrsti.

source: For more information, go to :ref:`configuration-bpm-detection`.
fr: Pour plus d'information, voir :ref:`configuration-bpm-detection`.
sl: Za več informacij glej :ref:`configuration-bpm-detection`.

source: Configuring sound input and output
fr: Configuration de l'entrée et de la sortie audio
sl: Nastavitve vhodnih in izhodnih naprav

source: Before you can start using Mixxx, you need to configure Mixxx to use your sound hardware in :menuselection:`Preferences --> Sound Hardware`. You do not need to configure all inputs and outputs.
fr: Avant de pouvoir utiliser Mixxx, vous devez le configurer pour utiliser votre matériel audio dans :menuselection:`Préférences --> Matériel sonore`. Vous n'avez pas besoin de configurer toutes les entrées et sorties.
sl: Preden lahko pričnete uporabljati Mixxx, morate nastaviti uporabljeno strojno opremo za zvok. To storite v :menuselection:`Nastavitve --> Strojna oprema za zvok`. Ni vam potrebno nastaviti prav vseh vhodov in izhodov.

source: The :ref:`hardware` chapter explains different types of DJ hardware and how to set them up with the input and output options. For Mixxx to perform the best it can on your system, configure the other :ref:`preferences-sound-hardware` preferences in addition to the inputs and outputs.
fr: Le chapitre :ref:`hardware` explique les différents types de matériel DJ et comment les configurer avec les options d'entrée et de sortie. Pour que Mixxx fonctionne le mieux possible sur votre système, configurer les autre préférences de :ref:`preferences-sound-hardware` en plus des entrées et sorties.
sl: V poglavju :ref:`hardware` je opisana različna strojna oprema za DJ-anje in razloženo, kako zanjo nastaviti možnosti vhodov ter izhodov. Da bi Mixxx na vašem sistemu deloval kar najbolje, poleg vhodov in izhodov nastavite tudi druge nastavitve: :ref:`preferences-sound-hardware`.

source: Mixxx Sound Hardware Preferences
fr: Préférences du matériel sonore de Mixxx
sl: Mixxx nastavitve strojne opreme za zvok

source: Output Options
fr: Options de sortie
sl: Možnosti izhodov

source: **Internal mixing**:
fr: **Mixage interne**:
sl: **Notranje miksanje**:

source: Use these outputs if you are not using an :ref:`external hardware mixer <hardware-mixers>`. If you are using a controller with a built-in audio interface, use these outputs.
fr: Utiliser ces sorties en l'absence d'une :ref:`table de mixage matériel externe <hardware-mixers>`. Si vous utilisez un contrôleur avec une interface audio intégrée, utiliser ces sorties.
sl: Te izhode uporabite, če ne uporabljate :ref:`zunanje strojne mešalke <hardware-mixers>`. Če uporabljate kontroler z vgrajenim zvočni vmesnikom, uporabite te izhode.

source: *Master*: all decks, samplers, microphones, and auxiliary inputs mixed together. This output is sent to the speakers for the audience.
fr: *Master*: toutes les platines, échantillonneurs, microphones et entrées auxiliaires mélangés ensemble. Cette sortie est envoyée aux haut-parleurs pour le public.
sl: *Glavni*: vsi predvajalniki, vzorčevalniki, mikrofoni in pomožni vhodi so združeni skupaj. Ta izhod je povezan na zvočnike za občinstvo.

source: *Headphones*: all decks, samplers, microphones, and auxiliary inputs assigned to :term:`pre-fader listening <PFL>`
fr: *Casque*: toutes les platines, échantillonneurs, microphones et entrées auxiliaires affectées au :term:`pre-fader listening (PLF) <PFL>`
sl: *Slušalke*: vsi predvajalniki, vzorčevalniki, mikrofoni in pomožni izhodi dodeljeni :term:`poslušanju pred drsnikom <PFL>`

source: *Booth*: same as Master output, but has a separate gain control
fr: *Cabine*: identique à la sortie principale, mais avec un contrôle de gain séparé
sl: *DJ-ev prostor*: enako kot glavni izhod, vendar z ločenim nadzorom jakosti

source: **External mixing**:
fr: **Mixage externe**:
sl: **Zunanje miksanje**:

source: *Decks 1-4*: the individual unmixed decks to send to an external mixer
fr: *Platines 1-4*: les platines individuelles non mixées à envoyer à une table de mixage externe
sl: *Predvajalniki 1–4*: posamezni ne-zmešani predvajalniki, ki se pošljejo zunanji mešalki

source: *Bus Left/Center/Right*: all decks, samplers, and auxiliary inputs assigned to each side of Mixxx's crossfader
fr: *Bus Gauche/Centre/Droite*: tous les platines, échantillonneurs et entrées auxiliaires affectées à chacun des côtés du curseur de mixage de Mixxx
sl: *Vodilo levo/sredina/desno*: vsi predvajalniki, vzorčevalniki in pomožni izhodi dodeljeni vsaki strani navzkrižnega drsnika

source: Input Options
fr: Options d'entrée
sl: Možnosti vhodov

source: Use these inputs if you are not using an external hardware mixer. If you are using a controller with a built-in audio interface, use these inputs.
fr: Utiliser ces entrées en l'absence d'une table de mixage matériel externe. Si vous utilisez un contrôleur avec une interface audio intégrée, utiliser ces entrées.
sl: Te vhode uporabite, če ne uporabljate zunanje strojne mešalke. Če uporabljate kontroler z vgrajenim zvočni vmesnikom, uporabite te vhode.

source: *Microphone 1-4*: live microphone or musical instrument inputs
fr: *Microphone 1-4*: entrées micro de direct ou instrument de musique
sl: *Mikrofon 1–4*: vhodi za živi mikrofon ali glasbilo

source: *Auxiliary 1-4*: other sound sources
fr: *Auxiliaire 1-4*: autres sources sonores
sl: *Pomožni 1–4*: drugi zvočni viri

source: *Record/Broadcast*: When this is configured, Mixxx will record and broadcast from this audio interface input instead of the internal master mix. If you have a microphone plugged into the mixer, do not configure the Microphone 1-4 inputs.
fr: *Enregistrer/Diffuser*: Lorsque ceci est configuré, Mixxx enregistrera et diffusera à partir de cette entrée d'interface audio au lieu du mixage interne principal. Si un microphone est branché sur la table de mixage, ne configurer pas les entrées Microphone 1-4.
sl: *Snemanje/prenos*: Če je to nastavljeno, bo Mixxx snemal in prenašal iz tega vhoda zvočnega vmesnika in ne iz notranjega glavnega mešanja. Če imate na mešalko priključen mikrofon, ne nastavite vhodov Mikrofon 1–4.

source: **Either internal or external mixing**:
fr: **Mixage interne ou externe**:
sl: **Notranje ali zunanje mešanje**

source: *Vinyl Control 1-4*: timecode input from turntables or CDJs for manipulating decks 1-4
fr: *Contrôle Vinyle 1-4*: entrée de timecode à partir de platines vinyles ou CDJ pour manipuler les platines 1-4
sl: *Gramofonsko upravljanje 1–4*: vhod s časovnimi kodami z gramofonskih ali CD plošč za upravljanje predvajalnikov 1–4
