Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/hardware.po
Languages: fr

source: DJ Hardware
fr: Matériel DJ

source: Although Mixxx can be used with just a laptop or desktop computer, fully taking advantage of Mixxx's features requires specialized DJ hardware. Depending on your budget and application area, your setup and requirements may vary. This chapter provides general background information about various types of DJ hardware.
fr: Bien que Mixxx puisse être utilisé avec seulement un ordinateur portable ou de bureau, tirer pleinement parti des fonctionnalités de Mixxx nécessite un matériel DJ spécialisé. Selon votre budget et votre domaine d'activité, votre configuration et vos exigences peuvent varier. Ce chapitre fournit des informations générales sur divers types de matériel DJ.

source: The `Mixxx DJ Hardware Guide <https://mixxx.org/wiki/doku.php/hardware_compatibility>`_ lists specific devices with information about their prices, features, and compatibility with Mixxx.
fr: Le `Guide du matériel DJ <https://mixxx.org/wiki/doku.php/hardware_compatibility>`_ répertorie les appareils spécifiques avec des informations sur leurs prix, leurs fonctionnalités et leurs compatibilité avec Mixxx.

source: Controllers
fr: Contrôleurs

source: DJ controllers are devices with knobs, faders, buttons, and jog wheels to control DJ software such as Mixxx. Controllers allow quick access to different controls while providing tactile and visual feedback indicating the state of each control, such as the position of a knob or whether a switch is on or off. This allows you to focus on manipulating the music without needing to look at your computer screen all the time. Controllers also allow using two hands to manipulate two different controls at the same time, which is required for many mixing techniques.
fr: Les contrôleurs DJ sont des appareils dotés de potentiomètres, de curseurs, de boutons et de molettes pour contrôler les logiciels DJ tels que Mixxx. Les contrôleurs permettent un accès rapide aux différentes commandes tout en fournissant un retour tactile et visuel indiquant l'état de chaque commande, comme la position d'un potentiomètre ou si un interrupteur est activé ou désactivé. Cela vous permet de vous concentrer sur la manipulation de la musique sans avoir à regarder tout le temps l'écran de votre ordinateur. Les contrôleurs permettent également d'utiliser deux mains pour manipuler deux contrôles différents en même temps, ce qui est nécessaire pour de nombreuses techniques de mixage.

source: DJ controllers typically do not do any actual audio processing. Instead, they send signals (typically :term:`MIDI` or :term:`HID` over a USB cable) to the computer to instruct DJ software how to manipulate the audio. Many DJ controllers include an :ref:`audio interface <hardware-audio-interfaces>` with 2 separate stereo outputs built into the device. This allows the DJ to transport and setup only one piece of hardware in addition to a laptop. Some devices can be used as both a controller and :ref:`hardware mixer <hardware-mixers>`.
fr: Les contrôleurs DJ ne font généralement aucun traitement audio réel. Au lieu de cela, ils envoient des signaux (généralement :term:`MIDI` ou :term:`HID` via un câble USB) à l'ordinateur pour indiquer au logiciel DJ comment manipuler l'audio. De nombreux contrôleurs DJ incluent une :ref:`interface audio <hardware-audio-interfaces>` avec 2 sorties stéréo séparées, intégrées à l'appareil. Cela permet au DJ de transporter et de configurer un seul matériel en plus d'un ordinateur portable. Certains appareils peuvent être utilisés à la fois comme contrôleur et :ref:`table de mixage matériel <hardware-mixers>`.

source: Mixxx can work with any :term:`MIDI` or :term:`HID` :term:`controller` as long as there is a mapping file to tell Mixxx how to understand the controller's signals. Mixxx comes bundled with a number of MIDI and HID mapping presets, which are listed in the `Mixxx DJ Hardware Guide <https://mixxx.org/wiki/doku.php/hardware_compatibility>`_ on the wiki. For controllers that Mixxx does not yet support, you can `search the forum <https://mixxx.org/forums/search.php?fid[]=7>`_ to see if anyone has started a mapping. You can also start one yourself using the information in the `Controller Mapping Documentation <https://mixxx.org/wiki/doku.php/start#controller_mapping_documentation>`_ on the wiki.
fr: Mixxx peut fonctionner avec n'importe quel :term:`contrôleur` :term:`MIDI` ou :term:`HID` du moment qu'il y a un fichier de mappage pour dire à Mixxx comment comprendre les signaux du contrôleur. Mixxx est fourni avec de nombreux préréglages de mappage MIDI ou HID, qui sont listés dans le `Guide Mixxx du Matériel DJ <https://mixxx.org/wiki/doku.php/hardware_compatibility>`_ sur le wiki. Pour les contrôleurs que Mixxx ne prend pas encore en charge, vous pouvez `chercher dans le forum <https://mixxx.org/forums/search.php?fid[]=7>`_ pour voir si quelqu'un a commencé un mappage. Vous pouvez aussi en commencer un vous-même en utilisant les informations de la `Documentation sur le mappage des contrôleurs <https://mixxx.org/wiki/doku.php/start#controller_mapping_documentation>`_ dans le wiki.

source: :ref:`control-midi` describes how to configure Mixxx to use controllers.
fr: :ref:`control-midi` décrit comment configurer Mixxx pour utiliser des contrôleurs.

source: Audio Interfaces
fr: Interfaces audio

source: An audio interface (also known as a "sound card", although few of them are shaped like cards anymore) is a device that allows a computer to send output to and receive input from audio equipment. Whether using :ref:`internal or external mixing <intro-how-mixxx-works>`, it is recommended to use a single audio interface with at least 4 independent output channels (2 separate stereo pairs).
fr: Une interface audio (également connue sous le nom de "carte son", bien que peu d'entre elles aient la forme de cartes) est un dispositif qui permet à un ordinateur d'envoyer et de recevoir des données provenant d'équipements audio. Que ce soit pour un :ref:`mixage interne ou externe <intro-how-mixxx-works>`, il est recommandé d'utiliser une seule interface audio avec au moins 4 canaux de sortie indépendants (2 paires stéréo séparées).

source: The headphone jack on most laptops is not a second audio output. Rather, plugging headphones into the jack simply redirects the laptop's single stereo output from its speakers to your headphones. A splitter cable can be used to separate the stereo output of a headphone jack into two separate mono outputs for headphone cueing, but it is recommended to use a sound card with at least four mono outputs (for two stereo pairs). Such sound cards tend to be higher quality than those built into laptops and allow your mix to be enjoyed in stereo by your audience.
fr: La prise casque de la plupart des ordinateurs portables n'est pas une deuxième sortie audio. Au contraire, le branchement d'un casque dans la prise redirige simplement la sortie stéréo unique de l'ordinateur portable de ses haut-parleurs vers votre casque. Un câble répartiteur peut être utilisé pour séparer la sortie stéréo d'une prise casque en deux sorties mono distinctes pour la pré-écoute au casque, mais il est recommandé d'utiliser une carte son avec au moins quatre sorties mono (pour deux paires stéréo). Ces cartes son ont tendance à être de meilleure qualité que celles intégrées aux ordinateurs portables et permettent à votre public de profiter de votre mixage en stéréo.

source: Unlike some proprietary DJ systems, Mixxx can use any audio interface and any :term:`MIDI` or :term:`HID` controller that your :term:`OS <operating system>` has drivers to use. If your controller has an integrated audio interface, you may choose to use a different audio interface for higher quality audio. Mixxx can also use multiple audio interfaces simultaneously.
fr: Contrairement à certains systèmes DJ propriétaires, Mixxx peut utiliser n'importe quelle interface audio et n'importe quel contrôleur :term:`MIDI` ou :term:`HID` dont votre :term:`OS <operating system>` dispose des pilotes. Si votre contrôleur possède une interface audio intégrée, vous pouvez choisir d'utiliser une interface audio différente pour un son de meilleure qualité. Mixxx peut également utiliser plusieurs interfaces audio simultanément.

source: Audio Interface Considerations
fr: Considérations relatives à l'interface audio

source: This section provides background information to help you choose an audio interface to use with Mixxx.
fr: Cette section fournit des informations générales pour vous aider à choisir une interface audio à utiliser avec Mixxx.

source: Bit Depth and Sample Rate
fr: Résolution et taux d'échantillonnage

source: Most music is published with a bit depth of 16 bits at a sample rate of 44.1 kHz because this is all that is needed to store all the detail of music in digital form.
fr: La plupart des musiques sont publiées avec une résolution de 16 bits à une fréquence d'échantillonnage de 44,1 kHz car c'est tout ce qui est nécessaire pour stocker tous les détails de la musique sous forme numérique.

source: Bit depth determines the possible dynamic range of the signal. 16 bits is more than enough for playing back music. While 24 bits is helpful for recording, `it is useless for playback <https://sonicscoop.com/2013/08/29/why-almost-everything-you-thought-you- knew-about-bit-depth-is-probably-wrong/>`_.
fr: La résolution détermine la plage dynamique possible du signal. 16 bits est plus que suffisant pour lire de la musique. Bien que 24 bits soit utile pour l'enregistrement, `c'est inutile pour la lecture <https://sonicscoop.com/2013/08/29/why-almost-everything-you-thought-you- knew-about-bit-depth-is-probably-wrong/>`_.

source: Half the sample rate determines the maximum frequency that can be represented by the signal. Humans generally can't hear frequencies above 20 kHz, so a sampling rate of 44.1 kHz, representing a maximum frequency of 22.05 kHz, is fine for playback. Higher sample rates like 88.2 kHz and 96 kHz can be helpful to reduce aliasing distortion when recording, but have no benefit for playback and make your computer work harder.
fr: La moitié de la fréquence d'échantillonnage détermine la fréquence maximale qui peut être représentée par le signal. Les humains ne peuvent généralement pas entendre les fréquences supérieures à 20 kHz, donc une fréquence d'échantillonnage de 44,1 kHz, représentant une fréquence maximale de 22,05 kHz, convient parfaitement à la lecture. Des taux d'échantillonnage plus élevés tels que 88,2 kHz et 96 kHz peuvent être utiles pour réduire la distorsion d'alias lors de l'enregistrement, mais n'ont aucun avantage pour la lecture et font travailler votre ordinateur plus durement.

source: For a more thorough and technical explanation of why 16 bits at 44.1 kHz is all that is needed for playback, read `24/192 Music Downloads Are Very Silly Indeed <https://people.xiph.org/~xiphmont/demo/neil-young.html>`_.
fr: Pour une explication plus approfondie et technique des raisons pour lesquelles 16 bits à 44,1 kHz sont tout ce qui est nécessaire pour la lecture, liser `24/192 Music Downloads Are Very Silly Indeed <https://people.xiph.org/~xiphmont/demo/neil-young.html>`_.

source: Specifications
fr: Spécifications

source: When considering specifications, higher dynamic range, higher signal-to-noise ratio (SNR), higher maximum output level, lower THD+N (Total Harmonic Distortion + Noise; look for a more negative dB value or smaller percentage), and lower crosstalk (more negative dB value) are better. Cheap audio interfaces tend to not have these specifications published.
fr: Lorsque l'on considère les spécifications, une plage dynamique plus élevée, un rapport signal/bruit (SNR) plus élevé, un niveau de sortie maximal plus élevé, un THD+N (distorsion harmonique totale + bruit; rechercher une valeur dB plus négatif ou un pourcentage plus petit) plus faible, et une diaphonie inférieure (valeur dB plus négative) sont meilleures. Les interfaces audio bon marché ont tendance à ne pas publier ces spécifications.

source: Connector and Cable Types
fr: Types de connecteurs et de câbles

source: If you are unfamiliar with professional audio equipment, read Digital DJ Tips' `Essential Guide to Audio Cables for DJs <https://www.digitaldjtips.com/2011/07/the-essential-guide-to-audio-cables-for-djs>`_ to understand the different kinds of connectors on audio interfaces. It is better to use an audio interface with balanced outputs, especially if you will run long cables directly into an amplifier or active speakers without going through a :ref:`hardware mixer <hardware-mixers>`. Balanced signals reject interference and are less susceptible to ground loop hum issues (which can be a problem when plugging unbalanced gear into separate power sources).
fr: Si vous n'êtes pas familier avec les équipements audio professionnels, liser les conseils de Digital DJ `Essential Guide to Audio Cables for DJs <https://www.digitaldjtips.com/2011/07/the-essential-guide-to-audio-cables-for-djs>`_ pour comprendre les différents types de connecteurs sur les interfaces audio. Il est préférable d'utiliser une interface audio avec des sorties symétriques, surtout si vous acheminez de longs câbles directement dans un amplificateur ou des haut-parleurs actifs sans passer par une :ref:`table de mixage matérielle <hardware-mixers>`. Les signaux équilibrés rejettent les interférences et sont moins sensibles aux problèmes de ronflement de la boucle de masse (ce qui peut être un problème lors du branchement d'un équipement asymétrique à des sources d'alimentation distinctes).

source: However, most venues have DJs plug into :ref:`hardware DJ mixers <hardware-mixers>`, which typically only have RCA inputs (RCA cables cannot be balanced). Most home/computer speakers and amplifiers have RCA and/or 1/8" TRS stereo inputs. Most live sound mixers have balanced 1/4" TRS mono inputs. If you need to interconnect balanced and unbalanced gear, refer to this `guide from Presonus (deleted, via archive.org) <https://web.archive.org/web/20171011070552/https://www.presonus.com/learn/technical-articles/Balanced-Unbalanced>`_ and this `guide from Rane (deleted, via archive.org) <https://web.archive.org/web/20191224231514/rane.com/note110.html>`_.
fr: Cependant, la plupart des lieux ont des DJ branchés sur des :ref:`tables de mixage DJ matérielles <hardware-mixers>`, qui n'ont généralement que des entrées RCA (les câbles RCA ne peuvent pas être équilibrés). La plupart des haut-parleurs et amplificateurs pour la maison/l'ordinateur ont des entrées stéréo RCA et/ou TRS 1/8''. La plupart des mixeurs de son en live ont des entrées mono TRS 1/4'' symétriques. Si vous devez interconnecter un équipement équilibré et non équilibré, reportez-vous à `guide from Presonus (effacé, via archive.org) <https://web.archive.org/web/20171011070552/https://www.presonus.com/learn/technical-articles/Balanced-Unbalanced>`_ et à `guide from Rane (effacé, via archive.org) <https://web.archive.org/web/20191224231514/rane.com/note110.html>`_.

source: Number of Channels
fr: Nombre de canaux

source: Audio interfaces sometimes have multiple connectors for a single channel, resulting in more connectors than channels. So, not every connector can send or receive and independent signal. For example, some audio interfaces made for DJing have 4 output channels with 4 mono output connectors and 1 stereo headphone connector. This does not mean that the audio interface can send out 6 different signals at the same time; rather, the signal on 2 of the mono outputs and the stereo headphone output would be the same. Also, many controllers have separate master and booth outputs with independent volume controls, but they both play the same signal.
fr: Les interfaces audio ont parfois plusieurs connecteurs pour un seul canal, ce qui entraîne plus de connecteurs que de canaux. Ainsi, tous les connecteurs ne peuvent pas envoyer ou recevoir de signal indépendant. Par exemple, certaines interfaces audio conçues pour le DJ ont 4 canaux de sortie avec 4 connecteurs de sortie mono et 1 connecteur de casque stéréo. Cela ne signifie pas que l'interface audio peut envoyer 6 signaux différents en même temps; au contraire, le signal sur 2 des sorties mono et la sortie casque stéréo seraient les mêmes. En outre, de nombreux contrôleurs ont des sorties principale et cabine séparées avec des contrôles de volume indépendants, mais ils jouent tous les deux le même signal.

source: Vinyl Control and Phono Preamplifiers
fr: Préamplificateurs de contrôle vinyle et phono

source: Turntables output low voltage (phono level) signals that need to be amplified to line level before most audio equipment can work with them. So, if you want to use :ref:`vinyl-control`, sometimes referred to as a Digital Vinyl System (DVS), it is best to have phono preamplifiers (one for each deck) somewhere between your turntable and sound card to boost the turntable's phono level signal to line level. Mixxx can amplify phono level signals in software, but it is better to do it in hardware. The phono preamp can be in the turntable, in the audio interface, or a stand alone device. Most audio interfaces do not have phono preamps; these are generally found on audio interfaces specifically made for controlling DJ software with timecode vinyl. :ref:`hardware-mixers` with audio interfaces have phono preamps on their deck inputs, but not necessarily on every deck input. Many higher-end all-in-one controllers also include audio interfaces with phono preamps.
fr: Les tourne-disques sortent des signaux basse tension (niveau phono) qui doivent être amplifiés au niveau ligne avant que la plupart des équipements audio puissent fonctionner avec eux. Donc, si vous souhaitez utiliser un :ref:`vinyl-control`, parfois appelé Digital Vinyl System (DVS), il est préférable d'avoir des préamplificateurs phono (un pour chaque platine) quelque part entre votre tourne-disque et votre carte son pour booster le signal de niveau phono du tourne-disque au niveau ligne. Mixxx peut amplifier les signaux de niveau phono dans le logiciel, mais il vaut mieux le faire dans le matériel. Le préampli phono peut être dans le tourne-disque, dans l'interface audio ou dans un appareil autonome. La plupart des interfaces audio n'ont pas de préamplis phono; ceux-ci se trouvent généralement sur des interfaces audio spécialement conçues pour contrôler les logiciels DJ avec du timecode de vinyle. Les :ref:`hardware-mixers` avec interfaces audio ont des préamplis phono sur leurs entrées de platine, mais pas nécessairement sur chaque entrée de platine. De nombreux contrôleurs tout-en-un haut de gamme incluent également des interfaces audio avec des préamplis phono.

source: Mixers
fr: Tables de mixage

source: Mixers are devices that combine audio signals. DJ mixers are different from live and studio mixers because they have multiple stereo channels with phono preamplifiers for connecting :ref:`hardware-turntables`. It is conventional to use a DJ mixer with :ref:`vinyl-control`, but vinyl control can be used without a hardware mixer.
fr: Les tables de mixage sont des appareils qui combinent des signaux audio. Les tables de mixage DJ sont différents des tables de mixage de live et de studio car ils ont plusieurs canaux stéréo avec des préamplificateurs phono pour la connexion de :ref:`hardware-turntables`. Il est classique d'utiliser une table de mixage DJ avec :ref:`vinyl-control`, mais le contrôle vinyle peut être utilisée sans table de mixage matérielle.

source: Using Mixxx with a DJ mixer requires an audio interface with at least 4 mono outputs (2 stereo pairs) to send Mixxx's decks to the mixer's stereo channels. Some DJ mixers have a USB :ref:`audio interface <hardware-audio-interfaces>` built into them. This lets Mixxx send unmixed audio files directly to the mixer without needing a separate stand-alone audio interface.
fr: L'utilisation de Mixxx avec une table de mixage DJ nécessite une interface audio avec au moins 4 sorties mono (2 paires stéréo) pour envoyer les platines de Mixxx aux canaux stéréo de la table de mixage. Certaines tables de mixage DJ ont une :ref:`interfaces audio <hardware-audio-interfaces>` USB intégrées. Cela permet à Mixxx d'envoyer des fichiers audio non mélangés directement à table de mixage sans avoir besoin d'une interface audio autonome distincte.

source: Often DJs who use DJ software with internal mixing send their master output to a hardware mixer. This can be helpful to send the mixed signal to both a main speaker output for the audience and booth speakers for the DJ with separate gain controls for each output. It also facilitates smooth transitions between DJs.
fr: Souvent, les DJ qui utilisent un logiciel DJ avec mixage interne envoient leur sortie principale à une table de mixage matérielle. Cela peut être utile pour envoyer le signal mélangé à la fois à une sortie principale d'enceinte pour le public et à des enceintes de cabine pour le DJ avec des commandes de gain distinctes pour chaque sortie. Il facilite également les transitions en douceur entre les DJ.

source: However, using an external mixer with internal mixing is not necessary and reduces the sound quality. Each piece of equipment an audio signal passes through reduces the sound quality, so avoiding unnecessary equipment in the signal path can provide better sound quality. Many DJ controllers provide separate master and booth outputs with independent volume controls. Alternatively, a sound card with at least 6 output channels can be used with Mixxx's :guilabel:`Booth` output.
fr: Cependant, l'utilisation d'une table de mixage externe avec mixage interne n'est pas nécessaire et réduit la qualité sonore. Chaque équipement traversé par un signal audio réduit la qualité du son, donc éviter les équipements inutiles sur le chemin du signal pour fournir une meilleure qualité sonore. De nombreux contrôleurs DJ fournissent des sorties principale et cabine séparées avec des commandes de volume indépendantes. Alternativement, une carte son avec au moins 6 canaux de sortie peut être utilisée avec la sortie :guilabel:`Cabine` de Mixxx.

source: Many people confuse "analog mixers" and "hardware mixers", but these are not the same. Many hardware mixers process audio digitally with specialized signal processors as opposed to a general purpose CPU like those in laptop and desktop computers.
fr: Beaucoup de gens confondent "tables de mixage analogique" et "tables de mixage matérielle", mais ce ne sont pas les mêmes. De nombreuses table de mixage matérielles traitent l'audio numériquement avec des processeurs de signaux spécialisés par opposition à un processeur général comme ceux des ordinateurs portables et de bureau.

source: Turntables
fr: Tourne-disques

source: Turntables are mechanical devices that play music recordings cut into vinyl phonograph records. Before software like Mixxx was available, the art of DJing originated with turntables and :ref:`DJ mixers <hardware-mixers>`. Special vinyl records can be used with turntables to control the playback of digital files in Mixxx as if the digital file was pressed onto the vinyl record.
fr: Les tourne-disques sont des appareils mécaniques qui diffusent des enregistrements musicaux gravés sur des disques phonographiques en vinyle. Avant que des logiciels comme Mixxx ne soient disponibles, l'art du DJ est né avec les tourne-disques et la :ref:`tables de mixage DJ <hardware-mixers>`. Des disques vinyle spéciaux peuvent être utilisés avec des tourne-disques pour contrôler la lecture des fichiers numériques dans Mixxx comme si le fichier numérique était pressé sur un disque vinyle.

source: CDJs
fr: CDJ
