Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/hardware.po
Languages: fr

source: CDJs are devices that play digital audio files and have controls from manipulating the playback of the audio. Originally CDJs played audio CDs, but new devices typically use USB storage drives or SD cards. Some CDJs can be plugged into a computer with a USB cable to function as a :ref:`controller <hardware-controllers>` for Mixxx.
fr: Les CDJ sont des appareils qui lisent des fichiers audio numériques et ont des commandes pour manipuler la lecture de l'audio. À l'origine, les CDJ lisaient des CD audio, mais les nouveaux appareils utilisent généralement des clefs de stockage USB ou des cartes SD. Certains CDJ peuvent être branchés sur un ordinateur avec un câble USB pour fonctionner comme un :ref:`contrôleur <hardware-controllers>` pour Mixxx.

source: Microphones convert changes in sound pressure in air to changes in voltage (an analog audio signal). Mixxx can work with any microphone that can be plugged into your :ref:`audio interface <hardware-audio-interfaces>`.
fr: Les microphones convertissent les changements de pression acoustique dans l'air en changements de tension (un signal audio analogique). Mixxx peut fonctionner avec n'importe quel microphone qui peut être branché sur votre :ref:`interface audio <hardware-audio-interfaces>`.
