Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/introduction.po
Languages: it, ru, sl

source: Introduction to Mixxx
it: Introduzione a Mixxx
ru: Введение в Mixxx
sl: Uvod v Mixxx

source: Mixxx enables you to perform live DJ mixes with your digital music collection. It helps you rock the party with DJ controllers, vinyl turntables, or even just your keyboard. It is developed by an international team of volunteers who want to bring the joy of DJing to everyone. The project is non-profit, open-source and community driven. Together, we aim to build the best DJ software ever created. We hope you will :ref:`join us <contributing>`!
it: Mixxx ti consente di creare live DJ mix con la tua collezione di musica digitale. Ti aiuta ad animare il party con DJ controller, giradischi, o anche solamente con la tua tastiera. È sviluppato da una squadra internazionale di volontari che vogliono portare la gioia di fare il DJ a tutti. Il progetto è no-profit, open-source e guidato dalla comunità. Insieme, miriamo a costruire il miglior software per DJ mai creato. Speriamo tu voglia :ref:`unirti a noi <contributing>`!
ru: Mixxx позволяет вам исполнять живые диджейские миксы с вашей цифровой музыкальной коллекцией. Это поможет вам раскачать вечеринку с помощью DJ-контроллеров, виниловых проигрывателей или даже просто клавиатуры. Он разработан международной командой добровольцев, которые хотят принести радость диджеинга всем желающим. Проект является некоммерческим, с открытым исходным кодом и ориентирован на сообщество. Вместе мы стремимся создать лучшее программное обеспечение для диджеев, когда-либо созданное. Мы надеемся, что вы :ref:`присоединитесь к нам<contributing>`!:
sl: Mixxx vam omogoča, da z vašo digitalno glasbeno zbirko izvajate DJ mikse v živo. Pomaga vam obvladati zabavo z DJ krmilniki, vinilnimi gramofoni, ali samo z vašo tipkovnico. Razvila ga je mednarodna skupina prostovoljcev, ki želijo vsem prikazati veselje do mešanja glasbe. Projekt je neprofiten, odprtokoden in namenjen skupnosti. Skupaj si prizadevamo ustvariti najboljšo programsko opremo za mešalce plošč. Upamo, da se nam boste :ref:`join us<contributing>!

source: How Mixxx Works
it: Come funziona Mixxx
ru: Как работает Mixxx
sl: Kako deluje

source: Mixxx is different from typical music player applications because it plays multiple audio files at the same time and has many features to manipulate the playback of the audio files. This lets you creatively mix different tracks together on the fly.
it: Mixxx è diverso dal tipico lettore musicale perché può riprodurre più file audio contemporaneamente e ha molte funzionalità per manipolare la riproduzione dei file audio. Questo ti permette di mixare in maniera creativa differenti tracce al volo.
ru: Mixxx отличается от обычных приложений для воспроизведения музыки тем, что он воспроизводит несколько аудиофайлов одновременно и имеет множество функций для управления воспроизведением аудиофайлов. Это позволяет вам творчески смешивать различные треки на лету.
sl: Mixxx se razlikuje od običajnih predvajalnikov glasbe, ker predvaja več zvočnih datotek hkrati in ima veliko funkcij za upravljanje predvajanja zvočnih datotek. To vam omogoča sprotno mešanje skladb.

source: You can use Mixxx to preview the next track in headphones before the audience hears it, also known as headphone cueing. This helps you choose a track that is appropriate for the present moment and that will mix well into the currently playing track(s). To use headphone cueing, you need at least 2 separate audio outputs, typically provided by a USB audio interface (also known as a “sound card”, although most of them are not shaped like cards anymore). Mixxx can be used in two different ways for headphone cueing:
it: Puoi usare Mixxx per ascoltare in anteprima il brano successivo in cuffia prima che il pubblico lo senta, noto anche come preascolto in cuffia. Questo ti aiuta a scegliere una traccia che sia appropriata al momento e che si mixi bene nelle tracce che sono in riproduzione. Per usare il preascolto in cuffia,m hai bisogno almeno di 2 uscite audio separate, tipicamente fornite da una interfaccia audio USB (anche nota come “scheda audio”, anche se la maggior parte non ha più una forma simile ad una scheda). Mixxx può essere usato in due modalità differenti per il preascolto in cuffia:
ru: Вы можете использовать Mixxx для предварительного прослушивания следующего трека в наушниках, до того, как его услышит аудитория, функция также известна как "headphone cueing". Это поможет вам выбрать трек, подходящий для текущего момента и который будет хорошо сочетаться с воспроизводимыми в данный момент треками. Для использования подключения наушников вам необходимо как минимум 2 отдельных аудиовыхода, обычно предоставляемых аудиоинтерфейсом USB (также известным как “звуковая карта”, хотя большинство из них больше не имеют формы карт). Mixxx можно использовать двумя различными способами для подключения наушников:
sl: Mixxx lahko uporabite za predogled naslednje skladbe z naglavnimi slušalkami, preden jo občinstvo sliši, znano tudi kot predposlušanje. To vam pomaga izbrati skladbo, ki ustreza trenutku in se bo dobro ujemala s predvajano skladbo/(ami). Če želite uporabiti nastavitev slušalk, potrebujete vsaj 2 ločena izhoda, ki jih običajno zagotavlja zvočni vmesnik USB (znan tudi kot “zvočna kartica”, čeprav večina od njih ni več v obliki kartice). Za predposlušanje je Mixxx mogoče uporabiti na dva različna načina:

source: **Internal Mixing**
it: Mixing Interno
ru: **Внутреннее микширование**
sl: Notranje mešanje

source: Mixxx plays multiple audio files on the computer at the same time, mixes them together, and sends the mixed signal to one audio interface output. A separate signal is sent to another audio interface output for headphone cueing. Often a DJ controller is used with internal mixing to provide easier control over Mixxx than a mouse and keyboard.
it: Mixxx riproduce più file audio sul computer contemporaneamente, li mixa insieme, e invia il segnale mixato ad un'uscita di una scheda audio. Un segnale separato viene inviato ad un'altra uscita di una scheda audio per l'ascolto in cuffia. Spesso viene usato un DJ controller con mixing interno per fornire un controllo più facile su Mixxx rispetto a mouse e tastiera.
ru: Mixxx воспроизводит несколько аудиофайлов на компьютере одновременно, смешивает их вместе и отправляет смешанный сигнал на один выход аудиоинтерфейса. Отдельный сигнал отправляется на другой выход аудиоинтерфейса для подключения наушников. Для упрощения работы с Mixxx при внутреннем микшировании, удобнее использовать DJ-контроллер, чем мышь и клавиатуру.
sl: Mixxx predvaja več zvočnih datotek na računalniku hkrati, jih premeša in pošlje mešan signal na en izhod zvočnega vmesnika. Ločen signal se pošlje na drug izhod zvočnega vmesnika za usmerjanja slušalk. Pogosto se DJ krmilnik uporablja z notranjim mešanjem za lažji nadzor nad Mixxx-om kot miška in tipkovnica.

source: Using Mixxx together with a DJ controller for internal mixing. The DJ controller has an integrated audio interface that provides two separate stereo outputs.
it: Utilizzare Mixxx insieme a un DJ controller per il mixing interno. Il controller DJ ha un'interfaccia audio integrata che fornisce due uscite stereo separate.
ru: Использование Mixxx вместе с DJ-контроллером для внутреннего микширования. DJ-контроллер имеет встроенный аудиоинтерфейс, который обеспечивает два отдельных стереовыхода.
sl: Uporaba Mixxx skupaj z DJ krmilnikom za notranje mešanje. DJ krmilnik ima vgrajen zvočni vmesnik, ki zagotavlja dva ločena stereo izhoda.

source: **External Mixing**
it: Mixing Esterno
ru: **Внешнее микширование**
sl: **Zunanje miksanje**

source: In this kind of setup, Mixxx plays multiple audio files on the computer at the same time and sends each track to a separate audio interface output. The audio interface's outputs are plugged into an external hardware mixer. The hardware mixer performs the actual mixing of the audio signals. On the hardware mixer, there are separate outputs for the mixed signal to play to the audience and for the DJ to use headphone cueing. External mixing is typically used with turntables and :ref:`special vinyl records<vinyl-control>` to manipulate digital music files as if the music was on the vinyl records.
it: In questo tipo di configurazione, Mixxx riproduce più file audio sul computer contemporaneamente e invia ogni traccia a un'uscita dell'interfaccia audio separata. Le uscite dell'interfaccia audio sono collegate a un mixer hardware esterno. Il mixer hardware esegue il mixing effettivo dei segnali audio. Sul mixer hardware sono presenti uscite separate per il segnale mixato da riprodurre al pubblico e per consentire al DJ di utilizzare il preascolto in cuffia. Il mixing esterno viene in genere utilizzato con giradischi e :ref:`speciali dischi in vinile<vinyl-control>` per manipolare file di musica digitale come se la musica fosse sui dischi in vinile.
ru: При такой настройке Mixxx воспроизводит несколько аудиофайлов на компьютере одновременно и отправляет каждую дорожку на отдельный выход аудиоинтерфейса. Выходы аудиоинтерфейса подключены к внешнему аппаратному микшеру. Аппаратный микшер выполняет фактическое смешивание аудиосигналов. На аппаратном микшере есть отдельные выходы для воспроизведения смешанного сигнала для аудитории и для предварительного прослушивания диджеем в наушниках (headphone cueing). Внешнее микширование обычно используется с вертушками и :ref:`специальными виниловыми пластинками<vinyl-control>` для управления цифровыми музыкальными файлами, как если бы музыка была на виниловых пластинках.
sl: V tej vrsti postavitve bo Mixxx na računalniku predvajal več zvočnih datotek hkrati in vsako skladbo pošiljal na ločen zvočni izhod. Izhodi so vklopljeni v zunanjo zvočno mešalko, kjer se izvaja dejansko miksanje zvočnih signalov. Strojna mešalka ima ločene izhode za predvajanje zmiksanega signala občinstvu in za didžejevo predposlušanje. Zunanje miksanje je ponavadi uporabljeno za gramofone in :ref:`special vinyl records`<vinyl-control>, ki omogočijo rabo glasbe iz digitalnih datotek, kot da bi bile predvajane z gramofonskih plošč..

source: Using Mixxx together with a USB audio interface, external mixer, and timecode vinyl for external mixing
it: Utilizzare Mixxx insieme a schede audio USB, mixer esterno, e dischi in vinile timecode per il mixing esterno
ru: Использование Mixxx вместе с аудиоинтерфейсом USB, внешним микшером и винилом с временным кодом для внешнего микширования
sl: Raba programa Mixxx z USB zvočnim vmesnikom, zunanjo zvočno mešalko in gramofonsko ploščo s časovno kodo za zunanje miksanje.
