Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/livebroadcasting.po
Languages: fr

source: Download `LAME 3.98.4 <https://mega.nz/#!WdwHHTzA!UkdJwUQiihwHb0ShdOBTYj8noSwXluxiKjdWvFQRgOU>`_ Intel (macOS 10.8+ 64-bit)
fr: Télécharger `LAME 3.98.4 <https://mega.nz/#!WdwHHTzA!UkdJwUQiihwHb0ShdOBTYj8noSwXluxiKjdWvFQRgOU>`_ Intel (macOS 10.8+ 64-bit)

source: Double-click on the downloaded zip file to unpack the file and you'll get an installer package file
fr: Double-cliquer sur le fichier zip téléchargé pour décompresser le fichier et vous obtiendrez un fichier de paquet d'installation

source: Double-click on the installer package file and follow the step-by-step instructions in the installer
fr: Double-cliquer sur le fichier du paquet d'installation et suiver les instructions étape par étape dans le programme d'installation

source: Method B: Package manager
fr: Méthode B : Gestionnaire de paquets

source: Another easy way to activate MP3 streaming is to use `Homebrew <https://brew.sh/>`_ or `MacPorts <https://www.macports.org/>`_, which are package managers like `apt <https://en.wikipedia.org/wiki/Advanced_Packaging_Tool>`_ on Debian/Ubuntu Linux. They provide a convenient way to install many Open Source packages. Once Homebrew or Macports is installed, adding MP3 support to Mixxx is rather simple.
fr: Un autre moyen simple d'activer la diffusion MP3 consiste à utiliser `Homebrew <https://brew.sh/>`_ ou `MacPorts <https://www.macports.org/>`_, qui sont des gestionnaires de paquets comme `apt <https://en.wikipedia.org/wiki/Advanced_Packaging_Tool>`_ sur Linux Debian/Ubuntu. Ils fournissent un moyen pratique d'installer de nombreux paquets Open Source. Une fois Homebrew ou Macports installé, l'ajout du support MP3 à Mixxx est plutôt simple.

source: Open a terminal and type the following commands::
fr: Ouvrer un terminal et entrer les commandes suivantes ::

source: Activate MP3 streaming support on Linux
fr: Activer la prise en charge de la diffusion MP3 sur Linux

source: On Ubuntu and GNU/Linux-based operating systems MP3 streams can be activated by installing the package :file:`libmp3lame`. Dependent on your Linux distribution the package might be slightly named different such as :file:`lame`.
fr: Sur les systèmes d'exploitation Ubuntu et GNU/Linux, les flux MP3 peuvent être activés en installant le paquet :file:`libmp3lame`. En fonction de votre distribution Linux, le paquet peut être légèrement différent, par exemple :file:`lame`.
