Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/livebroadcasting.po
Languages: fr

source: Live Broadcasting - Start your own Internet radio
fr: Diffusion en direct - Démarrer votre propre radio Internet

source: Live Broadcasting in Mixxx allow you to stream your mix over the Internet to listeners around the world.
fr: La diffusion en direct dans Mixxx vous permet de diffuser votre mix sur Internet à des auditeurs du monde entier.

source: The :ref:`microphones` chapter has detailed instructions for including input from microphones in your broadcasted mixes.
fr: Le chapitre :ref:`microphones` contient des instructions détaillées pour inclure l'entrée des microphones dans vos mixs diffusés.

source: Streaming Servers
fr: Serveurs de diffusion du flux

source: **Remote streaming server**
fr: **Serveur distant de diffusion du flux**

source: Mixxx allows you to feed your audio stream directly to :term:`Shoutcast <shoutcast>` and :term:`Icecast <icecast>` streaming servers. Depending on the number of listeners, streaming audio requires a significant amount of bandwidth. Streaming servers provide the required bandwidth and broadcast the stream to your listeners. A popular free streaming service is `Caster.fm <http://www.caster.fm>`_. A review of several free and paid stream hosts is available at `broadcastingworld.net <http://www.broadcastingworld.com/reviews/category-stream-hosting>`_.
fr: Mixxx vous permet d'alimenter votre flux audio directement vers les serveurs de streaming :term:`Shoutcast <shoutcast>` et :term:`Icecast <icecast>`. Selon le nombre d'auditeurs, le streaming audio nécessite une quantité importante de bande passante. Les serveurs de streaming fournissent la bande passante requise et diffusent le flux à vos auditeurs. Un service de streaming gratuit populaire est `Caster.fm <http://www.caster.fm>`_. Une revue de plusieurs hébergeurs de flux gratuits et payants est disponible sur `broadcastworld.net <http://www.broadcastingworld.com/reviews/category-stream-hosting>`_.

source: Mixxx as client-side streaming source broadcasting to an remote streaming server
fr: Mixxx comme source de diffusion côté client diffusant sur un serveur distant de diffusion

source: **Local streaming server**
fr: **Serveur local de diffusion du flux**

source: For experienced users, it may be interesting to set up your own local streaming server. This turns your personal computer into a radio station and listeners connect directly to your server. Mixxx as a streaming source does not need to run on the same computer as your streaming server. However, professional stations often run the streaming source on the same computer as the streaming server for stability and reliability reasons. Keep in mind that if want to stream audio to a significant number of listeners, you'll need enough bandwidth. Read the `Shoutcast documentation <http://wiki.winamp.com/wiki/SHOUTcast_Getting_Started_Guide>`_ or `Icecast documentation <http://www.icecast.org/docs/>`_ for server setup instructions.
fr: Pour les utilisateurs expérimentés, il peut être intéressant de configurer votre propre serveur de diffusion local. Cela transforme votre ordinateur personnel en une station de radio et les auditeurs se connectent directement à votre serveur. Mixxx en tant que source de diffusion n'a pas besoin de s'exécuter sur le même ordinateur que votre serveur de diffusion. Cependant, les stations professionnelles exécutent souvent la source de diffusion sur le même ordinateur que le serveur de diffusion pour des raisons de stabilité et de fiabilité. Garder à l'esprit que si vous souhaitez diffuser de l'audio vers un nombre important d'auditeurs, vous aurez besoin d'une bande passante suffisante. Lisez la `documentation Shoutcast <http://wiki.winamp.com/wiki/SHOUTcast_Getting_Started_Guide>`_ ou `la documentation Icecast <http://www.icecast.org/docs/>`_ pour les instructions de configuration du serveur.

source: Mixxx as client-side streaming source broadcasting to an local streaming server
fr: Mixxx comme source de diffusion côté client diffusant sur un serveur local de diffusion

source: Configuring Mixxx
fr: Configurer Mixxx

source: Start by supplying Mixxx with all information needed to establish a connection to the streaming server:
fr: Commencer par fournir à Mixxx toutes les informations nécessaires pour établir une connexion avec le serveur de diffusion:

source: Open :menuselection:`Preferences --> Live Broadcasting`.
fr: Ouvrir :menuselection:`Préférences --> Diffusion en direct`.

source: Insert the settings following the descriptions in the :ref:`live-broadcasting-preferences`
fr: Insérer les paramètres en suivant les descriptions dans :ref:`live-broadcasting-preferences`

source: Click :guilabel:`OK`
fr: Cliquer sur :guilabel:`OK`

source: Go to :menuselection:`Options --> Enable Live Broadcasting` or use the :ref:`appendix-shortcuts` to start broadcasting.
fr: Allez dans :menuselection:`Options --> Activer la Diffusion en Direct (Broadcast)` ou utiliser :ref:`appendix-shortcuts` pour démarrer la diffusion.

source: Live Broadcasting Preferences
fr: Paramètre de diffusion en direct

source: Mixxx preferences - Setting up live broadcasting
fr: Préférences Mixxx - Configurer la diffusion en direct

source: **Server Connection**
fr: **Connexion Serveur**

source: **Type**: Select the type of streaming server you want to connect with. :term:`Shoutcast 1<shoutcast>`, :term:`Icecast 1 <icecast>`, and :term:`Icecast 2<icecast>` servers are supported.
fr: **Type**: Sélectionner le type de serveur de diffusion auquel vous souhaitez vous connecter. Serveurs pris en charge: :term:`Shoutcast 1<shoutcast>`, :term:`Icecast 1 <icecast>` et :term:`Icecast 2<icecast>`.

source: Mixxx works with Shoutcast 2 using the Shoutcast 1 protocol if you provide a stream name in :menuselection:`Preferences --> Live Broadcasting --> Stream Settings`. If you don't provide a stream name, Shoutcast 2 rejects the connection (where Shoutcast 1 would accept this case).
fr: Mixxx fonctionne avec Shoutcast 2 en utilisant le protocole Shoutcast 1 si vous fournissez un nom de flux dans :menuselection:`Préférences --> Diffusion en direct --> Paramètre du flux`. Si vous ne fournissez pas de nom de flux, Shoutcast 2 rejette la connexion (alors que Shoutcast 1 accepterait ce cas).

source: **Host**: You can enter the host as either a host name or an IP address.
fr: **Hôte** : Vous pouvez entrer l'hôte comme nom d'hôte ou adresse IP.

source: **Login**: As provided by your streaming server provider. Without this, you will not connect successfully to the server. The default login for *Icecast* is ``source`` while the default login for Shoutcast is ``admin``.
fr: **Identifiant**: Tel que fourni par votre fournisseur de serveur de diffusion. Sans cela, vous ne pourrez pas vous connecter correctement au serveur. La connexion par défaut pour *Icecast* est ``source`` tandis que la connexion par défaut pour Shoutcast est ``admin``.

source: **Mount**: A mount point is a unique name identifying a particular stream. For *Shoutcast* it is not necessary to specify a mount point. The setting must not be blank if you are using *Icecast*. Try the default ``/mount`` or ``/live``. If you haven't been given a specific mount point you can usually make one up. It always begins with a ``/`` (slash) followed by a text without any special characters in it.
fr: **Montage**: Un point de montage est un nom unique identifiant un flux particulier. Pour *Shoutcast*, il n'est pas nécessaire de spécifier un point de montage. Le paramètre ne doit pas être vide si vous utilisez *Icecast*. Essayer la valeur par défaut ``/mount`` ou ``/live``. Si vous n'avez pas reçu de point de montage spécifique, vous pouvez généralement en créer un. Il commence toujours par un ``/`` (barre oblique) suivi d'un texte sans aucun caractère spécial.

source: **Port**: As provided by your streaming server provider. Most servers use the default port 8000.
fr: **Port**: Tel que fourni par votre fournisseur de serveur de diffusion. La plupart des serveurs utilisent le port par défaut 8000.

source: **Password**: As provided by your streaming server provider, unless you run your own radio server. It is required to establish the connection to the server and to start the broadcast.
fr: **Mot de passe** : Tel que fourni par votre fournisseur de serveur de diffusion, sauf si vous exécutez votre propre serveur radio. Il est nécessaire d'établir la connexion au serveur et de démarrer la diffusion.

source: Do not enter a :term:`URL` as the host! ``http://example.com:8000`` does not work. Use ``example.com`` in the :guilabel:`Host` field and ``8000`` in the :guilabel:`Port` field instead.
fr: N'entrez pas un :term:`URL` comme hôte ! ``http://example.com:8000`` ne fonctionne pas. Utiliser ``example.com`` dans le champ :guilabel:`Host` et ``8000`` dans le champ :guilabel:`Port` à la place.

source: **Stream Setting**
fr: **Paramètre du flux**

source: **Public stream**: If enabled, this option adds your radio station to the Shoutcast/Icecast directory.
fr: **Flux public**: si elle est activée, cette option ajoute votre station de radio au répertoire Shoutcast/Icecast.

source: **Enable UTF-8 metadata**: If enabled, this option fixes broken accented and foreign language symbols in :term:`metadata`, assuming the streaming provider has configured the server to support UTF-8 metadata.
fr: **Utiliser l'encodage UTF-8 pour les métadonnées**: Si elle est activée, cette option corrige les symboles de langue accentuée et étrangère rompus dans les :term:`métadonnée`, en supposant que le fournisseur de diffusion a configuré le serveur pour prendre en charge les métadonnées UTF-8.

source: **Dynamically update Ogg Vorbis metadata**: Due to flaws in some streaming clients, updating Ogg Vorbis metadata dynamically can cause listener glitches and disconnections. Check this box to update the metadata anyway. Some players that listeners can use have bugs that can cause audio glitches or disconnections when the Ogg Vorbis metadata is updated dynamically. If this is not a problem, you can enable this checkbox.
fr: **Mettre à jour dynamiquement les métadonnées Ogg Vorbis**: En raison de failles dans certains clients de streaming, la mise à jour dynamique des métadonnées Ogg Vorbis peut provoquer des problèmes d'écoute et des déconnexions. Cocher cette case pour mettre à jour les métadonnées malgrés tout. Certains lecteurs utilisés par les auditeurs ont des bogues qui peuvent provoquer des problèmes ou des déconnexions audio lorsque les métadonnées Ogg Vorbis sont mises à jour dynamiquement. Si ce n'est pas un problème, vous pouvez activer cette case à cocher.

source: **Stream name**: So, what's the name of your show?
fr: **Nom du flux** : Alors, quel est le nom de votre émission ?

source: **Website**: The website you would like your listeners to visit.
fr: **Site Internet**: Le site Web que vous souhaitez que vos auditeurs visitent.

source: **Description**: Enter your DJ name and a short tagline.
fr: **Description** : Entrez votre nom de DJ et un court slogan.

source: **Genre**: List the main genres you play. This attracts search hits on stream directories. Genre must not be blank.
fr: **Genre** : Répertorier les principaux genres que vous jouez. Cela attire les résultats de recherche sur les répertoires de flux. Le genre ne doit pas être vide.

source: **Encoding**
fr: **Encodage**

source: **Bitrate**: Selecting a :term:`bitrate` of 128 or 160 :term:`kbps` is common and provides sufficient quality to your listeners. Higher bitrates will use a larger chunk in your Internet connection bandwidth to stream and for your listeners to receive the stream.
fr: **Débit** : La sélection d'un :term:`débit` de 128 ou 160 :term:`kbps` est courante et offre une qualité suffisante à vos auditeurs. Des débits plus élevés utiliseront une plus grande partie de la bande passante de votre connexion Internet pour diffuser et pour que vos auditeurs reçoivent le flux.

source: **Format**: Mixxx supports streaming to Icecast servers either in :term:`MP3` or :term:`Ogg Vorbis` format, streaming to Shoutcast servers is supported in :term:`MP3` format.
fr: **Format** : Mixxx prend en charge la diffusion vers les serveurs Icecast soit en format :term:`MP3` ou :term:`Ogg Vorbis`, la diffusion vers les serveurs Shoutcast prend en charge le format :term:`MP3`.

source: **Shoutcast metadata format**
fr: **Format des métadonnées Shoutcast**

source: This allows to set custom metatdata formats for the Shoutcast title field. Previously only ``artist - title`` was allowed. For example if you were broadcasting as part of a station, you could add the station's name or the presenter's name in the title: ``MyStation | $artist - $title``. Or if you were doing a live mix with several artists, you could have: ``Live mix by MyName - currently playing: $artist``. Or even if you wanted a very unusual format: ``Hey, I like $artist, here is $title by $artist``.
fr: Cela permet de définir des formats de métadonnées personnalisés pour le champ de titre Shoutcast. Auparavant, seul ``artiste - titre`` était autorisé. Par exemple, si vous diffusiez dans le cadre d'une station, vous pouvez ajouter le nom de la station ou le nom du présentateur dans le titre: ``MaStation | $artist - $title``. Ou si vous faite un mix live avec plusieurs artistes, vous pourriez avoir: ``Mix live par MonNom - en cours de lecture: $artist``. Ou même si vous vouliez un format très inhabituel: `` Hé, j'aime $artist, voici $title par $artist``.

source: The changes **do not** affect the case for the combination of OGG/Icecast2.
fr: Les modifications **n'affectent pas** le cas de la combinaison OGG/Icecast2.

source: **Custom metadata**
fr: **Métadonnée personnalisée**

source: By default, Mixxx broadcasts artist and title information of the files that you play to your listeners. You can disable this feature and use your own custom metadata.
fr: Par défaut, Mixxx diffuse des informations sur l'artiste et le titre des fichiers que vous jouez pour vos auditeurs. Vous pouvez désactiver cette fonctionnalité et utiliser vos propres métadonnées personnalisées.

source: **Enable custom metadata**: Toggles custom metadata on and off.
fr: **Activer les métadonnées personnalisées**: Active ou désactive les métadonnées personnalisées.

source: **Artist**: Insert your custom artist metadata here, your DJ name for example.
fr: **Artiste** : Insérez ici vos métadonnées personnalisées d'artiste, votre nom de DJ par exemple.

source: **Title**: Insert your custom title metadata here.
fr: **Titre** : insérez ici vos métadonnées de titre personnalisées.

source: Due to licensing restrictions, MP3 streaming is not enabled by default. For information on how to enable MP3 streaming, go to the chapter :ref:`MP3 streaming`.
fr: En raison de restrictions de licence, la diffusion MP3 n'est pas activé par défaut. Pour plus d'informations sur l'activation de diffusion MP3, consultez le chapitre :ref:`Streaming MP3`.

source: Both essentially serve the same purpose. An Icecast server can stream either :term:`MP3` or :term:`Ogg Vorbis`. However, although Ogg is more efficient and effective (you get higher-fidelity sound than MP3 at lower data rates) not all players can play Ogg streams. As a result MP3 is probably a safe choice unless you know your listeners can hear an Ogg stream successfully.
fr: Les deux servent essentiellement le même objectif. Un serveur Icecast peut diffuser :term:`MP3` ou :term:`Ogg Vorbis`. Cependant, bien que Ogg soit plus efficace et plus efficient (vous obtenez un son plus fidèle que le MP3 à des débits de données inférieurs), tous les lecteurs ne peuvent pas lire les flux Ogg. Par conséquent, le MP3 est probablement un choix sûr, sauf si vous savez que vos auditeurs peuvent entendre un flux Ogg avec succès.

source: Broadcast directories
fr: Répertoires de diffusion

source: Generally your streaming server host adds your radio station to the Shoutcast/Icecast directory, if you enable the :guilabel:`Public Stream` option in :menuselection:`Preferences --> Live Broadcasting --> Stream Settings`.
fr: Généralement, votre hôte de serveur de diffusion en direct ajoute votre station de radio au répertoire Shoutcast/Icecast, si vous activez l'option :guilabel:`Flux public` dans :menuselection:`Préférences --> Diffusion en direct --> Info stream`.

source: **Shoutcast radio directory**: `www.shoutcast.com <https://www.shoutcast.com/>`_
fr: **Annuaire radio Shoutcast**: `www.shoutcast.com <https://www.shoutcast.com/>`_

source: **Icecast radio directory**: `dir.xiph.org <http://dir.xiph.org/>`_
fr: **Annuaire radio Icecast** : `dir.xiph.org <http://dir.xiph.org/>`_

source: Often streaming hosts will run their own directories. Check your host's FAQ to find out. If you want to promote your streaming radio station even more, register at services like `streamfinder.com <https://www.streamfinder.com/>`_. An overview of different internet radio directories is available at `shoutcheap.com <https://www.shoutcheap.com/internet-radio-directories-submitting-and-promoting/>`_
fr: Les hôtes de diffusion exécutent souvent leurs propres répertoires. Consultez la FAQ de votre hôte pour le savoir. Si vous souhaitez promouvoir davantage votre station de radio en diffusion, inscrivez-vous sur des services comme `streamfinder.com <https://www.streamfinder.com/>`_. Un aperçu des différents répertoires de radio Internet est disponible sur `shoutcheap.com <https://www.shoutcheap.com/internet-radio-directories-submitting-and-promoting/>`_

source: Troubleshooting
fr: Dépannage

source: If you have trouble connecting to your streaming server, check the configuration in the :ref:`live-broadcasting-preferences`.
fr: Si vous ne parvenez pas à vous connecter à votre serveur de diffusion, vérifiez la configuration dans :ref:`live-broadcasting-preferences`.

source: You may need the :term:`LAME` libraries to stream in MP3. See :ref:`MP3 Streaming`.
fr: Vous aurez peut-être besoin des librairies :term:`LAME` pour diffuser en MP3. Voir :ref:`MP3 Streaming`.

source: You may have selected the :term:`Ogg Vorbis` format that is unsupported by Shoutcast servers.
fr: Vous avez peut-être sélectionné le format :term:`Ogg Vorbis` qui n'est pas pris en charge par les serveurs Shoutcast.

source: You may need to check your firewall settings. Both Icecast and Shoutcast use two ports. If you are streaming on a port (for example, port 8000) then you need to open up the next port (port 8001) as well.
fr: Vous devrez peut-être vérifier les paramètres de votre pare-feu. Icecast et Shoutcast utilisent deux ports. Si vous diffusez en continu sur un port (par exemple, le port 8000), vous devez également ouvrir le port suivant (port 8001).

source: You may need to configure port forwarding if you are behind a router or your router will block requests to your streaming port (for example, port 8000)
fr: Vous devrez peut-être configurer la redirection de port si vous êtes derrière un routeur ou bien votre routeur bloquera les demandes à votre port de diffusion (par exemple, le port 8000)

source: Activate MP3 streaming support
fr: Activer la prise en charge de diffusion MP3

source: Due to licensing restrictions, :term:`MP3` streaming is not enabled by default. In order to enable MP3 streaming you must install the :term:`LAME` MP3 :term:`codec` yourself. The following section explains how you can do that.
fr: En raison de restrictions de licence, la diffusion :term:`MP3` n'est pas activée par défaut. Pour activer la diffusion MP3, vous devez installer le :term:`codec` :term:`LAME` MP3 vous-même. La section suivante explique comment procéder.

source: If you have activated MP3 streaming support, you'll be also able to record your mixes in MP3 format. Go to the chapter :ref:`djing-recording-your-mix` for more information.
fr: Si vous avez activé la prise en charge de la diffusion MP3, vous pourrez également enregistrer vos mixages au format MP3. Allez au chapitre :ref:`djing-Recording-your-mix` pour plus d'informations.

source: Activate MP3 streaming support on Windows
fr: Activer la prise en charge de diffusion MP3 sur Windows

source: To activate MP3 streaming on Windows, follow these steps:
fr: Pour activer la diffusion MP3 sur Windows, procéder comme suit :

source: Download LAME 3.98.4 :term:`binaries` from https://www.rarewares.org/mp3-lame-libraries.php.
fr: Télécharger LAME 3.98.4 :term:`binaires` à partir de https://www.rarewares.org/mp3-lame-libraries.php.

source: The download page includes 32-bit and 64-bit versions. Make sure the version you download matches the version of Mixxx that you use, not the version of Windows. If you are on 64bit Windows but are using 32bit Mixxx, you need the 32bit (“x86”) version of the LAME binaries.
fr: La page de téléchargement comprend des versions 32 bits et 64 bits. Assurez-vous que la version que vous téléchargez correspond à la version de Mixxx que vous utilisez, pas à la version de Windows. Si vous utilisez Windows 64 bits mais utilisez Mixxx 32 bits, vous avez besoin de la version 32 bits («x86») des binaires LAME.

source: Unpack the downloaded archive. You need a utility for manipulating archives like the free `7zip <https://www.7-zip.org/>`_.
fr: Décompresser l'archive téléchargée. Vous avez besoin d'un utilitaire pour manipuler les archives comme le libre `7zip <https://www.7-zip.org/>`_.

source: Copy :file:`libmp3lame.dll` to the location you have installed Mixxx, probably :file:`C:\\Program Files\\Mixxx\\`.
fr: Copier :file:`libmp3lame.dll` dans l'emplacement où vous avez installé Mixxx, probablement :file:`C:\\Program Files\\Mixxx\\`.

source: **Only** if you are running Mixxx 1.11 or earlier, you **must** also rename :file:`libmp3lame.dll` to :file:`lame_enc.dll` in the folder where you have installed Mixxx. Select :menuselection:`Help --> About` to find out your version of Mixxx.
fr: **Uniquement** si vous exécutez Mixxx 1.11 ou une version antérieure, **vous devez** également renommer :file:`libmp3lame.dll` en :file:`lame_enc.dll` dans le dossier où vous avez installé Mixxx. Sélectionner :menuselection:`Aide --> A propos` pour connaître votre version de Mixxx.

source: Restart Mixxx
fr: Redémarrer Mixxx

source: Windows Troubleshooting
fr: Dépannage Windows

source: Double check that the version of LAME you use (“x86” = 32-bit vs. “x64” = 64-bit) matches the version of Mixxx you use.
fr: Vérifier que la version de LAME que vous utilisez («x86» = 32 bits contre «x64» = 64 bits) correspond à la version de Mixxx que vous utilisez.

source: If you are running Mixxx 1.11 or earlier, did you rename the :file:`libmp3lame.dll` to :file:`lame_enc.dll`?
fr: Si vous exécutez Mixxx 1.11 ou une version antérieure, avez-vous renommé le :file:`libmp3lame.dll` en :file:`lame_enc.dll` ?

source: Make sure you put the correct LAME :file:`*.dll` file in the same folder that contains the installation of Mixxx you are using.
fr: Assurez-vous de placer le bon fichier LAME :file:`*.dll` dans le même dossier qui contient l'installation de Mixxx que vous utilisez.

source: Some websites like `Audacity <https://www.audacityteam.org/>`_ provide lame :term:`binaries` too. Do not use these versions or Mixxx will show an error when activating live broadcasting and your stream will fail.
fr: Certains sites Web comme `Audacity <https://audacityteam.org/>`_ fournissent également des :term:`binaires` LAME. N'utilisez pas ces versions ou Mixxx affichera une erreur lors de l'activation de la diffusion en direct et votre flux échouera.

source: Activate MP3 streaming support on macOS
fr: Activer la prise en charge de la diffusion MP3 sur MacOS

source: Method A: Download
fr: Méthode A: téléchargement

source: To activate MP3 streaming on macOS, follow these steps:
fr: Pour activer la diffusion MP3 sur MacOS, procéder comme suit :
