Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/preferences.po
Languages: fr, nl

source: **Keylock/Pitch-Bending Engine**: This allows you to select the engine used for independent tempo and pitch changes (e.g. :term:`keylock`). Use :menuselection:`Soundtouch` on lower power machines (such as netbooks) or if you experience buffer underflows while using :term:`keylock`.
fr: **Moteur de Verrouillage de tonalité/Distorsion de hauteur tonale**: Cela vous permet de sélectionner le moteur utilisé pour les changements indépendants de tempo et de hauteur (par exemple :term:`verrouillage de tonalité`). Utiliser :menuselection:`Soundtouch` sur les machines de faible puissance (telles que les netbooks) ou si vous rencontrez des débordements de tampon lors de l'utilisation du :term:`verrouillage de tonalité`.
nl: **Keylock/Pitch-Bending Engine**: Hiermee kunt u de motor selecteren die wordt gebruikt voor onafhankelijke tempo- en toonhoogteveranderingen (bijv. :term:`keylock`). Gebruik :menuselection:`Soundtouch` op machines met een lager vermogen (zoals netbooks) of als u buffer underflows ondervindt bij het gebruik van :term:`keylock`.

source: **Master Mix**: You may disable the master mix to reduce Mixxx's CPU usage if you do not use the Master output, recording or live broadcasting.
fr: **Mix principal**: Vous pouvez désactiver le mix principal pour réduire l'utilisation du processeur par Mixxx, si vous n'utilisez pas la sortie principale, l'enregistrement ou la diffusion en direct.
nl: **Mastermix**: U kunt de mastermix uitschakelen om het CPU-gebruik van Mixxx te verminderen als u de Master-uitvoer, opname of live-uitzending niet gebruikt.

source: **Master Output Mode**: In Mono mode, the left and right channel are combined into a mono signal which is passed to both channels of your master audio interface. This is useful for setups where the audience cannot hear your mix in stereo because of speaker placement or playing in a space with lots of reverberation.
fr: **Mode Sortie principale**: En mode mono, les canaux gauche et droit sont combinés en un signal mono qui est transmis aux deux canaux de votre interface audio principale. Ceci est utile pour les configurations où le public ne peut pas entendre votre mixage en stéréo en raison du placement des haut-parleurs ou en jouant dans un espace avec beaucoup de réverbération.
nl: **Masteruitgangsmodus**: In de monomodus worden het linker- en rechterkanaal gecombineerd tot een monosignaal dat wordt doorgegeven aan beide kanalen van uw masteraudio-interface. Dit is handig voor opstellingen waarbij het publiek uw mix in stereo niet kan horen vanwege de plaatsing van de luidsprekers of het spelen in een ruimte met veel nagalm.

source: **Buffer Underflow Count**: Underflows (data is not available when needed) indicate that some of the subsystems in Mixxx can't keep up with real-time deadlines imposed by the current audio buffer size. This is useful to tune the latency settings. If the counter increases, then increase your audio buffer size, decrease the sample rate setting or change the sound API setting if available.
fr: **Compteur de sous-alimentation du tampon**: les débordements (les données ne sont pas disponibles lorsque nécessaire) indiquent que certains des sous-systèmes de Mixxx ne peuvent pas suivre les délais en temps réel imposés par la taille actuelle du tampon audio. Ceci est utile pour régler les paramètres de latence. Si le compteur augmente, augmenter la taille de votre tampon audio, diminuer le paramètre de fréquence d'échantillonnage ou modifier le paramètre de l'API sonore si disponible.
nl: **Buffer Underflow Count**: Underflows (gegevens zijn niet beschikbaar wanneer dat nodig is) geven aan dat sommige subsystemen in Mixxx niet kunnen voldoen aan de real-time deadlines die worden opgelegd door de huidige omvang van de audiobuffer. Dit is nuttig om de latentie-instellingen af te stemmen. Als de teller stijgt, verhoog dan de grootte van uw audiobuffer, verlaag de instelling van de samplefrequentie of verander de instelling van de geluids-API als die beschikbaar is.

source: Library
fr: Bibliothèque
nl: Bibliotheek

source: Changing music directories
fr: Changer de répertoires de musique
nl: Muziekmappen wijzigen

source: You can manually add, relink, and remove Mixxx music directories in :menuselection:`Preferences --> Library`.
fr: Vous pouvez manuellement ajouter, rediriger et retirer des répertoires musicaux de Mixxx dans :menuselection:`Préférences --> Bibliothèque`.
nl: U kunt handmatig Mixxx-muziekmappen toevoegen, herlinken en verwijderen in :menuselection:`Voorkeuren --> Bibliotheek`.

source: **Add a new music directory**
fr: **Ajouter un nouveau répertoire de musique**
nl: **Voeg een nieuwe muziekmap toe**

source: Mixxx handles multiple music library folders. Click :guilabel:`Add` to browse to a directory where your music is stored. Mixxx will watch this directory and its subdirectories for new tracks.
fr: Mixxx peut gérer plusieurs dossiers de bibliothèques musicales. Cliquer sur :guilabel:`Ajouter` pour naviguer jusqu'à un dossier dans lequel votre musique est stockée. Mixxx surveillera ce répertoire et ses sous-répertoires pour y détecter de nouveaux morceaux.
nl: Mixxx behandelt meerdere muziekbibliotheek mappen. Klik op :guilabel:`Toevoegen` om naar een map te bladeren waar uw muziek is opgeslagen. Mixxx zal deze map en zijn submappen monitoren op nieuwe tracks.

source: If you add a directory that is already in your library, or you are currently :ref:`rescanning your library <library-tracks>`, the operation is canceled.
fr: Si vous ajoutez un répertoire qui est déjà dans votre bibliothèque, ou que vous êtes en train de :ref:`réanalyser votre bibliothèque <library-tracks>`, l'opération est annulée.
nl: Als u een map toevoegt die al in uw bibliotheek aanwezig is, of mocht u :ref:`uw bibliotheek opnieuw scannen <library-tracks>` momenteel, wordt de bewerking geannuleerd.

source: Directories can also be added from the :ref:`Computer <library-computer>` sidebar item inside the library.
fr: Les répertoires peuvent aussi être ajoutés depuis l'élément :ref:`Ordinateur <library-computer>` de la barre latérale dans la bibliothèque.
nl: Mappen kunnen ook worden toegevoegd vanuit een keuzelijst in de :ref:`Computer <library-computer>` zijbalk in de bibliotheek.

source: **Relink a existing music directory**
fr: **Rattacher un répertoire musical existant**
nl: **Een bestaande muziekmap opnieuw koppelen**

source: If an existing music directory is moved, Mixxx doesn't know where to find the audio files in it. Click :guilabel:`Relink` to select the music directory in its new location. This will re-establish the links to the audio files in the Mixxx library.
fr: Si un répertoire de musique est déplacé, Mixxx ne sait plus où trouver les fichiers audio qu'il contenait. Choisissez :guilabel:`Rattacher` pour sélectionner le nouvel emplacement de votre répertoire de musique. Ceci ré-établira les liens vers les fichiers audio dans la bibliothèque de Mixxx.
nl: Als een bestaande muziekdirectory wordt verplaatst, weet Mixxx niet waar hij de audiobestanden kan vinden. Klik op :guilabel:`Opnieuw koppelen` om de muziekdirectory op de nieuwe locatie te selecteren. Hierdoor worden de links naar de audiobestanden in de Mixxx-bibliotheek hersteld.

source: **Remove a music directory**
fr: **Enlever un répertoire de musique**
nl: **Verwijder een muziekmap**

source: Click :guilabel:`Remove`, and Mixxx will no longer watch a directory and its subdirectories for new tracks, and asks what would you like to do with the tracks from these directories.
fr: Cliquer :guilabel:`Enlever` et Mixxx ne surveillera plus les nouvelles pistes dans le répertoire et ses sous-répertoires, et vous demandera ce que vous souhaitez faire des pistes contenues dans ces répertoires.
nl: Klik op :guilabel:`Verwijder`, en Mixxx kijkt niet langer naar deze map en zijn submappen voor nieuwe tracks, en vraagt wat je wilt doen met de tracks uit deze mappen.

source: Select :guilabel:`Hide Tracks` to hide all tracks from this directory and subdirectories.
fr: Sélectionner :guilabel:`Cacher les pistes` pour cacher toutes les pistes de ce répertoire et de ses sous-répertoires.
nl: Selecteer :guilabel:`Verberg Tracks` om alle tracks uit deze map en submappen te verbergen.

source: Select :guilabel:`Delete Track Metadata` to delete all metadata for these tracks from Mixxx permanently
fr: Sélectionner :guilabel:`Supprimer les métadonnées de la piste` pour supprimer définitivement de Mixxx toutes les métadonnées de ces pistes
nl: Selecteer :guilabel:`Track Metadata Wissen` om alle metadata voor deze tracks permanent uit Mixxx te verwijderen.

source: Select :guilabel:`Leave Tracks Unchanged` to leave the tracks unchanged in your library.
fr: Sélectionner :guilabel:`Ne pas Modifier les Pistes` pour laisser les pistes inchangées dans votre bibliothèque.
nl: Selecteer: guilabel: `Laat Tracks Ongewijzigd` om de tracks ongewijzigd te laten in uw bibliotheek.

source: Hiding tracks saves their metadata in case you re-add them in the future.
fr: Cacher les pistes sauvegarde leur métadonnées au cas où vous les ré-ajouteriez plus tard.
nl: Door tracks te verbergen, worden hun metadata opgeslagen voor het geval je ze in de toekomst opnieuw toevoegt.

source: Metadata means all track details (artist, title, playcount, etc.) as well as beatgrids, hotcues, and loops. This choice only affects the Mixxx library. No files on disk will be changed or deleted.
fr: Les métadonnées regroupent tous les détails de la piste (artiste, titre, nombre de lectures, etc...) ainsi que les grilles rythmiques, les repères rapides et les boucles. Ce choix n'affecte que la bibliothèque de Mixxx. Aucun fichier sur le disque ne sera modifié ou supprimé.
nl: Metagegevens betekent alle track details (artiest, titel, teller, enz.) evenals beat-roosters, hotcue-punten en lussen. Deze keuze is alleen van invloed op de Mixxx-bibliotheek. Er zullen geen bestanden op schijf worden gewijzigd of verwijderd.

source: When changing music directories, you might want to run a library rescan afterwards. Select :menuselection:`Library --> Rescan Library` in the menu.
fr: Lorsque vous modifiez les répertoires de musique, il est recommandé de réanalyser votre bibliothèque à l'issue des modifications. Sélectionnez :menuselection:`Bibliothèque --> Réanalyser la bibliothèque` dans le menu.
nl: Wanneer u muziekmappen wijzigt, aanpast of verplaatst, wil je misschien achteraf opnieuw een bibliotheek terug inscannen. Selecteer :menuselection:`Bibliotheek --> Bibliotheek opnieuw Scannen` in het menu.

source: Beat Detection
fr: Détection de battement
nl: Beat-detectie

source: Mixxx uses an ultra-precise BPM and beat detector. Manual adjustments are redundant in many cases because Mixxx knows where the beats are.
fr: Mixxx utilise un détecteur de BPM et de battements ultra précis. Les ajustements manuels sont superflus dans de nombreux cas parce que Mixxx sait où sont les battements.
nl: Mixxx maakt gebruik van een uiterst nauwkeurige BPM- en beatdetector. Handmatige aanpassingen zijn in veel gevallen overbodig omdat Mixxx weet waar de beats zitten.

source: BPM and beat detection is a complex operation. Depending on your computer and the track's bitrate and duration this may take some time. By default Mixxx analyzes the complete track. To accelerate beat detection on slower computers, a “Fast Analysis” option is available. If enabled, the BPM is computed by analyzing the first minute of the track. In most cases this does not affect the beat detection negatively because most of today's dance music is written in a 4/4 signature with a fixed tempo.
fr: La détection du BPM et des battements est une opération complexe. En fonction de votre ordinateur, du débit binaire et de la durée de la piste, cela peut prendre du temps. Par défaut, Mixxx analyse la piste entière. Pour accélérer la détection des battements sur les ordinateurs plus lents, une option “Analyse Rapide” est disponible. Si elle est activée, le BPM est calculé en analysant la première minute de la piste. Dans la plupart des cas, ceci n'affecte pas négativement la détection des battements parce que la plupart de la musique de danse d'aujourd'hui est composée dans une mesure en 4/4 avec un tempo fixe.
nl: BPM en beatdetectie is een complexe operatie. Afhankelijk van uw computer en de bitsnelheid en duur van de track kan dit enige tijd duren. Standaard analyseert Mixxx de volledige track. Om de beatdetectie op tragere computers te versnellen is een “Fast Analysis” optie beschikbaar. Indien ingeschakeld wordt de BPM berekend door de eerste minuut van de track te analyseren. In de meeste gevallen heeft dit geen negatieve invloed op de beatdetectie omdat het grootste deel van de hedendaagse dansmuziek in een 4/4 maat met een vast tempo wordt geschreven.

source: Mixxx preferences - BPM settings
fr: Préférences de Mixxx - réglages du BPM
nl: Mixxx voorkeuren - BPM instellingen

source: The table below summarizes the beat detection settings:
fr: Le tableau ci-dessous résume les réglages de la détection de battements.
nl: De onderstaande tabel vat de instellingen voor de beatdetectie samen:

source: Enable Fast Analysis
fr: Activer l'Analyse Rapide
nl: Fast Analysis inschakelen

source: If enabled, BPM will be detected by only using the first minute of audio.
fr: Si activé, le BPM sera détecté en utilisant seulement la première minute d'audio.
nl: Indien ingeschakeld, zal de BPM gedetecteerd worden door enkel gebruik te maken van de eerste minuut van de muziek.

source: Assume constant tempo
fr: Supposer un tempo constant
nl: Veronderstel constant tempo

source: If enabled, Mixxx assumes that the distances between the beats are constant. If disabled, the raw beat grid obtained by the analyzer is presented. The latter is appropriate for tracks with variable tempo.
fr: Si activé, Mixxx présume que les distances entre les battements sont constants. Si désactivé, la grille rythmique brute obtenue par l'analyseur est présentée. Ceci est approprié pour les pistes avec un tempo variable.
nl: Indien ingeschakeld, gaat Mixxx ervan uit dat de afstanden tussen de beats constant zijn. Indien uitgeschakeld, wordt het onbewerkte beatpatroon weergegeven dat door de analysator verkregen werd. Dit laatstgenoemde is geschikt voor tracks met een variabel tempo.

source: Enable Offset Correction
fr: Activer la correction du décalage
nl: Offset correctie inschakelen

source: Prevents beat markers from being placed incorrectly.
fr: Empêche les marqueurs de battements d'être placés de façon incorrecte.
nl: Voorkomt dat beatmarkeringen verkeerd geplaatst worden.

source: Re-analyze beats when settings change or beat detection data is outdated
fr: Re-analyser le rythme lors de changements de réglages ou quand les informations de détection rythmique sont anciennes
nl: Analyseer beats opnieuw wanneer instellingen veranderen of informatie van de beat-detectie verouderd is

source: If enabled, Mixxx over-writes old beat grids from prior versions. Moreover, it will re-analyze the BPM if your beat detection preferences change or BPM data from 3rd party programs are present.
fr: Si activé, Mixxx écrase les anciennes grilles rythmiques des versions antérieures. De plus, ceci ré-analysera le tempo si vos préférences de détection de battements ont changé ou si des données de tempo d'un programme tiers sont présentes.
nl: Indien ingeschakeld, dan zal Mixxx oude beatrasters van eerdere versies overschrijven. Bovendien zal het de BPM opnieuw analyseren als uw voorkeuren voor beatdetectie gewijzigd zijn of als er BPM-data uit programma's van derden aanwezig zijn.

source: Correcting Beat Grids
fr: Corriger les grilles rythmiques
nl: Beat Grids corrigeren

source: There may be situations where BPM and beat detection do not result in a proper beat grid.
fr: Il peut y avoir des situations dans lesquelles la détection de tempo et de battements n'aboutissent pas à une grille rythmique correcte.
nl: Er kunnen zich situaties voordoen waarin BPM en beatdetectie niet resulteren in een goed beatpatroon.

source: Typically, the detected BPM is correct but the analyzer has failed to detect the location of the first beat. Consequently, the beat markers are shifted, i.e. the beat markers are a fixed distance from the true beat. To adjust the beat grid, cue the track before a real beat and click the :guilabel:`Beat-grid Adjust` button in the :ref:`interface-button-grid`.
fr: Typiquement, le BPM détecté est correct, mais l'analyseur a échoué à détecter l'emplacement du premier battement. Par conséquent, les marqueurs de battements sont déplacés, c'est-à-dire que les marqueurs de battements sont à une distance fixe du vrai battement. Pour ajuster la grille rythmique, mettre un repère sur un vrai battement et cliquer sur le bouton :guilabel:`Ajuster la grille rythmique` dans la :ref:`interface-button-grid`.
nl: Meestal is de gedetecteerde BPM correct, maar de analysator heeft de locatie van de eerste beat niet gedetecteerd. Als gevolg hiervan worden de beat-markers verschoven, d.w.z. dat de beat-markers op een vaste afstand liggen van de echte beat. Om het beatraster aan te passen, zet de track met een cue vast vóór een echte beat en klik op de knop :guilabel:`Beat-grid Aanpassen` in de :ref:`interface-knop-grid`.

source: If the detected BPM is not accurate, the corresponding beat grid will also be inaccurate. A deviation of 0.02 BPM units from the correct BPM will cause beatgrid alignment issues on long tracks (e.g. a club mix). If this happens, your beatgrid may look aligned for the few minutes but you will notice a slight drift as the song goes on. Finding the correct BPM is easy in many cases - just follow the note below.
fr: Si le BPM détecté n'est pas précis, la grille rythmique correspondante sera aussi imprécise. Une déviation de 0.02 unités de BPM par rapport au BPM correct va causer des problèmes d'alignement de la grille rythmique sur les longues pistes (un mix club par exemple). Si ceci arrive, votre grille rythmique peut paraître alignée pendant les premières minutes mais vous remarquerez un léger décalage à mesure que la chanson avance. Trouver le BPM correct est facile dans beaucoup de cas - suivre simplement la remarque ci-dessous.
nl: Als de gedetecteerde BPM niet nauwkeurig is, zal het bijbehorende beatraster ook niet nauwkeurig zijn. Een afwijking van 0,02 BPM van de correcte BPM zal op lange tracks (bijv. een clubmix) problemen veroorzaken met de uitlijning van het beatraster. Als dit gebeurt, zal je beatraster er voor een paar minuten uitgelijnd uitzien, maar je zult een lichte afwijking opmerken naarmate het nummer verder gaat. Het vinden van de juiste BPM is in veel gevallen eenvoudig - volg gewoon de notitie hieronder.

source: If the detected BPM value is not sufficiently accurate but very close to an integer value, try to set the BPM value manually to the integer.
fr: Si la valeur détectée du BPM n'est pas assez précise mais très proche d'une valeur entière, essayer de régler manuellement le BPM sur cette valeur entière.
nl: Als de gedetecteerde BPM-waarde niet nauwkeurig genoeg is, maar zeer dicht bij een geheel getal ligt, probeer dan de BPM-waarde handmatig in te stellen op het geheel getal.

source: Key Detection
fr: Détection de tonalité
nl: Toonaard detectie

source: Mixxx comes with a high precision musical key detector to help you make smooth mixes by ensuring that your tracks are musically compatible.
fr: Mixxx est livré avec un détecteur de tonaité musicale de haute précision pour vous aider à faire des mixages fluides en vous assurant que vos pistes sont musicalement compatibles.
nl: Mixxx wordt geleverd met een zeer nauwkeurige muzikale toonaard detector om u te helpen soepele mixen te maken, door ervoor te zorgen dat uw nummers muzikaal compatibel zijn.

source: Analyzer Settings
fr: Paramètres de l'analyseur
nl: Instellingen analysemodule

source: Key detection is a complex operation. Depending on your computer and the track's bitrate and duration this may take some time. By default Mixxx analyzes the complete track. To accelerate key detection on slower computers, a “Fast Analysis” option is available. If enabled, the key is computed by analyzing the first minute of the track.
fr: La détection de tonalité est une opération complexe. En fonction de votre ordinateur et du débit binaire de la piste et de sa durée, cela peut prendre du temps. Par défaut, Mixxx analyse la piste entière. Pour accélérer la détection de tonalité sur les ordinateurs plus lents, une option “Analyse Rapide” est disponible. Si elle est activée, la tonalité est calculée en analysant la première minute de la piste.
nl: Toonaard detectie is een complexe operatie. Afhankelijk van uw computer en de bitrate en duur van de track kan dit enige tijd in beslag nemen. Standaard analyseert Mixxx het volledige nummer. Om toonaard detectie op langzamere computers te versnellen, is er een optie “Snelle analyse” beschikbaar. Indien ingeschakeld, wordt de toonaard berekend door de eerste minuut van de track te analyseren.

source: Mixxx preferences - Key settings
fr: Préférences de Mixxx - Réglages de détection de tonalité
nl: Mixxx voorkeuren - Toonaard instellingen

source: The table below summarizes the Key detection settings:
fr: Le tableau ci-dessous résume les réglages de détection de tonalité :
nl: De onderstaande tabel vat de instellingen voor toonaard detectie samen:

source: If enabled, the key will be detected by using only the first minute of audio.
fr: Si activé, la tonalité sera détectée en utilisant seulement la première minute d'audio.
nl: Indien ingeschakeld, zal de toonaard worden gedetecteerd door alleen de eerste minuut van de muziek te gebruiken.

source: Re-analyze key when settings change or Key detection data is outdated
fr: Ré-analyser la tonalité quand les réglages changent ou quand les données de détection de tonalité ne sont plus à jour
nl: Analyseer de toonaard opnieuw wanneer de instellingen veranderen of de gegevens van de toonaard detectie verouderd zijn

source: If enabled, Mixxx will re-analyse tracks if you select a different key detection plugin or the key was generated by a program other than Mixxx.
fr: Si activé, Mixxx ré-analysera les pistes si vous choisissez un greffon de détection de tonalité différent ou si la tonalité a été générée par un autre programme que Mixxx.
nl: Indien ingeschakeld, zal Mixxx tracks opnieuw analyseren als u een andere toonaard detectie-plugin selecteert of als de toonaard is gegenereerd door een ander programma dan Mixxx.

source: Key Notation
fr: Notation de la tonalité
nl: Toonaardnotatie

source: Change the way keys are displayed in the library.
fr: Change la façon dont la tonalité est affichée dans la bibliothèque.
nl: Wijzig de manier waarop de toonaarden in de bibliotheek worden weergegeven.

source: Equalizers
fr: Égaliseurs
nl: Toonregelingen

source: Equalizer Preferences
fr: Préférences d'égaliseur
nl: Voorkeuren toonregeling

source: :menuselection:`Preferences --> Equalizer` allows you to setup the equalizers.
fr: :menuselection:`Préférences --> Égaliseurs` vous permet de configurer les égaliseurs.
nl: :menuselectie:`Voorkeuren --> Equalizer` laat u toe de equalizers in te stellen.

source: **Equalizer Rack**: The Equalizer Rack is a special effect rack that is connected to the deck's equalizer and filter controls.
fr: **Rack d'égalisation** : Le rack d'égalisation est un rack d'effets spéciaux qui est connecté aux commandes d'égalisation et de filtre de la platine.
nl: **Equalizer Rack**: Het Equalizer Rack is een speciaal effect-rack dat is aangesloten op de equalizer- en filterregelaars van het deck.
