Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/preferences.po
Languages: fr, nl

source: Preferences
fr: Préférences
nl: Voorkeuren

source: Mixxx has many options to customize in :menuselection:`Options --> Preferences`.
fr: Mixxx a de nombreuses options à personnaliser dans :menuselection:`Options --> Préférences`.
nl: Mixxx heeft vele opties om aan te passen in :menuselection:`Opties --> Voorkeuren`.

source: Sound Hardware
fr: Matériel sonore
nl: Geluidsapparatuur

source: Mixxx Sound Hardware Preferences
fr: Préférences du matériel sonore de Mixxx
nl: Voorkeuren Mixxx Geluidsapparatuur

source: To achieve the best performance with Mixxx it is essential to configure your *audio buffer*, *sample rate*, and *audio API*. These three factors largely determine Mixxx's responsiveness and reliability. The optimal settings will vary based on your computer and hardware quality.
fr: Pour obtenir les meilleures performances avec Mixxx, il est essentiel de configurer vos *tampon audio*, *taux d’échantillonnage* et *pilote audio*. Ces trois facteurs déterminent pour une grande partie la réactivité et la fiabilité de Mixxx. Les réglages optimaux varieront selon votre ordinateur et la qualité du matériel.
nl: Om de beste prestaties te bereiken met Mixxx, is het essentieel om uw *audiobuffer*, *samplefrequentie* en *audio-API* te configureren. Deze drie factoren bepalen grotendeels het reactievermogen en de betrouwbaarheid van Mixxx. De optimale instellingen zijn afhankelijk van uw computer- en hardwarekwaliteit.

source: For information about the different input and output options, refer to :ref:`getting-started-sound-io`. The :ref:`hardware` chapter explains different types of DJ hardware and how to set them up with the input and output options. If you are using a microphone, refer to the :ref:`microphones` chapter.
fr: Pour plus d'informations sur les différentes options d'entrée et de sortie, reportez-vous à :ref:`getting-started-sound-io`. Le chapitre :ref:`hardware` explique les différents types de matériel DJ et comment les configurer avec les options d'entrée et de sortie. Si vous utilisez un microphone, reportez-vous au chapitre :ref:`microphones`.
nl: Voor informatie over de verschillende in- en uitvoeropties, zie :ref:`getting-started-sound-io`. In het hoofdstuk :ref:`hardware` worden verschillende soorten DJ-hardware uitgelegd en hoe deze kunnen worden ingesteld met de in- en uitvoeropties. Indien u een microfoon gebruikt, raadpleeg dan het hoofdstuk :ref:`microfoons`.

source: Audio Buffer
fr: Tampon audio
nl: Geluidsbuffer

source: The audio buffer is the amount of audio in milliseconds that Mixxx processes at a time. This is a major factor that determines the latency between changing controls in Mixxx such as moving the crossfader or pressing the play button and hearing the audio change. For example, with an audio buffer of 23 ms, it will take approximately 23 milliseconds for Mixxx to stop the audio after you toggle the play button. The actual latency will be longer depending on a variety of factors.
fr: Le tampon audio est la quantité d'audio en millisecondes que Mixxx traite à la fois. Il s'agit d'un facteur majeur qui détermine la latence entre le changement de commandes dans Mixxx, comme le déplacement du curseur de mixage ou l'appui sur le bouton de lecture, et l'écoute du changement audio. Par exemple, avec un tampon audio de 23 ms, il faudra environ 23 millisecondes à Mixxx pour arrêter l'audio après avoir basculé le bouton de lecture. La latence réelle sera plus longue en fonction de divers facteurs.
nl: De audiobuffer is de hoeveelheid audio in milliseconden die Mixxx tegelijkertijd verwerkt. Dit is een belangrijke factor die de latentie bepaalt tussen het wijzigen van bedieningselementen in Mixxx, zoals het verplaatsen van de crossfader of het indrukken van de afspeelknop en het horen van de audiowijziging. Met een audiobuffer van 23 ms duurt het bijvoorbeeld ongeveer 23 milliseconden voordat Mixxx de audio stopt nadat je op de afspeelknop hebt gedrukt. De feitelijke latentie zal langer zijn, afhankelijk van verschillende factoren.

source: The audio buffer setting determines how quickly your :term:`Operating System` expects Mixxx to react. A smaller audio buffer means Mixxx will be more responsive, but requires a faster CPU and quality audio interface. Setting your audio buffer too small may be too much for your computer and audio interface to handle. In this situation, Mixxx playback will be choppy and very clearly distorted as your system will not be able to keep up with how frequently Mixxx is trying to process audio. It is recommended to set your audio buffer as small as your system can handle reliably without glitches. Experiment with different audio buffer sizes to find what works for your system.
fr: Le réglage du tampon audio détermine la vitesse à laquelle votre :term:`système d’exploitation` s'attend à ce que Mixxx réagisse. Un tampon audio plus petit signifie que Mixxx sera plus réactif, mais nécessite un processeur plus rapide et une interface audio de qualité. La définition d'un tampon audio très petit peut être trop difficile à gérer pour votre ordinateur et votre interface audio. Dans cette situation, la lecture de Mixxx sera saccadée et très clairement déformée car votre système ne pourra pas suivre la fréquence à laquelle Mixxx essaie de traiter l'audio. Il est recommandé de régler votre tampon audio aussi petit que votre système peut le gérer de manière fiable sans problèmes. Expérimenter avec différentes tailles de mémoire tampon audio pour trouver ce qui fonctionne pour votre système.
nl: De instelling van de audiobuffer bepaalt hoe snel uw :term:`Besturingssysteem` verwacht dat Mixxx reageert. Een kleinere audiobuffer betekent dat Mixxx sneller zal reageren, maar vereist een snellere CPU en een kwalitatief hoogstaande audio-interface. Uw audiobuffer te klein instellen kan te zwaar zijn voor uw computer en audio-interface. In deze situatie zal het afspelen van Mixxx ruw en zeer duidelijk vervormd zijn, omdat uw systeem niet in staat zal zijn om bij te houden hoe vaak Mixxx probeert om audio te verwerken. Het is aan te raden om uw audiobuffer zo klein als mogelijk in te stellen zolang uw systeem de verwerking betrouwbaar kan uitvoeren zonder storingen. Experimenteer met verschillende audiobuffergroottes om uit te zoeken wat werkt voor uw systeem.

source: An audio buffer between 23-64 ms is acceptable if you are using Mixxx with a keyboard/mouse or a controller. An audio buffer below 10 ms is recommended when vinyl control is used because Mixxx will feel unresponsive otherwise.
fr: Un tampon audio compris entre 23 et 64 ms est acceptable si vous utilisez Mixxx avec un clavier/souris ou un contrôleur. Un tampon audio inférieur à 10 ms est recommandé lorsque le contrôle vinyle est utilisé car autrement Mixxx donnera l'impression de ne pas répondra.
nl: Een audiobuffer tussen 23-64 ms is acceptabel als je Mixxx gebruikt met een toetsenbord/muis of een controller. Een audiobuffer van minder dan 10 ms wordt aanbevolen wanneer vinylbesturing wordt gebruikt, omdat Mixxx anders niet reageert.

source: The `Adjusting Audio Latency <https://mixxx.org/wiki/doku.php/adjusting_audio_latency>`_ page on the Mixxx Wiki has tips for different operating systems that may help you use a smaller audio buffer reliably.
fr: La page `Adjusting Audio Latency <https://mixxx.org/wiki/doku.php/adjusting_audio_latency>`_ sur le wiki de Mixxx contient des conseils pour différents systèmes d'exploitation qui peuvent vous aider à utiliser un tampon audio plus petit de manière fiable.
nl: De `Adjusting Audio Latency <https://mixxx.org/wiki/doku.php/adjusting_audio_latency>`_ pagina op de Mixxx Wiki heeft tips voor verschillende besturingssystemen, die je kunnen helpen om een kleinere audiobuffer betrouwbaar te gebruiken.

source: Your system may glitch only occasionally if you have your audio buffer set a little too low. This will happen at unpredictable times and you may not notice if you are only doing brief tests of each audio buffer size. When you think you have found a good buffer size for your system, play with Mixxx for at least a half hour before performing to ensure no glitches happen.
fr: Il est possible que votre système ne bug qu'occasionnellement si votre tampon audio est réglé un peu trop bas. Cela se produira à des moments imprévisibles et vous ne le remarquerez peut-être pas si vous ne faites que de brefs tests de chaque taille de tampon audio. Lorsque vous pensez avoir trouvé une bonne taille de mémoire tampon pour votre système, utiliser Mixxx pendant au moins une demi-heure avant une prestation réelle pour vous assurer qu'aucun problème ne se produit.
nl: Uw systeem kan af en toe een storing vertonen als uw audiobuffer een beetje te laag is ingesteld. Dit gebeurt op onvoorspelbare tijden en je merkt er misschien niets van als je slechts korte tests van elke audiobuffergrootte uitvoert. Als je denkt dat je een goede buffergrootte voor je systeem hebt gevonden, speel dan minstens een half uur met Mixxx voordat je gaat optreden om er zeker van te zijn dat er geen problemen of storingen optreden.

source: Sample Rate
fr: Taux d'échantillonnage
nl: Samplefrequentie

source: The sample rate setting in Mixxx controls how many samples (chunks of audio) per second are produced by Mixxx. This determines the maximum frequency in Mixxx's signal, which is half the sample rate. Humans can only hear up to 20 kHz, so there is generally no need to use more than a 44.1 kHz (44100 Hz) sample rate for playback. Most music is published with a 44100 Hz sample rate, and playing music in a different sample rate than the audio file slightly reduces sound quality.
fr: Le réglage de la fréquence d'échantillonnage dans Mixxx contrôle le nombre d'échantillons (morceaux audio) par seconde produits par Mixxx. Cela détermine la fréquence maximale du signal de Mixxx, qui est la moitié de la fréquence d'échantillonnage. Les humains ne peuvent entendre que jusqu'à 20 kHz, il n'est donc généralement pas nécessaire d'utiliser plus d'une fréquence d'échantillonnage de 44,1 kHz (44100 Hz) pour la lecture. La plupart de la musique est publiée avec une fréquence d'échantillonnage de 44100 Hz, et la lecture de musique avec une fréquence d'échantillonnage différente de celle du fichier audio réduit légèrement la qualité sonore.
nl: De instelling voor samplefrequentie in Mixxx bepaalt hoeveel samples (stukjes audio) per seconde door Mixxx worden geproduceerd. Dit bepaalt de maximale frequentie in het signaal van Mixxx, hetgeen de helft van de samplefrequentie is. Mensen kunnen slechts tot 20 kHz horen, dus is het in het algemeen niet nodig om een samplefrequentie van meer dan 44,1 kHz (44100 Hz) te gebruiken voor weergave. De meeste muziek wordt gepubliceerd met een samplefrequentie van 44100 Hz en het afspelen van muziek in een andere samplefrequentie dan het audiobestand vermindert de geluidskwaliteit enigszins.

source: A sample rate of 96 kHz gives your computer less than half the time to as to do the same processing. Increasing the sample rate will increase CPU usage and likely raise the minimum audio buffer size you can use reliably.
fr: Un taux d'échantillonnage de 96 kHz donne à votre ordinateur moins de la moitié du temps pour effectuer le même traitement. L'augmentation de la fréquence d'échantillonnage augmentera l'utilisation du processeur et augmentera probablement la taille minimale du tampon audio que vous pouvez utiliser de manière fiable.
nl: Een samplefrequentie van 96 kHz geeft uw computer minder dan de helft van de tijd om dezelfde verwerking uit te voeren. Het verhogen van de samplefrequentie verhoogt het CPU-gebruik en verhoogt waarschijnlijk de minimale audiobuffergrootte die je betrouwbaar kunt gebruiken.

source: Sound API
fr: API sonore
nl: Geluid API

source: The Sound :term:`API` that Mixxx uses is the method by which Mixxx talks to your :term:`Operating System` in order to deliver audio to your audio interface. Your choice of Sound API can drastically affect Mixxx's performance on your computer. **Therefore it is important to take care to choose the best Sound API available to you.**
fr: L':term:`API` sonore que Mixxx utilise est la méthode par laquelle Mixxx communique avec votre :term:`système d'exploitation` afin de fournir de l'audio à votre interface audio. Votre choix de API sonore peut considérablement affecter les performances de Mixxx sur votre ordinateur. **Il est donc important de prendre soin de choisir la meilleure API sonore à votre disposition.**
nl: De Sound: term: `API` die Mixxx gebruikt, is de methode waarmee Mixxx met uw: term:` Operating Systeem` praat om audio naar uw audio-interface te sturen. Uw keuze voor Sound API kan de prestaties van Mixxx op uw computer drastisch beïnvloeden. **Daarom is het belangrijk om ervoor te zorgen dat u de beste Sound API kiest die voor u beschikbaar is.**

source: The following Sound APIs are available on Windows:
fr: Les API sonore suivantes sont disponibles sur Windows:
nl: De volgende Sound API's zijn beschikbaar op Windows:

source: **ASIO**: Good
fr: **ASIO**: Bon
nl: **ASIO**: Goed

source: **WDM-KS**: Good
fr: **WDM-KS**: Bon
nl: **WDM-KS**: Goed

source: **DirectSound**: Poor
fr: **DirectSound**: Mauvais
nl: **DirectSound**: Slecht

source: **MME**: Poor
fr: **MME**: Mauvais
nl: **MME**: Slecht

source: It is best to use the ASIO Sound API that bypassses the sound processing of the Windows kernel. Using ASIO requires a driver for your audio interface from the manufacturer. Check the manufacturer's website to see if a driver download is available. Soundcards designed for musicians almost always have an ASIO driver available, but audio interfaces built into computers and very cheap audio interfaces typically do not have an ASIO driver. If there is no ASIO driver available for your audio interface, use the WDM-KS API. There is generally no advantage to using `ASIO4ALL <http://www.asio4all.org>`_, a wrapper around the WDM-KS API.
fr: Il est préférable d'utiliser la API sonore ASIO qui contourne le traitement du son par le noyau Windows. L'utilisation d'ASIO nécessite un pilote pour votre interface audio en provenance du fabricant. Consulter le site Web du fabricant pour voir si un téléchargement de pilote est disponible. Les cartes son conçues pour les musiciens ont presque toujours un pilote ASIO disponible, mais les interfaces audio intégrées aux ordinateurs et les interfaces audio très bon marché n'ont généralement pas de pilote ASIO. Si aucun pilote ASIO n'est disponible pour votre interface audio, utilisez l'API WDM-KS. Il n'y a généralement aucun avantage à utiliser `ASIO4ALL <http://www.asio4all.org>`_, un emballage autour de l'API WDM-KS.
nl: Het is beter om de ASIO Sound API te gebruiken die de geluidsverwerking van de Windows-kernel omzeilt. Voor het gebruik van ASIO is een stuurprogramma voor uw audio-interface van de fabrikant vereist. Controleer de website van de fabrikant om te zien of er een download van het stuurprogramma beschikbaar is. Geluidskaarten ontworpen voor muzikanten hebben bijna altijd een ASIO-stuurprogramma beschikbaar, maar audio-interfaces ingebouwd in computers en zeer goedkope audio-interfaces hebben meestal geen ASIO-stuurprogramma. Als er geen ASIO-stuurprogramma beschikbaar is voor uw audio-interface, gebruik dan de WDM-KS API. Het gebruik van `ASIO4ALL <http://www.asio4all.org>`_, een wrapper rond de WDM-KS API heeft over het algemeen geen voordelen.

source: The following Sound APIs are available on GNU/Linux:
fr: Les API sonore suivantes sont disponibles sur GNU/Linux:
nl: De volgende Sound API's zijn beschikbaar op GNU/Linux:

source: **ALSA**: Good
fr: **ALSA**: Bon
nl: **ALSA**: Goed

source: **JACK**: Good
fr: **JACK**: Bon
nl: **JACK**: Goed

source: ALSA is the simplest sound API to configure. Using ALSA will prevent any other programs from using the audio interface(s) that Mixxx is using.
fr: ALSA est l'API sonore la plus simple à configurer. L'utilisation d'ALSA empêchera tout autre programme d'utiliser les interfaces audio utilisées par Mixxx.
nl: ALSA is de eenvoudigste geluids-API om te configureren. Als u ALSA gebruikt, voorkomt u dat andere programma's de audio-interface (s) gebruiken die Mixxx gebruikt.

source: JACK allows you to route audio between JACK-compatible applications in flexible ways and output sound from multiple programs at the same time. However, JACK can be complicated to set up. Unless you will be connecting Mixxx to other JACK-compatible applications, JACK offers no advantages over ALSA. To use JACK, start the JACK daemon *before* running Mixxx. Otherwise JACK will not appear as a Sound API in the preferences.
fr: JACK vous permet d'acheminer l'audio entre des applications compatibles JACK de manière flexible et de diffuser le son de plusieurs programmes en même temps. Cependant, JACK peut être compliqué à configurer. À moins que vous ne connectiez Mixxx à d'autres applications compatibles JACK, JACK n'offre aucun avantage par rapport à ALSA. Pour utiliser JACK, démarrer le démon JACK *avant* d'exécuter Mixxx. Sinon, JACK n'apparaîtra pas comme une API sonore dans les préférences.
nl: Met JACK kunt u audio op flexibele wijze tussen JACK-compatibele toepassingen routeren en tegelijkertijd geluid van meerdere programma's uitvoeren. JACK kan echter ingewikkeld zijn om in te stellen. Tenzij je Mixxx gaat verbinden met andere JACK-compatibele applicaties, biedt JACK geen voordelen ten opzichte van ALSA. Om JACK te gebruiken, start u de JACK-daemon *voordat* Mixxx draait. Anders verschijnt JACK niet als Sound API in de voorkeuren.

source: Most modern GNU/Linux distributions use PulseAudio by default. When launched from a GUI menu entry or icon, Mixxx suspends PulseAudio while it is running so that Mixxx can use ALSA directly. Like JACK, PulseAudio allows multiple programs to access one audio interface, but PulseAudio and JACK have opposite design goals. PulseAudio is designed to make ordinary computer usage such as watching videos online and listening to music easy whereas JACK is designed for demanding low latency audio programs like Mixxx. It can be difficult to setup JACK and PulseAudio to work well together. So, unless you already use JACK, it is easiest to let Mixxx suspend PulseAudio and use ALSA.
fr: La plupart des distributions GNU / Linux modernes utilisent PulseAudio par défaut. Lorsqu'il est lancé à partir d'une entrée de menu ou d'un icône de l'interface graphique, Mixxx suspend PulseAudio pendant son exécution afin que Mixxx puisse utiliser ALSA directement. Comme JACK, PulseAudio permet à plusieurs programmes d'accéder à une seule interface audio, mais PulseAudio et JACK ont des objectifs de conception opposés. PulseAudio est conçu pour faciliter l'utilisation d'un ordinateur ordinaire, comme regarder des vidéos en ligne et écouter de la musique, tandis que JACK est conçu pour les programmes audio exigeants à faible latence comme Mixxx. Il peut être difficile de configurer JACK et PulseAudio pour bien fonctionner ensemble. Donc, à moins que vous n'utilisiez déjà JACK, il est plus facile de laisser Mixxx suspendre PulseAudio et utiliser ALSA.
nl: De meeste moderne GNU/Linux-distributies gebruiken standaard PulseAudio. Wanneer deze wordt gestart vanuit een GUI-menu of -pictogram, schorst Mixxx PulseAudio terwijl deze actief is, zodat Mixxx direct gebruik kan maken van ALSA. Net als JACK geeft PulseAudio meerdere programma's toegang tot één audio-interface, maar PulseAudio en JACK hebben tegengestelde ontwerpdoelen. PulseAudio is ontworpen om gewoon computergebruik, zoals het online bekijken van video's en het luisteren naar muziek, eenvoudig te maken, terwijl JACK is ontworpen voor veeleisende audioprogramma's met een lage latentie, zoals Mixxx. Het kan moeilijk zijn om JACK en PulseAudio zo in te stellen dat ze goed samenwerken. Dus, tenzij u JACK al gebruikt, is het het eenvoudigst om Mixxx PulseAudio te laten onderbreken en ALSA te laten gebruiken.

source: If the PulseAudio plugin for alsalibs is installed on GNU/Linux, you can choose the virtual device ``pulse``. This allows Mixxx to share the default system audio interface with other media players. This only works if you start Mixxx without pasuspender, which you can do by running :command:`mixxx` from a console rather than clicking the launcher icon in a menu or on your desktop. Since the sound stream is routed from ALSA to Pulse and back to ALSA, this adds an additional latency of ~2 x the selected audio buffer size.
fr: Si le plugin PulseAudio pour alsalibs est installé sur GNU/Linux, vous pouvez choisir le périphérique virtuel ``pulse``. Cela permet à Mixxx de partager l'interface audio par défaut du système avec d'autres lecteurs multimédias. Cela ne fonctionne que si vous démarrez Mixxx sans ``pasuspender``, ce que vous pouvez faire en exécutant :command:`mixxx` à partir d'une console plutôt que de cliquer sur l'icône du lanceur dans un menu ou sur votre bureau. Étant donné que le flux sonore est acheminé d'ALSA vers Pulse et retourné vers ALSA, cela ajoute une latence supplémentaire de ~2 x la taille de tampon audio sélectionnée.
nl: Als de PulseAudio plugin voor alsalibs is geïnstalleerd op GNU/Linux, kunt u kiezen voor het virtuele apparaat ``pulse``. Hierdoor kan Mixxx de standaard systeemaudio-interface delen met andere mediaspelers. Dit werkt alleen als u Mixxx start zonder pasuspender, wat u kunt doen door :command:`mixxx` uit te voeren vanaf een console in plaats van te klikken op het launcher-icoontje in een menu of op uw bureaublad. Aangezien de geluidsstroom wordt gerouteerd van ALSA naar Pulse en terug naar ALSA, voegt dit een extra latentie van ~2 x de geselecteerde audiobuffergrootte toe.

source: OSS is an Sound API that predates ALSA. Few modern audio interfaces have OSS drivers.
fr: OSS est une API sonore antérieure à ALSA. Peu d'interfaces audio modernes ont des pilotes OSS.
nl: OSS is een Sound API die dateert van vóór ALSA. Weinig moderne audio-interfaces hebben OSS-stuurprogramma's.

source: CoreAudio is the only Sound API on macOS.
fr: CoreAudio est la seul API sonore sur macOS.
nl: CoreAudio is de enige Sound API op macOS.

source: Other Sound Hardware options
fr: Autres options de matériel audio
nl: Andere opties voor geluidshardware

source: **Multi-Soundcard Synchronization**: Mixxx is able to use two or more :term:`audio interfaces` at a time, each with its own clock. When multiple audio interfaces are in use, the Mixxx engine is driven by the Master audio interface. Here you can select the synchronization used for the other audio interfaces to avoid buffer overflows or underflows.
fr: **Synchronisation de plusieurs cartes son**: Mixxx est capable d'utiliser deux ou plusieurs :term:`interfaces audio` à la fois, chacune avec sa propre horloge. Lorsque plusieurs interfaces audio sont utilisées, le moteur de Mixxx est piloté par l'interface audio principale. Ici, vous pouvez sélectionner la synchronisation utilisée pour les autres interfaces audio pour éviter les débordements ou sous-alimentation de tampon.
nl: **Multi-Soundcard Synchronisatie**: Mixxx kan twee of meer :term:`audio interfaces` tegelijk gebruiken, elk met een eigen klok. Wanneer er meerdere audio-interfaces in gebruik zijn, wordt de Mixxx-engine aangedreven door de Master-audio-interface. Hier kunt u de synchronisatie selecteren die wordt gebruikt voor de andere audio-interfaces om buffer overflows of underflows te voorkomen.
