Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/chapters/preferences.po
Languages: fr, nl

source: In this section you can select the equalizers and quick effects that are used with the decks.
fr: Dans cette section, vous pouvez sélectionner les égaliseurs et les effets rapides utilisés avec les platines.
nl: In deze sectie kunt u de equalizers en quick effects selecteren die met de decks worden gebruikt.

source: **Equalizer Plugin**: Here you can select the effect that is used as the mixing EQ in each deck. By default only built-in equalizers are displayed. Unchecking :menuselection:`Only allow EQ knobs to control EQ specific effects` allows you to select any other effect.
fr: **Greffon d'égalisation** : Ici, vous pouvez sélectionner l'effet utilisé comme égaliseur de mixage dans chaque platine. Par défaut, seuls les égaliseurs intégrés sont affichés. Décocher :menuselection:`N'autorise les boutons d'EQ qu'à modifier les contrôles spécifiques à l'EQ` vous permet de sélectionner tout autre effet.
nl: **Equalizer-plug-in**: hier kunt u het effect selecteren dat wordt gebruikt als de mixing-EQ in elk deck. Standaard worden alleen ingebouwde equalizers weergegeven. Het uitvinken van :menuselection: `Sta alleen EQ-knoppen toe om EQ-specifieke effecten te besturen` geeft de mogelijkheid om elk ander effect te kunnen selecteren.

source: **Quick Effect**: Here you can select the effect that is controlled by the dedicated filter knob in each deck. By default only built-in filter effects are selected for all decks, but that can be changed as above.
fr: **Effets rapides** : Ici, vous pouvez sélectionner l'effet contrôlé par le potentiomètre de filtre dédié dans chaque platine. Par défaut, seuls les effets de filtre intégrés sont sélectionnés pour toutes les platines, mais cela peut être modifié comme ci-dessus.
nl: **Quick Effect**: Hier kunt u het effect selecteren dat wordt geregeld door de toegewezen filterknop in elk deck. Standaard zijn alleen ingebouwde filtereffecten geselecteerd voor alle decks, maar dat kan aangepast worden zoals hierboven beschreven.

source: **High/Low Shelf EQ**: This slider sets the crossover frequencies of the mixing EQ. It controls which frequency range is affected by the low, mid, and high channel EQ knobs. By default the low knob controls the bass and sub bass range up to 246 Hz. The mid knob controls the mid range up to 2.5 kHz. The remaining treble range is controlled by the high knob.
fr: **EQ à plateaux pour les Aiguës/Graves** : Ce curseur définit les fréquences de transition de l'égaliseur de mixage. Il contrôle la plage de fréquences affectée par les potentiomètres d'égalisation des canaux bas, moyens et hauts. Par défaut, le potentiomètre bas contrôle la plage des basses et extrêmes basses jusqu'à 246 Hz. Le potentiomètre central contrôle la plage médiane jusqu'à 2,5 kHz. La gamme d'aigus restante est contrôlée par le potentiomètre haut.
nl: **High/Low Shelf EQ**: Deze schuifregelaar stelt de crossover-frequenties van de mixing EQ in. Hij regelt welk frequentiebereik wordt beïnvloed door de EQ-knoppen voor het lage, het midden en het hoge kanaal. Standaard regelt de lagetonen knop het bas- en sub-basbereik tot 246 Hz. De middentonen knop regelt het middenbereik tot 2,5 kHz. Het resterende hogetonen-bereik wordt geregeld door de hoge knop.

source: **Master EQ**: This section allows you to setup an EQ that affects the master output.
fr: **EQ Principale** : cette section vous permet de configurer un égaliseur qui affecte la sortie principale.
nl: **Master EQ**: Deze sectie laat u toe om een EQ instellen die van invloed is op de masteruitgang.

source: Mixing Equalizers
fr: Égaliseurs de mixage

source: Mixxx offers three types of mixing equalizers with a full kill option. These equalizers are "isolators", adapted from analog crossover networks. Each EQ is combination of a high shelf filter, a band pass filter, and a low shelf filter. Each EQ type has a unique sound, so try them out to find out which one you prefer.
fr: Mixxx propose trois types d'égaliseurs de mixage avec une option de suppression complète. Ces égaliseurs sont des "isolateurs", adaptés à partir des réseaux de transition analogiques. Chaque égaliseur est une combinaison d'un filtre haut, d'un filtre passe-bande et d'un filtre bas. Chaque type d'égaliseur a un son unique, alors essayez-les pour savoir lequel vous préférez.
nl: Mixxx biedt drie soorten mixing equalizers met een volledige kill optie. Deze equalizers zijn "isolatoren", aangepast aan analoge cross-over netwerken. Elke EQ is een combinatie van een high shelf filter, een band pass filter en een low shelf filter. Elk EQ-type heeft een uniek geluid, dus probeer ze uit om erachter te komen welke je voorkeur heeft.

source: The Bessel EQs with Lipshitz and Vanderkooy Mix (LV-Mix) do not alter the sound or take any processing time when their knobs are in the center position. They activate once you adjust an EQ knob.
fr: Les égaliseurs Bessel avec Lipshitz et Vanderkooy Mix (LV-Mix) ne modifient pas le son et ne prennent aucun temps de traitement lorsque leurs potentiomètres sont en position centrale. Ils s'activent une fois que vous avez réglé un potentiomètre d'égalisation.
nl: De Bessel EQ's met Lipshitz en Vanderkooy Mix (LV-Mix) veranderen het geluid niet of nemen geen verwerkingstijd in beslag wanneer hun knoppen in de middenstand staan. Ze worden geactiveerd zodra u een EQ-knop aanpast.

source: The Linkwitz-Riley EQ on the other hand always applies a minimum, natural sounding phase shift to the sound. Their processing time does not change when you adjust the EQ knobs.
fr: L'égaliseur Linkwitz-Riley, d'autre part, applique toujours un décalage de phase minimum, sonnant naturel. Leur temps de traitement ne change pas lorsque vous ajustez les potentiomètres EQ.
nl: De Linkwitz-Riley EQ daarentegen past altijd een minimale, natuurlijk klinkende faseverschuiving toe op het geluid. Hun verwerkingstijd verandert niet wanneer u de EQ-knoppen aanpast.

source: The following table compares some technical parameters:
fr: Le tableau suivant compare certains paramètres techniques:
nl: De volgende tabel vergelijkt enkele technische parameters:

source: cut
fr: Coupure

source: roll-off
fr: Atténuation

source: phase shift
fr: Décalage de phase

source: bit perfect
fr: Bit pour bit

source: CPU usage
fr: Utilisation processeur
nl: CPU verbruik

source: soft
fr: doux
nl: zacht

source: linear
fr: linéaire
nl: lineair

source: yes
fr: oui
nl: ja

source: low
fr: faible
nl: laag

source: medium
fr: moyen

source: sharp
fr: tranchant
nl: scherp

source: no
fr: non
nl: nee

source: high
fr: haut
nl: hoog

source: cut: the frequency response (curve form) at the cross over frequency.
fr: Coupure : la réponse en fréquence (forme de courbe) à la fréquence de croisement.
nl: cut: de frequentierespons (curvevorm) bij de cross-over-frequentie.

source: roll-off: The steepness of the EQ bands.
fr: Atténuation : la raideur des bandes d'égalisation.
nl: roll-off: De steilheid van de EQ-banden.

source: linear phase: No phase distortion, all frequencies are processed with the same group delay.
fr: Phase linéaire : pas de distorsion de phase, toutes les fréquences sont traitées avec le même retard de groupe.
nl: lineaire fase: Geen fasevervorming, alle frequenties worden met dezelfde groepsvertraging verwerkt.

source: minimum phase: A natural phase distortion, the group delay changes by the frequency.
fr: Phase minimum : une distorsion de phase naturelle, le retard de groupe change en fonction de la fréquence.
nl: minimum fase: Een natuurlijke fase vervorming, de groepsvertraging verandert met de frequentie.

source: bit perfect: Whether the EQ leaves the original samples untouched when the EQ is at unity.
fr: Bit pour bit : si l'égaliseur laisse les échantillons originaux intacts lorsque l'égaliseur est à l'unité.
nl: bit perfect: Of de EQ de originele samples onaangeroerd laat als de EQ in eenheid is.

source: CPU usage: Processing time needed to calculate the EQ output.
fr: Utilisation processeur : temps de traitement nécessaire pour calculer la sortie de l'égaliseur.
nl: CPU-gebruik: Verwerkingstijd die nodig is om de EQ-uitvoer te berekenen.

source: **WASAPI**: Acceptable
nl: **WASAPI**: Aanvaardbaar

source: **OSS**: Acceptable
nl: **OSS**: Aanvaardbaar

source: Option
nl: Optie

source: Description
nl: Omschrijving
