Repository: Eve00000/manual
Catalog: source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: Mixxx |version| User Manual
ru: Mixxx |version| руководство пользователя

source: Mixxx is `free <https://www.gnu.org/philosophy/free-sw.html>`_ DJ software for Windows, macOS and Linux. It's easy to use, even if you've never DJed. Mixxx offers a variety of features to help beginners get started and help experienced DJs get creative:
ru: Mixxx - это `свободное <https://www.gnu.org/philosophy/free-sw.html>`_ программное обеспечение для диджеев под Windows, macOS and Linux. Он прост в использовании, даже если вы никогда не занимались диджеингом. Mixxx предлагает множество функций, которые помогут новичкам начать работу, а опытным диджеям помогут проявить творческий подход:

source: beat, tempo, and musical key detection
ru: Определение темпа в автоматическом и ручном режимах

source: master sync
ru: Синхронизация темпа

source: hotcues
ru: Горячие точки

source: looping
ru: Петли

source: 4 decks
ru: 4 деки

source: effects
ru: Эффекты

source: You can use Mixxx to perform with :term:`MIDI` and :term:`HID` controllers, CD players, vinyl turntables or even just your computer's keyboard and mouse.
ru: Вы можете использовать Mixxx для работы с :term:`MIDI` и :term:`HID` контроллерами, CD проигрывателями, проигрывателями виниловых пластинок или даже просто с клавиатурой и мышью вашего компьютера.

source: Table of Contents
ru: Оглавление
